
#Область СлужебныеПроцедурыИФункции

// См. ВариантыОтчетовПереопределяемый.НастроитьВариантыОтчетов.
Процедура НастроитьВариантыОтчетов(Настройки) Экспорт
	
	// Основной раздел Зарплата
	Вариант = ВариантыОтчетов.ОписаниеВарианта(Настройки, Метаданные.Отчеты.АнализНачисленийИУдержаний, "ПолныйСводНачисленийУдержанийИВыплат");
	Вариант.Размещение.Очистить();
	Вариант.Размещение.Вставить(Метаданные.Подсистемы.Зарплата, "Важный");
	Вариант = ВариантыОтчетов.ОписаниеВарианта(Настройки, Метаданные.Отчеты.АнализНачисленийИУдержаний, "РасчетныйЛисток");
	Вариант.Размещение.Очистить();
	Вариант.Размещение.Вставить(Метаданные.Подсистемы.Зарплата, "Важный");
	
	// Формируем см. также раздела Зарплата.
	Вариант = ВариантыОтчетов.ОписаниеВарианта(Настройки, Метаданные.Отчеты.АнализНачисленийИУдержаний, "КраткийСводНачисленийИУдержаний");
	Вариант.Размещение.Очистить();
	Вариант.Размещение.Вставить(Метаданные.Подсистемы.Зарплата, "СмТакже");
	Вариант = ВариантыОтчетов.ОписаниеВарианта(Настройки, Метаданные.Отчеты.АнализНачисленийИУдержаний, "КраткийСводПоИсточникамФинансирования");
	Вариант.Размещение.Очистить();
	Вариант.Размещение.Вставить(Метаданные.Подсистемы.Зарплата, "СмТакже");
	Вариант = ВариантыОтчетов.ОписаниеВарианта(Настройки, Метаданные.Отчеты.ЛицевыеСчетаСотрудников, "Т54");
	Вариант.Размещение.Очистить();
	Вариант.Размещение.Вставить(Метаданные.Подсистемы.Зарплата, "СмТакже");
	Вариант = ВариантыОтчетов.ОписаниеВарианта(Настройки, Метаданные.Отчеты.Договорники, "Договоры");
	Вариант.Размещение.Очистить();
	Вариант.Размещение.Вставить(Метаданные.Подсистемы.Зарплата, "СмТакже");
	
	// Формирование подраздела АнализЗарплаты.
	Вариант = ВариантыОтчетов.ОписаниеВарианта(Настройки, Метаданные.Отчеты.АнализНачисленийИУдержаний, "АнализЗарплатыПоПодразделениямИСотрудникам");
	Вариант.Размещение.Очистить();
	Вариант.Размещение.Вставить(Метаданные.Подсистемы.Зарплата.Подсистемы.АнализЗарплаты);
	Вариант = ВариантыОтчетов.ОписаниеВарианта(Настройки, Метаданные.Отчеты.АнализНачисленийИУдержаний, "АнализЗарплатыПоИсточникамФинансирования");
	Вариант.Размещение.Очистить();
	Вариант.Размещение.Вставить(Метаданные.Подсистемы.Зарплата.Подсистемы.АнализЗарплаты);
	Вариант = ВариантыОтчетов.ОписаниеВарианта(Настройки, Метаданные.Отчеты.АнализПлановыхНачислений, "АнализФОТПоНачислениям");
	Вариант.Размещение.Очистить();
	Вариант.Размещение.Вставить(Метаданные.Подсистемы.Зарплата.Подсистемы.АнализЗарплаты);
	Вариант = ВариантыОтчетов.ОписаниеВарианта(Настройки, Метаданные.Отчеты.АнализПлановыхНачислений, "АнализФОТПоСотрудникам");
	Вариант.Размещение.Очистить();
	Вариант.Размещение.Вставить(Метаданные.Подсистемы.Зарплата.Подсистемы.АнализЗарплаты);
	
	// Формирование подраздела ПерваяПоловинаМесяца.
	Вариант = ВариантыОтчетов.ОписаниеВарианта(Настройки, Метаданные.Отчеты.АнализНачисленийИУдержанийАвансом, "Т51ПерваяПоловинаМесяца");
	Вариант.Размещение.Очистить();
	Вариант.Размещение.Вставить(Метаданные.Подсистемы.Зарплата.Подсистемы.ПерваяПоловинаМесяца);
	Вариант = ВариантыОтчетов.ОписаниеВарианта(Настройки, Метаданные.Отчеты.АнализНачисленийИУдержанийАвансом, "РасчетныйЛистокПерваяПоловинаМесяца");
	Вариант.Размещение.Очистить();
	Вариант.Размещение.Вставить(Метаданные.Подсистемы.Зарплата.Подсистемы.ПерваяПоловинаМесяца);
	Вариант = ВариантыОтчетов.ОписаниеВарианта(Настройки, Метаданные.Отчеты.АнализНачисленийИУдержанийАвансом, "РасчетныйЛистокСРазбивкойПоИсточникамФинансированияПерваяПоловинаМесяца");
	Вариант.Размещение.Очистить();
	Вариант.Размещение.Вставить(Метаданные.Подсистемы.Зарплата.Подсистемы.ПерваяПоловинаМесяца);
	Вариант = ВариантыОтчетов.ОписаниеВарианта(Настройки, Метаданные.Отчеты.АнализНачисленийИУдержанийАвансом, "Форма0504402ПерваяПоловинаМесяца");
	Вариант.Размещение.Очистить();
	Вариант.Размещение.Вставить(Метаданные.Подсистемы.Зарплата.Подсистемы.ПерваяПоловинаМесяца);
	Вариант = ВариантыОтчетов.ОписаниеВарианта(Настройки, Метаданные.Отчеты.АнализНачисленийИУдержанийАвансом, "АнализЗарплатыПоПодразделениямИСотрудникамПерваяПоловинаМесяца");
	Вариант.Размещение.Очистить();
	Вариант.Размещение.Вставить(Метаданные.Подсистемы.Зарплата.Подсистемы.ПерваяПоловинаМесяца);
	Вариант = ВариантыОтчетов.ОписаниеВарианта(Настройки, Метаданные.Отчеты.АнализНачисленийИУдержанийАвансом, "АнализЗарплатыПоПодразделениямИСотрудникамПоИсточникамФинансированияПерваяПоловинаМесяца");
	Вариант.Размещение.Очистить();
	Вариант.Размещение.Вставить(Метаданные.Подсистемы.Зарплата.Подсистемы.ПерваяПоловинаМесяца);
	
	// Основной раздел Выплаты.
	// Выплаты
	Вариант = ВариантыОтчетов.ОписаниеВарианта(Настройки, Метаданные.Отчеты.АнализНачисленийИУдержаний, "Т51");
	Вариант.Размещение.Вставить(Метаданные.Подсистемы.ВыплатыПеречисления, "Важный");
	
	Вариант = ВариантыОтчетов.ОписаниеВарианта(Настройки, Метаданные.Отчеты.АнализНачисленийИУдержаний, "Форма0504402");
	Вариант.Размещение.Вставить(Метаданные.Подсистемы.ВыплатыПеречисления, "Важный");
	
	Вариант = ВариантыОтчетов.ОписаниеВарианта(Настройки, Метаданные.Отчеты.АнализНачисленийИУдержаний, "Форма0504401с2015");
	Вариант.Размещение.Вставить(Метаданные.Подсистемы.ВыплатыПеречисления, "Важный");
	
	Вариант = ВариантыОтчетов.ОписаниеВарианта(Настройки, Метаданные.Отчеты.АнализНачисленийИУдержаний, "ВедомостиСРазбивкойПоИсточникамФинансирования");
	Вариант.Размещение.Вставить(Метаданные.Подсистемы.ВыплатыПеречисления);
	
	Вариант = ВариантыОтчетов.ОписаниеВарианта(Настройки, Метаданные.Отчеты.ВыплатыНезарплатныхДоходов, "НезарплатныеДоходы");
	Вариант.Размещение.Вставить(Метаданные.Подсистемы.ВыплатыПеречисления);
	
	// Выплаты.ПерваяПоловинаМесяца
	Вариант = ВариантыОтчетов.ОписаниеВарианта(Настройки, Метаданные.Отчеты.АнализНачисленийИУдержанийАвансом, "Т51ПерваяПоловинаМесяца");
	Вариант.Размещение.Вставить(Метаданные.Подсистемы.ВыплатыПеречисления.Подсистемы.ПерваяПоловинаМесяца);
	Вариант = ВариантыОтчетов.ОписаниеВарианта(Настройки, Метаданные.Отчеты.АнализНачисленийИУдержанийАвансом, "Форма0504402ПерваяПоловинаМесяца");
	Вариант.Размещение.Вставить(Метаданные.Подсистемы.ВыплатыПеречисления.Подсистемы.ПерваяПоловинаМесяца);
	
	// Выплаты.СмТакже
	Вариант = ВариантыОтчетов.ОписаниеВарианта(Настройки, Метаданные.Отчеты.АнализНачисленийИУдержаний, "Форма0504401");
	Вариант.Размещение.Вставить(Метаданные.Подсистемы.ВыплатыПеречисления, "СмТакже");
	
	// Формирование подраздела Бухучет
	ПодразделРазмещение = Метаданные.Подсистемы.Зарплата.Подсистемы.Бухучет;
	Вариант = ВариантыОтчетов.ОписаниеВарианта(Настройки, Метаданные.Отчеты.НастройкиБухучета, "НастройкиБухучета");
	Вариант.Размещение.Очистить();
	Вариант.Размещение.Вставить(ПодразделРазмещение);
	Вариант = ВариантыОтчетов.ОписаниеВарианта(Настройки, Метаданные.Отчеты.ДанныеДляОтраженияРасчетовЗарплатыВБухучете, "ОтражениеВБухучете");
	Вариант.Размещение.Очистить();
	Вариант.Размещение.Вставить(ПодразделРазмещение);
	Вариант = ВариантыОтчетов.ОписаниеВарианта(Настройки, Метаданные.Отчеты.ДанныеДляОтраженияРасчетовЗарплатыВБухучете, "ОтражениеВБухучетеПоИсточникам");
	Вариант.Размещение.Очистить();
	Вариант.Размещение.Вставить(ПодразделРазмещение);
	
	Вариант = ВариантыОтчетов.ОписаниеВарианта(Настройки, Метаданные.Отчеты.СправкаРасчетРезервыОтпусков, "СправкаРасчетРезервыОтпусков");
	Вариант.Размещение.Очистить();
	Вариант.Размещение.Вставить(ПодразделРазмещение);
	Вариант = ВариантыОтчетов.ОписаниеВарианта(Настройки, Метаданные.Отчеты.СправкаРасчетРезервыОтпусков, "ОстаткиОборотыРезервовОтпусков");
	Вариант.Размещение.Очистить();
	Вариант.Размещение.Вставить(ПодразделРазмещение);
	Вариант = ВариантыОтчетов.ОписаниеВарианта(Настройки, Метаданные.Отчеты.СправкаРасчетРезервыОтпусков, "РезервыОтпусковПоСотрудникам");
	Вариант.Размещение.Очистить();
	Вариант.Размещение.Вставить(ПодразделРазмещение);
	
	// Формирование подраздела Удержания.
	Вариант = ВариантыОтчетов.ОписаниеВарианта(Настройки, Метаданные.Отчеты.АнализНачисленийИУдержаний, "УдержанияИзЗарплаты");
	Вариант.Размещение.Очистить();
	Вариант.Размещение.Вставить(Метаданные.Подсистемы.Зарплата.Подсистемы.Удержания);
	Вариант = ВариантыОтчетов.ОписаниеВарианта(Настройки, Метаданные.Отчеты.АнализНачисленийИУдержаний, "УдержанияВРазрезеИсточниковФинансирования");
	Вариант.Размещение.Очистить();
	Вариант.Размещение.Вставить(Метаданные.Подсистемы.Зарплата.Подсистемы.Удержания);
	
	// Формируем см. также раздела Кадры.
	Вариант = ВариантыОтчетов.ОписаниеВарианта(Настройки, Метаданные.Отчеты.Договорники, "Договорники");
	Вариант.Размещение.Очистить();
	Вариант.Размещение.Вставить(Метаданные.Подсистемы.Кадры, "СмТакже");
	Вариант = ВариантыОтчетов.ОписаниеВарианта(Настройки, Метаданные.Отчеты.ГрафикОтпусков, "Т7");
	Вариант.Размещение.Очистить();
	Вариант.Размещение.Вставить(Метаданные.Подсистемы.Кадры, "СмТакже");
	Вариант = ВариантыОтчетов.ОписаниеВарианта(Настройки, Метаданные.Отчеты.ВоинскийУчетОбщий, "СписокГражданПодлежащихПостановкеНаВоинскийУчет");
	Вариант.Размещение.Очистить();
	Вариант.Размещение.Вставить(Метаданные.Подсистемы.Кадры, "СмТакже");
	Вариант = ВариантыОтчетов.ОписаниеВарианта(Настройки, Метаданные.Отчеты.ВоинскийУчетОбщий, "СписокЮношейДляОВК");
	Вариант.Размещение.Очистить();
	Вариант.Размещение.Вставить(Метаданные.Подсистемы.Кадры, "СмТакже");
	Вариант = ВариантыОтчетов.ОписаниеВарианта(Настройки, Метаданные.Отчеты.ВоинскийУчетОбщий, "СписокПервоначальнойПостановкиНаВоинскийУчет");
	Вариант.Размещение.Очистить();
	Вариант.Размещение.Вставить(Метаданные.Подсистемы.Кадры, "СмТакже");
	
	// Раздел Налоги и Взносы
	
	// Формирование подраздела СтраховыеВзносы.
	ПодразделРазмещение = Метаданные.Подсистемы.НалогиИВзносы.Подсистемы.СтраховыеВзносы;
	
	Вариант = ВариантыОтчетов.ОписаниеВарианта(Настройки, Метаданные.Отчеты.АнализВзносовВФонды, "АнализВзносовВФонды");
	Вариант.Размещение.Очистить();
	Вариант.Размещение.Вставить(ПодразделРазмещение);
	Вариант = ВариантыОтчетов.ОписаниеВарианта(Настройки, Метаданные.Отчеты.АнализВзносовВФонды, "ПроверкаРасчетаВзносов");
	Вариант.Размещение.Очистить();
	Вариант.Размещение.Вставить(ПодразделРазмещение);
	
	Вариант = ВариантыОтчетов.ОписаниеВарианта(Настройки, Метаданные.Отчеты.ЗаявлениеДСВ1, "ЗаявлениеДСВ1");
	Вариант.Размещение.Очистить();
	Вариант.Размещение.Вставить(ПодразделРазмещение);
	
	Вариант = ВариантыОтчетов.ОписаниеВарианта(Настройки, Метаданные.Отчеты.КарточкаУчетаПоСтраховымВзносам, "КарточкаУчетаСтраховыхВзносовВЦелом");
	Вариант.Размещение.Очистить();
	Вариант.Размещение.Вставить(ПодразделРазмещение);
	Вариант = ВариантыОтчетов.ОписаниеВарианта(Настройки, Метаданные.Отчеты.КарточкаУчетаПоСтраховымВзносам, "КарточкаУчетаСтраховыхВзносовПоФилиалам");
	Вариант.Размещение.Очистить();
	Вариант.Размещение.Вставить(ПодразделРазмещение);
	
	Вариант = ВариантыОтчетов.ОписаниеВарианта(Настройки, Метаданные.Отчеты.АнализЭкономииОтПониженногоТарифаСтраховыхВзносов, "АнализЭкономииОтПониженногоТарифаСтраховыхВзносов");
	Вариант.Размещение.Очистить();
	Вариант.Размещение.Вставить(ПодразделРазмещение);


	// СтраховыеВзносыПереданныеВПФР, устарел
	
	// Формирование подраздела НДФЛ.
	ПодразделРазмещение = Метаданные.Подсистемы.НалогиИВзносы.Подсистемы.НДФЛ;
	
	Вариант = ВариантыОтчетов.ОписаниеВарианта(Настройки, Метаданные.Отчеты.АнализНДФЛ, "АнализНДФЛПоМесяцам"); 
	Вариант.Размещение.Очистить();
	Вариант.Размещение.Вставить(ПодразделРазмещение);
	Вариант = ВариантыОтчетов.ОписаниеВарианта(Настройки, Метаданные.Отчеты.АнализНДФЛ, "АнализУплатыНДФЛ"); 
	Вариант.Размещение.Очистить();
	Вариант.Размещение.Вставить(ПодразделРазмещение);
	Вариант = ВариантыОтчетов.ОписаниеВарианта(Настройки, Метаданные.Отчеты.АнализНДФЛ, "СводнаяСправка");
	Вариант.Размещение.Очистить();
	Вариант.Размещение.Вставить(ПодразделРазмещение);
	Вариант = ВариантыОтчетов.ОписаниеВарианта(Настройки, Метаданные.Отчеты.АнализНДФЛДетальный, "СводнаяСправка2НДФЛ"); 
	Вариант.Размещение.Очистить();
	Вариант.Размещение.Вставить(ПодразделРазмещение);
	Вариант = ВариантыОтчетов.ОписаниеВарианта(Настройки, Метаданные.Отчеты.АнализНДФЛДетальный, "АнализНДФЛПоДатамПолученияДоходов"); 
	Вариант.Размещение.Очистить();
	Вариант.Размещение.Вставить(ПодразделРазмещение);
	Вариант = ВариантыОтчетов.ОписаниеВарианта(Настройки, Метаданные.Отчеты.АнализНДФЛДетальный, "АнализНДФЛПоДокументамОснованиям"); 
	Вариант.Размещение.Очистить();
	Вариант.Размещение.Вставить(ПодразделРазмещение);
	Вариант = ВариантыОтчетов.ОписаниеВарианта(Настройки, Метаданные.Отчеты.АнализНДФЛДетальный, "АнализНДФЛПоМесяцамИСотрудникам"); 
	Вариант.Размещение.Очистить();
	Вариант.Размещение.Вставить(ПодразделРазмещение);
	Вариант = ВариантыОтчетов.ОписаниеВарианта(Настройки, Метаданные.Отчеты.АнализНДФЛДетальный, "АнализНДФЛПоМесяцамНалоговогоПериодаИМесяцамВзаиморасчетовССотрудниками"); 
	Вариант.Размещение.Очистить();
	Вариант.Размещение.Вставить(ПодразделРазмещение);
	Вариант = ВариантыОтчетов.ОписаниеВарианта(Настройки, Метаданные.Отчеты.АнализНДФЛДетальный, "ПодробныйАнализНДФЛПоСотруднику"); 
	Вариант.Размещение.Очистить();
	Вариант.Размещение.Вставить(ПодразделРазмещение);
	
	Вариант = ВариантыОтчетов.ОписаниеВарианта(Настройки, Метаданные.Отчеты.АнализОбязательствПоНДФЛ, "КонтрольСроковУплатыПоСтатьям"); 
	Вариант.Размещение.Очистить();
	Вариант.Размещение.Вставить(ПодразделРазмещение);
	Вариант = ВариантыОтчетов.ОписаниеВарианта(Настройки, Метаданные.Отчеты.АнализОбязательствПоНДФЛ, "КонтрольСроковУплатыПоИсточникам"); 
	Вариант.Размещение.Очистить();
	Вариант.Размещение.Вставить(ПодразделРазмещение);
	Вариант = ВариантыОтчетов.ОписаниеВарианта(Настройки, Метаданные.Отчеты.НачисленныеИПолученныеДоходыВОтчетахПоНДФЛ, "НачисленныеИПолученныеДоходыВОтчетахПоНДФЛ"); 
	Вариант.Размещение.Очистить();
	Вариант.Размещение.Вставить(ПодразделРазмещение);
	Вариант = ВариантыОтчетов.ОписаниеВарианта(Настройки, Метаданные.Отчеты.НачисленныеДоходыВОтчетахПоНДФЛ, "НачисленныеДоходыВОтчетахПоНДФЛ"); 
	Вариант.Размещение.Очистить();
	Вариант.Размещение.Вставить(ПодразделРазмещение);
	Вариант = ВариантыОтчетов.ОписаниеВарианта(Настройки, Метаданные.Отчеты.АнализОбязательствПоНДФЛ, "УдержанныйНДФЛ"); 
	Вариант.Размещение.Очистить();
	Вариант.Размещение.Вставить(ПодразделРазмещение);
	Вариант = ВариантыОтчетов.ОписаниеВарианта(Настройки, Метаданные.Отчеты.АнализОбязательствПоНДФЛ, "УдержанныйНДФЛПоСтатьям"); 
	Вариант.Размещение.Очистить();
	Вариант.Размещение.Вставить(ПодразделРазмещение);
	Вариант = ВариантыОтчетов.ОписаниеВарианта(Настройки, Метаданные.Отчеты.АнализОбязательствПоНДФЛ, "УдержанныйНДФЛПоИсточникам"); 
	Вариант.Размещение.Очистить();
	Вариант.Размещение.Вставить(ПодразделРазмещение);
	
	Вариант = ВариантыОтчетов.ОписаниеВарианта(Настройки, Метаданные.Отчеты.АнализУплатыНДФЛ, "Проверка6НДФЛ"); 
	Вариант.Размещение.Очистить();
	Вариант.Размещение.Вставить(ПодразделРазмещение);
	Вариант = ВариантыОтчетов.ОписаниеВарианта(Настройки, Метаданные.Отчеты.АнализУплатыНДФЛ, "КонтрольУплаты"); 
	Вариант.Размещение.Очистить();
	Вариант.Размещение.Вставить(ПодразделРазмещение);
		
	Вариант = ВариантыОтчетов.ОписаниеВарианта(Настройки, Метаданные.Отчеты.РегистрНалоговогоУчетаПоНДФЛ, "РегистрНалоговогоУчетаПоНДФЛ"); 
	Вариант.Размещение.Очистить();
	Вариант.Размещение.Вставить(ПодразделРазмещение);
	
	// Формируем см. также раздела Налоги и Взносы.
	Вариант = ВариантыОтчетов.ОписаниеВарианта(Настройки, Метаданные.Отчеты.НалогиИВзносыКратко, "НалогиИВзносыКратко");
	Вариант.Размещение.Очистить();
	Вариант.Размещение.Вставить(Метаданные.Подсистемы.НалогиИВзносы, "СмТакже");
	
	Вариант = ВариантыОтчетов.ОписаниеВарианта(Настройки, Метаданные.Отчеты.РеестрПолучателейСтраховогоОбеспечения, "РеестрПолучателейСтраховогоОбеспечения");
	Вариант.Размещение.Очистить();
	Вариант.Размещение.Вставить(Метаданные.Подсистемы.НалогиИВзносы, "СмТакже");
	
	Вариант = ВариантыОтчетов.ОписаниеВарианта(Настройки, Метаданные.Отчеты.СправкаРасчетФСС, "СправкаРасчетФСС");
	Вариант.Размещение.Очистить();
	Вариант.Размещение.Вставить(Метаданные.Подсистемы.НалогиИВзносы, "СмТакже");
	
	Вариант = ВариантыОтчетов.ОписаниеВарианта(Настройки, Метаданные.Отчеты.СтраховыеВзносыПереданныеВПФР, "ВзносыПоСотрудникамПереданныеВПФР");
	Вариант.Размещение.Очистить();
	Вариант.Размещение.Вставить(Метаданные.Подсистемы.НалогиИВзносы, "СмТакже");
	
КонецПроцедуры

#Область УстаревшиеПроцедурыИФункции

// Устарела. Следует отказаться от использования.
Процедура ПриЗаполненииПоставляемыхПрофилейГруппДоступа(ОписанияПрофилей, ПараметрыОбновления) Экспорт
	Возврат;
КонецПроцедуры

#КонецОбласти

#КонецОбласти
