#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.ТолькоОшибкиЗаполнения Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(Список.Отбор, "ЕстьОшибкиЗаполнения", Истина);
		Заголовок = НСтр("ru = 'Публикуемые сотрудники с ошибками заполнения'");
	КонецЕсли;
	
	Настройки = РегистрыСведений.НастройкиИнтеграцииКабинетСотрудника.НастройкиИнтеграции();
	Список.Параметры.УстановитьЗначениеПараметра("ВидКИАдресПочты", 		Настройки.ВидКонтактнойИнформацииАдресЭлектроннойПочты);
	Список.Параметры.УстановитьЗначениеПараметра("ВидКИМобильныйТелефон",	Настройки.ВидКонтактнойИнформацииМобильныйТелефон);
	Список.Параметры.УстановитьЗначениеПараметра("ОкончаниеПубликации",		ТекущаяДатаСеанса() - Настройки.ДнейСохраненияПубликации * 86400);
	Список.Параметры.УстановитьЗначениеПараметра("ДнейСохраненияПубликации",Настройки.ДнейСохраненияПубликации);
	
	ЗарплатаКадры.ПриСозданииНаСервереФормыСДинамическимСписком(ЭтотОбъект, "Список",,,, "ЕстьОшибкиЗаполнения");
	
КонецПроцедуры

#КонецОбласти



