#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ЗарплатаКадры.ОтключитьБизнесЛогикуПриЗаписи(ЭтотОбъект) Тогда
		Возврат;
	КонецЕсли;
	
	ВсегоНачислено = Начисления.Итог("Начислено");
	ВсегоВыплачено = Начисления.Итог("КВыплате");
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	ПроведениеСервер.ПодготовитьНаборыЗаписейКРегистрацииДвижений(ЭтотОбъект);
	
	ДанныеДляПроведения = ДанныеДляПроведения();
	
	СпособРасчетовСФизическимиЛицами = ?(ДанныеДляПроведения.ПараметрыПеречисленияНДФЛ.РегистрироватьВзаиморасчеты,
											Перечисления.СпособыРасчетовСФизическимиЛицами.Дивиденды,Неопределено);
	
	УчетНДФЛРасширенный.СформироватьДоходыИНДФЛСДивидендов(Ссылка, Движения, Отказ, Организация, ДатаВыплаты,
							ДанныеДляПроведения.Дивиденды, ВключатьВДекларациюПоНалогуНаПрибыль,
							Не ДанныеДляПроведения.ПараметрыПеречисленияНДФЛ.РегистрироватьВзаиморасчеты,
							ДанныеДляПроведения.ПараметрыПеречисленияНДФЛ.ДатаПлатежаНДФЛ,
							ДанныеДляПроведения.ПараметрыПеречисленияНДФЛ.ПеречислениеНДФЛРеквизиты);
	
	УчетНачисленнойЗарплаты.ПодготовитьДанныеНДФЛКРегистрации(ДанныеДляПроведения.Дивиденды, Организация, ДатаВыплаты);
	
	НДФЛПоСотрудникам = ДанныеДляПроведения.Дивиденды.СкопироватьКолонки();
	Для каждого СтрокаТЗ Из ДанныеДляПроведения.Дивиденды Цикл
		НалогНаПрибыльДляДивидендов = СтрокаТЗ.НалогНаПрибыльДляДивидендов;
		Если НалогНаПрибыльДляДивидендов * СтрокаТЗ.СуммаСПревышения > 0 Тогда 
			Если СтрокаТЗ.СуммаСПревышения > 0 Тогда
				ОстатокСуммыКЗачету = Макс(НалогНаПрибыльДляДивидендов - СтрокаТЗ.СуммаСПревышения, 0);
				СтрокаТЗ.СуммаСПревышения = Макс(СтрокаТЗ.СуммаСПревышения - НалогНаПрибыльДляДивидендов, 0);
			Иначе
				ОстатокСуммыКЗачету = Мин(НалогНаПрибыльДляДивидендов - СтрокаТЗ.СуммаСПревышения, 0);
				СтрокаТЗ.СуммаСПревышения = Мин(СтрокаТЗ.СуммаСПревышения - НалогНаПрибыльДляДивидендов, 0);
			КонецЕсли;
			НалогНаПрибыльДляДивидендов = ОстатокСуммыКЗачету;
		КонецЕсли;
		Если НалогНаПрибыльДляДивидендов * СтрокаТЗ.Сумма > 0 Тогда
			Если СтрокаТЗ.Сумма > 0 Тогда
				СтрокаТЗ.Сумма = Макс(СтрокаТЗ.Сумма - НалогНаПрибыльДляДивидендов, 0);
			Иначе
				СтрокаТЗ.Сумма = Мин(СтрокаТЗ.Сумма - НалогНаПрибыльДляДивидендов, 0);
			КонецЕсли;
		КонецЕсли;
		Если СтрокаТЗ.Сумма <> 0 Тогда
			НоваяСтрока = НДФЛПоСотрудникам.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаТЗ);
		КонецЕсли;
		Если СтрокаТЗ.СуммаСПревышения <> 0 Тогда
			НоваяСтрока = НДФЛПоСотрудникам.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаТЗ);
			НоваяСтрока.Сумма = СтрокаТЗ.СуммаСПревышения;
			НоваяСтрока.ВидУдержания = Перечисления.ВидыОсобыхНачисленийИУдержаний.НДФЛСПревышения;
		КонецЕсли;
	КонецЦикла;
	УчетНачисленнойЗарплатыРасширенный.ЗарегистрироватьНачисленияУдержанияПоКонтрагентамАкционерам(Движения, Отказ, Организация, ПериодРегистрации,
							ДанныеДляПроведения.Начисления , ДанныеДляПроведения.УдержанияКонтрагентов, НДФЛПоСотрудникам, СпособРасчетовСФизическимиЛицами);
							
	// Дополняем доходы НДФЛ сведениями о распределении по статьям финансирования и/или статьям расходов.
	ОтражениеЗарплатыВУчетеРасширенный.ДополнитьСведенияОДоходахНДФЛКонтрагентовСведениямиОРаспределенииПоСтатьям(Движения);
	
	ОтражениеЗарплатыВБухучетеРасширенный.СформироватьДвиженияБухучетНачисленияУдержанияПоКонтрагентамАкционерам(
					Движения, Отказ, Организация, ПериодРегистрации, ДанныеДляПроведения.Начисления, ДанныеДляПроведения.УдержанияКонтрагентов, НДФЛПоСотрудникам);
	
	РасчетЗарплатыРасширенный.СформироватьДвиженияУдержаний(Движения, Отказ, Организация, ПериодРегистрации, ДанныеДляПроведения.Удержания);
	ИсполнительныеЛисты.СформироватьУдержанияПоИсполнительнымДокументам(Движения, ДанныеДляПроведения.УдержанияПоИсполнительнымДокументам);
	РасчетЗарплатыРасширенный.СформироватьДвиженияУдержанийДоПределаПоСотрудникам(Движения, Отказ, ПериодРегистрации, ДанныеДляПроведения.УдержанияДоПределаПоСотрудникам);
	РасчетЗарплатыРасширенный.СформироватьЗадолженностьПоУдержаниямФизическихЛиц(Движения, ДанныеДляПроведения.ЗадолженностьПоУдержаниям);
	РасчетЗарплатыРасширенный.СформироватьДополнениеРасчетнойБазыУдержаний(Движения, ДанныеДляПроведения.ДополнениеРасчетнойБазыУдержаний);
	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	Если НЕ ПеречислениеНДФЛВыполнено Тогда
		ИсключаемыеРеквизиты = Новый Массив;
		ИсключаемыеРеквизиты.Добавить("ДатаПлатежаНДФЛ");
		ОбщегоНазначения.УдалитьНепроверяемыеРеквизитыИзМассива(ПроверяемыеРеквизиты, ИсключаемыеРеквизиты);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

Функция ДанныеДляПроведения() Экспорт

	Запрос = Новый Запрос;
	МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.УстановитьПараметр("НачалоРасчетаНДФЛПоПрогрессивнойШкале", УчетНДФЛ.ПараметрыРасчетаНДФЛПоПрогрессивнойШкале().НачалоРасчетаНДФЛПоПрогрессивнойШкале);
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Дивиденды.Ссылка КАК Ссылка,
	|	Дивиденды.Ссылка.ПериодРегистрации КАК Период,
	|	Дивиденды.Акционер КАК ФизическоеЛицо,
	|	Дивиденды.НДФЛ КАК НДФЛ,
	|	Дивиденды.НДФЛСПревышения КАК НДФЛСПревышения,
	|	ВЫБОР
	|		КОГДА Дивиденды.Ссылка.ДатаВыплаты >= &НачалоРасчетаНДФЛПоПрогрессивнойШкале
	|			ТОГДА Дивиденды.НалогНаПрибыльКЗачету
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК НалогНаПрибыльКЗачету,
	|	Дивиденды.Начислено КАК Начислено,
	|	Дивиденды.НомерСтроки КАК НомерСтроки,
	|	ВЫБОР
	|		КОГДА Дивиденды.Ссылка.ДатаВыплаты >= &НачалоРасчетаНДФЛПоПрогрессивнойШкале
	|			ТОГДА 0
	|		ИНАЧЕ Дивиденды.ВычетПоНДФЛ
	|	КОНЕЦ КАК ВычетПоНДФЛ,
	|	Дивиденды.КВыплате КАК КВыплате,
	|	Дивиденды.Удержано КАК Удержано,
	|	ВЫБОР
	|		КОГДА Дивиденды.СтавкаНДФЛ = ЗНАЧЕНИЕ(Перечисление.НДФЛСтавки.Ставка05)
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.КатегорииДоходовНДФЛ.ДивидендыПоСтавке05)
	|		КОГДА Дивиденды.СтавкаНДФЛ = ЗНАЧЕНИЕ(Перечисление.НДФЛСтавки.Ставка10)
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.КатегорииДоходовНДФЛ.ДивидендыПоСтавке10)
	|		КОГДА Дивиденды.СтавкаНДФЛ = ЗНАЧЕНИЕ(Перечисление.НДФЛСтавки.Ставка12)
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.КатегорииДоходовНДФЛ.ДивидендыПоСтавке12)
	|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.КатегорииДоходовНДФЛ.Дивиденды)
	|	КОНЕЦ КАК КатегорияДохода
	|ПОМЕСТИТЬ ВТДанныеДокумента
	|ИЗ
	|	Документ.ДивидендыФизическимЛицам.Начисления КАК Дивиденды
	|ГДЕ
	|	Дивиденды.Ссылка = &Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ТаблицаНДФЛ.ФизическоеЛицо КАК ФизическоеЛицо
	|ИЗ
	|	ВТДанныеДокумента КАК ТаблицаНДФЛ";
	
	// Физические лица, работающие в организации
	Акционеры = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("ФизическоеЛицо");
	ОтборАкционеры = Новый Массив;
	ЗарплатаКадрыОбщиеНаборыДанных.ДобавитьВКоллекциюОтбор(ОтборАкционеры, "ФизическоеЛицо", "В", Акционеры, Истина);
	КадровыйУчет.СоздатьВТФизическиеЛицаРаботавшиеВОрганизации(МенеджерВременныхТаблиц, Истина, Организация, ДатаВыплаты, ДатаВыплаты, , Истина, ОтборАкционеры);
	Запрос.Текст = "ВЫБРАТЬ ФизическиеЛицаРаботавшиеВОрганизации.* ИЗ ВТФизическиеЛицаРаботавшиеВОрганизации КАК ФизическиеЛицаРаботавшиеВОрганизации";
	ФизическиеЛицаРаботавшиеВОрганизации = Запрос.Выполнить().Выгрузить();
	ЗарплатаКадры.УничтожитьВТ(МенеджерВременныхТаблиц, "ВТФизическиеЛицаРаботавшиеВОрганизации");
	КадровыйУчет.СоздатьВТОсновныеСотрудникиФизическихЛиц(МенеджерВременныхТаблиц, Истина, ФизическиеЛицаРаботавшиеВОрганизации, Организация, ДатаВыплаты, ДатаВыплаты);
	
	ДанныеДляПроведения = Новый Структура;
	ДанныеДляПроведения.Вставить("Дивиденды", Документы.ДивидендыФизическимЛицам.ДанныеДляПроведенияДивиденды(МенеджерВременныхТаблиц));
	
	ДанныеДляПроведения.Вставить("Начисления", ДанныеДляПроведения.Дивиденды.Скопировать( , "Акционер,Начисление,Ссылка,Сотрудник,Начислено,СтатьяРасходов,ВидДоходаИсполнительногоПроизводства"));
	ДанныеДляПроведения.Начисления.Колонки["Акционер"].Имя = "ФизическоеЛицо";
	ДанныеДляПроведения.Начисления.Колонки["Ссылка"].Имя = "ДокументОснование";
	ДанныеДляПроведения.Начисления.Колонки["Начислено"].Имя = "Сумма";
	
	ДополнениеРасчетнойБазыУдержаний = ДанныеДляПроведения.Начисления.Скопировать();
	ДополнениеРасчетнойБазыУдержаний.Свернуть("ФизическоеЛицо,Сотрудник,Начисление", "Сумма");
	ДополнениеРасчетнойБазыУдержаний.Колонки.Добавить("ГоловнаяОрганизация");
	ДополнениеРасчетнойБазыУдержаний.Колонки.Добавить("Организация");
	ДополнениеРасчетнойБазыУдержаний.Колонки.Добавить("Период");
	ГоловнаяОрганизация = ЗарплатаКадрыПовтИсп.ГоловнаяОрганизация(Организация);
	ДополнениеРасчетнойБазыУдержаний.ЗаполнитьЗначения(ГоловнаяОрганизация, "ГоловнаяОрганизация");
	ДополнениеРасчетнойБазыУдержаний.ЗаполнитьЗначения(Организация, "Организация");
	ДополнениеРасчетнойБазыУдержаний.ЗаполнитьЗначения(ПериодРегистрации, "Период");
	ДанныеДляПроведения.Вставить("ДополнениеРасчетнойБазыУдержаний", ДополнениеРасчетнойБазыУдержаний);
	
	РаспределениеПоСтатьям = ДанныеДляПроведения.Дивиденды.Скопировать( , "Акционер,СтатьяРасходов,ВидДоходаИсполнительногоПроизводства");
	Запрос.УстановитьПараметр("РаспределениеПоСтатьям", РаспределениеПоСтатьям);
	
	// Удержания
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Распределение.Акционер КАК ФизическоеЛицо,
	|	Распределение.СтатьяРасходов КАК СтатьяРасходов,
	|	Распределение.ВидДоходаИсполнительногоПроизводства КАК ВидДоходаИсполнительногоПроизводства
	|ПОМЕСТИТЬ ВТРаспределениеПоСтатьям
	|ИЗ
	|	&РаспределениеПоСтатьям КАК Распределение
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Удержания.ФизическоеЛицо КАК ФизическоеЛицо,
	|	Удержания.Удержание.КатегорияУдержания КАК КатегорияУдержания,
	|	Удержания.ДокументОснование КАК ДокументОснование,
	|	Удержания.Результат КАК Результат,
	|	Удержания.ДатаНачала КАК ДатаНачала,
	|	Удержания.ДатаОкончания КАК ДатаОкончания,
	|	Удержания.Получатель КАК Получатель,
	|	Удержания.ПлатежныйАгент КАК ПлатежныйАгент,
	|	Удержания.Ссылка.Организация КАК Организация,
	|	Удержания.Удержание КАК Удержание,
	|	РаспределениеПоСтатьям.СтатьяРасходов КАК СтатьяРасходов,
	|	РаспределениеПоСтатьям.ВидДоходаИсполнительногоПроизводства КАК ВидДоходаИсполнительногоПроизводства
	|ПОМЕСТИТЬ ВТУдержания
	|ИЗ
	|	Документ.ДивидендыФизическимЛицам.Удержания КАК Удержания
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТРаспределениеПоСтатьям КАК РаспределениеПоСтатьям
	|		ПО Удержания.ФизическоеЛицо = РаспределениеПоСтатьям.ФизическоеЛицо
	|ГДЕ
	|	Удержания.Ссылка = &Ссылка
	|	И Удержания.Результат <> 0
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Удержания.Организация КАК Организация,
	|	Удержания.ФизическоеЛицо КАК ФизическоеЛицо,
	|	Удержания.Результат КАК Сумма,
	|	Удержания.КатегорияУдержания КАК КатегорияУдержания,
	|	Удержания.ДокументОснование КАК ДокументОснование,
	|	Удержания.Удержание КАК НачислениеУдержание,
	|	ВЫБОР
	|		КОГДА Удержания.КатегорияУдержания = ЗНАЧЕНИЕ(Перечисление.КатегорииУдержаний.ИсполнительныйЛист)
	|			ТОГДА Удержания.Получатель
	|		КОГДА Удержания.КатегорияУдержания = ЗНАЧЕНИЕ(Перечисление.КатегорииУдержаний.ВознаграждениеПлатежногоАгента)
	|			ТОГДА Удержания.ПлатежныйАгент
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ КАК Контрагент,
	|	Удержания.СтатьяРасходов КАК СтатьяРасходов,
	|	Удержания.ВидДоходаИсполнительногоПроизводства КАК ВидДоходаИсполнительногоПроизводства
	|ИЗ
	|	ВТУдержания КАК Удержания
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ИсполнительныеЛисты.ДокументОснование КАК ИсполнительныйДокумент,
	|	ИсполнительныеЛисты.Получатель КАК Получатель,
	|	ИсполнительныеЛисты.ПлатежныйАгент КАК ПлатежныйАгент,
	|	НАЧАЛОПЕРИОДА(ИсполнительныеЛисты.ДатаНачала, МЕСЯЦ) КАК МесяцУдержания,
	|	СУММА(ВЫБОР
	|			КОГДА ИсполнительныеЛисты.КатегорияУдержания = ЗНАЧЕНИЕ(Перечисление.КатегорииУдержаний.ИсполнительныйЛист)
	|				ТОГДА ИсполнительныеЛисты.Результат
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК СуммаУдержания,
	|	СУММА(ВЫБОР
	|			КОГДА ИсполнительныеЛисты.КатегорияУдержания = ЗНАЧЕНИЕ(Перечисление.КатегорииУдержаний.ВознаграждениеПлатежногоАгента)
	|				ТОГДА ИсполнительныеЛисты.Результат
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК СуммаВознагражденияПлатежногоАгента
	|ИЗ
	|	ВТУдержания КАК ИсполнительныеЛисты
	|
	|СГРУППИРОВАТЬ ПО
	|	ИсполнительныеЛисты.ДокументОснование,
	|	ИсполнительныеЛисты.Получатель,
	|	ИсполнительныеЛисты.ПлатежныйАгент,
	|	НАЧАЛОПЕРИОДА(ИсполнительныеЛисты.ДатаНачала, МЕСЯЦ)
	|
	|ИМЕЮЩИЕ
	|	(СУММА(ВЫБОР
	|				КОГДА ИсполнительныеЛисты.КатегорияУдержания = ЗНАЧЕНИЕ(Перечисление.КатегорииУдержаний.ИсполнительныйЛист)
	|					ТОГДА ИсполнительныеЛисты.Результат
	|				ИНАЧЕ 0
	|			КОНЕЦ) <> 0
	|		ИЛИ СУММА(ВЫБОР
	|				КОГДА ИсполнительныеЛисты.КатегорияУдержания = ЗНАЧЕНИЕ(Перечисление.КатегорииУдержаний.ВознаграждениеПлатежногоАгента)
	|					ТОГДА ИсполнительныеЛисты.Результат
	|				ИНАЧЕ 0
	|			КОНЕЦ) <> 0)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Удержания.ФизическоеЛицо КАК ФизическоеЛицо,
	|	Удержания.Результат КАК Результат,
	|	Удержания.ДокументОснование КАК ДокументОснование,
	|	Удержания.Удержание КАК Удержание,
	|	Удержания.Получатель КАК Получатель,
	|	Удержания.ПлатежныйАгент КАК ПлатежныйАгент,
	|	Удержания.ДатаНачала КАК ДатаНачала,
	|	Удержания.ДатаОкончания КАК ДатаОкончания
	|ИЗ
	|	ВТУдержания КАК Удержания";
	
	Результат = Запрос.ВыполнитьПакет();
	ДанныеДляПроведения.Вставить("УдержанияКонтрагентов", Результат[2].Выгрузить());
	ДанныеДляПроведения.Вставить("УдержанияПоИсполнительнымДокументам", Результат[3].Выгрузить());
	ДанныеДляПроведения.Вставить("Удержания", Результат[4].Выгрузить());
	
	// Удержания до предела по сотрудникам
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ПредельныеСуммыУдержанийСотрудниковСрезПоследних.Организация КАК Организация,
	|	ПредельныеСуммыУдержанийСотрудниковСрезПоследних.ФизическоеЛицо КАК ФизическоеЛицо,
	|	ПредельныеСуммыУдержанийСотрудниковСрезПоследних.Удержание КАК Удержание,
	|	ПредельныеСуммыУдержанийСотрудниковСрезПоследних.ДокументОснование КАК ДокументОснование,
	|	ПредельныеСуммыУдержанийСотрудниковСрезПоследних.ПрекратитьПоДостижениюПредела КАК ПрекратитьПоДостижениюПредела
	|ПОМЕСТИТЬ ВТПредельныеСуммыУдержаний
	|ИЗ
	|	РегистрСведений.ПредельныеСуммыУдержанийСотрудников.СрезПоследних(
	|			,
	|			(Организация, ФизическоеЛицо, Удержание, ДокументОснование) В
	|				(ВЫБРАТЬ
	|					ЗаписиУдержаний.Организация,
	|					ЗаписиУдержаний.ФизическоеЛицо,
	|					ЗаписиУдержаний.Удержание,
	|					ЗаписиУдержаний.ДокументОснование
	|				ИЗ
	|					ВТУдержания КАК ЗаписиУдержаний)) КАК ПредельныеСуммыУдержанийСотрудниковСрезПоследних
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход) КАК ВидДвижения,
	|	ЗаписиУдержаний.Организация КАК Организация,
	|	ЗаписиУдержаний.ФизическоеЛицо КАК ФизическоеЛицо,
	|	ЗаписиУдержаний.Удержание КАК Удержание,
	|	ЗаписиУдержаний.ДокументОснование КАК ДокументОснование,
	|	ЗаписиУдержаний.Результат КАК Сумма
	|ИЗ
	|	ВТУдержания КАК ЗаписиУдержаний
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТПредельныеСуммыУдержаний КАК ПредельныеСуммыУдержаний
	|		ПО ЗаписиУдержаний.Организация = ПредельныеСуммыУдержаний.Организация
	|			И ЗаписиУдержаний.ФизическоеЛицо = ПредельныеСуммыУдержаний.ФизическоеЛицо
	|			И ЗаписиУдержаний.Удержание = ПредельныеСуммыУдержаний.Удержание
	|			И ЗаписиУдержаний.ДокументОснование = ПредельныеСуммыУдержаний.ДокументОснование
	|			И (ПредельныеСуммыУдержаний.ПрекратитьПоДостижениюПредела)";
		
	ДанныеДляПроведения.Вставить("УдержанияДоПределаПоСотрудникам", Запрос.Выполнить().Выгрузить());
	
	ДанныеДляПроведения.Вставить("ЗадолженностьПоУдержаниям");
	РасчетЗарплатыРасширенный.ЗаполнитьПогашениеЗадолженностиПоУдержаниям(ДанныеДляПроведения, Ссылка, ПериодРегистрации);
	
	ПараметрыПеречисленияНДФЛ = Новый Структура("РегистрироватьВзаиморасчеты,ДатаПлатежаНДФЛ,ПеречислениеНДФЛРеквизиты,ПеречислениеНДФЛВыполнено");
	ПараметрыПеречисленияНДФЛ.РегистрироватьВзаиморасчеты = ПолучитьФункциональнуюОпцию("ИспользоватьВедомостиДляВыплатыПрочихДоходов") И РегистрироватьВыплатуВедомостью;
	ПараметрыПеречисленияНДФЛ.ПеречислениеНДФЛВыполнено = ПеречислениеНДФЛВыполнено;
	ПараметрыПеречисленияНДФЛ.ПеречислениеНДФЛРеквизиты = ?(ПеречислениеНДФЛВыполнено,ПеречислениеНДФЛРеквизиты,Неопределено);
	ПараметрыПеречисленияНДФЛ.ДатаПлатежаНДФЛ 			= ?(ПеречислениеНДФЛВыполнено,ДатаПлатежаНДФЛ,Неопределено);
	ДанныеДляПроведения.Вставить("ПараметрыПеречисленияНДФЛ", ПараметрыПеречисленияНДФЛ);
	
	Возврат ДанныеДляПроведения;
	
КонецФункции 

#КонецОбласти

#Иначе
ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.'");
#КонецЕсли