////////////////////////////////////////////////////////////////////////////////
// Подсистема "Контрагенты".
//
////////////////////////////////////////////////////////////////////////////////

#Область СлужебныйПрограммныйИнтерфейс

// Регистрирует обработчики обновления этой подсистемы.
//
// Параметры:
//   Обработчики - ТаблицаЗначений - см. ОбновлениеИнформационнойБазы.НоваяТаблицаОбработчиковОбновления().
//
Процедура ЗарегистрироватьОбработчикиОбновления(Обработчики) Экспорт
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "3.1.2.128";
	Обработчик.РежимВыполнения = "Отложенно";
	Обработчик.Процедура = "КонтрагентыСлужебный.ОбновитьПараметрыДополнительныхСвойств";
	Обработчик.Идентификатор = Новый УникальныйИдентификатор("8254129b-fcfd-11e6-bda0-5404a6a6895d");
	Обработчик.Комментарий = НСтр("ru = 'Обновление параметров дополнительных свойств справочника Контрагенты.'");
	
КонецПроцедуры

#Область Свойства

// См. УправлениеСвойствамиПереопределяемый.ПриПолученииПредопределенныхНаборовСвойств.
Процедура ПриПолученииПредопределенныхНаборовСвойств(Наборы) Экспорт
	
	УправлениеСвойствамиБЗК.ЗарегистрироватьНаборСвойств(Наборы, "c091b4f6-9802-11e9-80cd-4cedfb43b11a", Метаданные.Справочники.Контрагенты);
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Обновляет параметры дополнительных свойств справочника Контрагенты.
Процедура ОбновитьПараметрыДополнительныхСвойств(ПараметрыОбновления = Неопределено) Экспорт
	
	УправлениеСвойствами.УстановитьПараметрыНабораСвойств(
		"Справочник_Контрагенты",
		УправлениеСвойствами.СтруктураПараметровНабораСвойств());
	
	ОбновлениеИнформационнойБазыЗарплатаКадрыБазовый.УстановитьПараметрОбновления(
		ПараметрыОбновления,
		"ОбработкаЗавершена",
		Истина);
	
КонецПроцедуры

#КонецОбласти

