#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПриЗаписи(Отказ)
	
	Если ОбщегоНазначения.ПодсистемаСуществует("ЗарплатаКадрыПриложения.ПереносДанныхЗарплатаКадры") Тогда
		Модуль = ОбщегоНазначения.ОбщийМодуль("ПереносДанныхЗарплатаКадры");
		Модуль.УстановитьДоступенПереносДанныхИзПрежнихПрограмм(Значение);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Иначе
ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.'");
#КонецЕсли