#Область СлужебныйПрограммныйИнтерфейс

// Добавляет в список Обработчики процедуры-обработчики обновления,
// необходимые данной подсистеме.
//
// Параметры:
//   Обработчики - ТаблицаЗначений - см. описание функции НоваяТаблицаОбработчиковОбновления
//                                   общего модуля ОбновлениеИнформационнойБазы.
// 
Процедура ЗарегистрироватьОбработчикиОбновления(Обработчики) Экспорт
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "3.1.10.30";
	Обработчик.Процедура = "Документы.ПеречислениеНДФЛВБюджет.ЗаполнитьРегистрациюВНалоговомОргане";
	Обработчик.РежимВыполнения = ОбновлениеИнформационнойБазыЗарплатаКадрыБазовый.ОсновнойРежимВыполненияОбновления();
	Обработчик.Идентификатор = Новый УникальныйИдентификатор("14f95359-13bf-4db4-b488-93146ed1b10a");
	Обработчик.Комментарий = НСтр("ru = 'Заполнение Регистрации в налоговом органе в документе Перечисление НДФЛ в бюджет.'");
	
КонецПроцедуры	

#Область ДатыЗапретаИзмененияДанных

Процедура ЗаполнитьИсточникиДанныхДляПроверкиЗапретаИзменения(ИсточникиДанных) Экспорт
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.ПеречислениеНДФЛВБюджет",			"ДатаПлатежа", 	"НДФЛ", 	"Организация");
КонецПроцедуры

#КонецОбласти

#Область Свойства

// См. УправлениеСвойствамиПереопределяемый.ПриПолученииПредопределенныхНаборовСвойств.
Процедура ПриПолученииПредопределенныхНаборовСвойств(Наборы) Экспорт
	
	УправлениеСвойствамиБЗК.ЗарегистрироватьНаборСвойств(Наборы, "d42dbfcc-9802-11e9-80cd-4cedfb43b11a", Метаданные.Документы.ПеречислениеНДФЛВБюджет);
	
КонецПроцедуры

#КонецОбласти

#Область УправлениеДоступом

// См. УправлениеДоступомПереопределяемый.ПриЗаполненииСписковСОграничениемДоступа.
Процедура ПриЗаполненииСписковСОграничениемДоступа(Списки) Экспорт
	
	Списки.Вставить(Метаданные.Документы.ПеречислениеНДФЛВБюджет, Истина);
	Списки.Вставить(Метаданные.Справочники.ПеречислениеНДФЛВБюджетПрисоединенныеФайлы, Истина);
	Списки.Вставить(Метаданные.ЖурналыДокументов.ПеречисленияНДФЛВБюджет, Истина);
	
КонецПроцедуры

#КонецОбласти

// Определяет доступность команды ввода документа ПеречислениеНДФЛВБюджет.
// Команда доступна (видима), если используются ВХО и пользователю доступно проведение документа.
//
Функция ПоказыватьВводДокументаПеречисленияНДФЛ() Экспорт
	
	Возврат ПолучитьФункциональнуюОпцию("ИспользоватьВнешниеХозяйственныеОперацииЗарплатаКадры")
			И ПравоДоступа("Проведение", Метаданные.Документы.ПеречислениеНДФЛВБюджет);

КонецФункции

Процедура ЗаменитьВЗапросеПеречислениеНДФЛВБюджет(Запрос) Экспорт
	
	Запрос = СтрЗаменить(Запрос, "&ПеречислениеНДФЛВБюджет", "ЗНАЧЕНИЕ(Документ.ПеречислениеНДФЛВБюджет.ПустаяСсылка)");
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Определяет объекты, в которых есть процедура ДобавитьКомандыПечати().
// Подробнее см. УправлениеПечатьюПереопределяемый.
//
// Параметры:
//  СписокОбъектов - Массив - список менеджеров объектов.
//
Процедура ПриОпределенииОбъектовСКомандамиПечати(СписокОбъектов) Экспорт
	
	СписокОбъектов.Добавить(Документы.ПеречислениеНДФЛВБюджет);
	
КонецПроцедуры

#КонецОбласти
