#Область СлужебныеПроцедурыИФункции

// Обработчик события ПриСозданииНаСервере формы документа.
// 	Устанавливает первоначальные значения реквизитов объекта.
//	Инициализирует реквизиты формы.
//
// Параметры:
// 	Форма - ФормаКлиентскогоПриложения - форма, которая создается.
// 	Отказ - Булево - признак отказа от создания формы.
// 	СтандартнаяОбработка - Булево - признак выполнения стандартной обработки события.
//
Процедура ПриСозданииНаСервере(Форма, Отказ, СтандартнаяОбработка) Экспорт
	
	ДепонированиеЗарплатыФормыБазовый.ПриСозданииНаСервере(Форма, Отказ, СтандартнаяОбработка);
	
	// Когда ведомости оплачиваются за пределами конфигурации,
	// нет смысла в заполнении невыплаченными, ведь сведений о выплатах нет.
	// (будут депонированы все строки ведомости)
	Если ПолучитьФункциональнуюОпцию("ИспользоватьВнешниеХозяйственныеОперацииЗарплатаКадры") Тогда
		Форма.Элементы.Заполнить.Видимость = Ложь;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
