#Область СлужебныйПрограммныйИнтерфейс

Процедура ОткрытьФормуИзмененияАккредитаций(Форма) Экспорт
	СтруктураОтбора = Новый Структура("ФизическоеЛицо", Форма.ФизическоеЛицоСсылка);
	ПараметрыОткрытия = Новый Структура("Отбор", СтруктураОтбора);
	ОткрытьФорму("РегистрСведений.СведенияОбАккредитацияхСпециалистов.Форма.ФормаНабораЗаписей", ПараметрыОткрытия, Форма);
КонецПроцедуры

Процедура ОбработкаОповещенияФормыОбразованиеКвалификация(Форма, ИмяСобытия, Параметр) Экспорт
	Если ИмяСобытия = "ИзмененыАккредитацииСпециалиста" Тогда
		Форма.ФизическоеЛицоАккредитацииТекст = Параметр;
	КонецЕсли;		
КонецПроцедуры

#КонецОбласти