#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейсБТС

// Обработчик выполнения команды учетной системы.
// @skip-warning ПустойМетод - особенность реализации
//
// Параметры:
//  УчетнаяСистема - ОпределяемыйТип.УчетныеСистемыИнтеграцииОбластейДанных - учетная система.
//  ПотокДанныхКоманды - ФайловыйПоток, ПотокВПамяти - данные команды. 
//  КодВозврата - Число - код возврата обработчика (по умолчанию - 10200)
//  Ошибка - Булево - признак ошибки (по умолчанию - Ложь)
//  СообщениеОбОшибке - Строка - подробности ошибки (по умолчанию не заполнено).
// Возвращаемое значение:
//   - Структура - результат выполнения команды, информация о созданном или измененном объекте.
//      * ИдентификаторОбъекта - Строка - идентификатор объекта.
//      * Обработчик - Строка - идентификатор обработчика.
//      * Данные - ДвоичныеДанные - данные объекта (не обязательно), если не переданы, будут запрошены при отправке.
//
Функция ВыполнитьКоманду(УчетнаяСистема, ПотокДанныхКоманды, КодВозврата, Ошибка, СообщениеОбОшибке) Экспорт
	
КонецФункции


// Возвращает двоичные данные и идентификатор обработчика объекта,
// которые будут переданы в составе zip-архива во внешнюю учетную систему.
// @skip-warning ПустойМетод - особенность реализации
//
// Параметры:
//  УчетнаяСистема - ОпределяемыйТип.УчетныеСистемыИнтеграцииОбластейДанных
//  ИдентификаторОбъекта - Строка(50) - идентификатор объекта. 
//  Обработчик - Строка(50) - обработчик данных объекта. 
// 
// Возвращаемое значение:
//   - ДвоичныеДанные - данные объекта. 
//
Функция ДанныеОбъекта(УчетнаяСистема, ИдентификаторОбъекта, Обработчик) Экспорт
		
КонецФункции

// Предназначен для обработки подтверждений, полученных от учетной системы после принятия файлов данных.
// В ней можно определить действия с интегрируемыми объектами, по которым пришли подтверждения.
// @skip-warning ПустойМетод - особенность реализации
//
// Параметры:
//  УчетнаяСистема - ОпределяемыйТип.УчетныеСистемыИнтеграцииОбластейДанных
//  Подтверждения - Соответствие
//                  * Ключ - Строка - это идентификатор объекта
//                  * Значение - Структура
//                      ** Версия - Строка - версия объекта
//                      ** Версия - Строка - версия объекта
//                      ** КодВозврата - Число - код возврата, определяется во внешней учетной системе.
//                         Рекомендуемые коды возврата см. в процедуре ИнтеграцияОбъектовОбластейДанныхПовтИсп.КодыВозврата
//                      ** Ошибка - Булево - признак ошибки (по умолчанию - Ложь)
//                      ** СообщениеОбОшибке - Строка - поднобности ошибки (по умолчанию не заполнено)
//  СтандартнаяОбработка - Булево - признак стандартной обработки. Если Ложь, то обработанные объекты 
//                       не будут удалены из списка объектов к отправке.
//
Процедура ОбработатьПодтверждения(УчетнаяСистема, Подтверждения, СтандартнаяОбработка) Экспорт
		
КонецПроцедуры

// Предназначена для обработки данных объектов, получаемых от внешней учетной системы.
// @skip-warning ПустойМетод - особенность реализации
//
// Параметры:
//  УчетнаяСистема - ОпределяемыйТип.УчетныеСистемыИнтеграцииОбластейДанных - учетная система.
//  ИдентификаторОбъекта - Строка(50) - идентификатор объекта для обработка
//  ПотокДанных - ФайловыйПоток, ПотокВПамяти - данные объекта
//  Обработчик - Строка - идентификатор обработчика
//  КодВозврата - Число - код возврата обработчика (по умолчанию - 10200)
//  Ошибка - Булево - признак ошибки (по умолчанию - Ложь)
//  СообщениеОбОшибке - Строка - подробности ошибки (по умолчанию не заполнено).
//
Процедура ОбработатьДанные(УчетнаяСистема, ИдентификаторОбъекта, ПотокДанных, Обработчик, 
	КодВозврата, Ошибка, СообщениеОбОшибке) Экспорт
		
КонецПроцедуры

// Предназначена для обработки устанавливаемых настроек учетной системы, 
// полученных от внешней учетной системы.
// @skip-warning ПустойМетод - особенность реализации
//
// Параметры:
//  УчетнаяСистема - ОпределяемыйТип.УчетныеСистемыИнтеграцииОбластейДанных 
//  ПотокДанных - ФайловыйПоток, ПотокВПамяти - данные настроек (передаются в формате json) 
//  КодВозврата - Число - код возврата обработчика установки настроек (по умолчанию - 10200).
//  Ошибка - Булево - признак ошибки (по умолчанию - Ложь) 
//  СообщениеОбОшибке - Строка - подробности ошибки (по умолчанию не заполнено).
//  СтандартнаяОбработка - Булево - признак стандартной обработки. 
//
Процедура УстановитьНастройки(УчетнаяСистема, ПотокДанных, КодВозврата, Ошибка, СообщениеОбОшибке) Экспорт
		
КонецПроцедуры

// Возвращает идентификатор типа учетной системы для определения менеджера объекта, 
// если ссылки на учетную систему с пользователем обратившейся внешней системы еще не существует.
// @skip-warning ПустойМетод - особенность реализации
//
Функция ТипУчетнойСистемы() Экспорт
		
КонецФункции

// Устанавливает права пользователя, от имени которого обращается внешняя учетная система.
// @skip-warning ПустойМетод - особенность реализации
//
// Параметры:
//	УчетнаяСистема - ОпределяемыйТип.УчетныеСистемыИнтеграцииОбластейДанных
//	Пользователь - СправочникСсылка.Пользователи
//
Процедура УстановитьПраваДоступа(УчетнаяСистема, Пользователь) Экспорт
	
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли