
#Область СлужебныеПроцедурыИФункции

Функция ЗначенияЗаполненияБольничного(ДанныеШтрихкода) Экспорт
	
	Если Не ПравоДоступа("ИнтерактивноеДобавление", Метаданные.Документы.БольничныйЛист) Тогда
		ОписаниеОшибки = НСтр("ru = 'У текущего пользователя нет прав на ввод начислений по больничному листу!'");
		Возврат Неопределено;
	КонецЕсли;
	
	СписокПараметров = СтрРазделить(Сред(ДанныеШтрихкода, 7), "!");
	Если СписокПараметров.Количество() = 0 Тогда
		ОписаниеОшибки = НСтр("ru = 'В считанном штрихкоде отсутствуют сведения о листке нетрудоспособности!'");
		Возврат Неопределено;
	КонецЕсли;
	
	// Прочитаем и заполним структуру реквизитов в зависимости от версии
	// Имена полей в структуре должны совпадать с именами реквизитов документа
	СтруктураРеквизитов = Новый Структура;
	Если СписокПараметров[0] = "01" Тогда
		СтруктураРеквизитов.Вставить("НомерЛисткаНетрудоспособности",					СписокПараметров[1]);
		
		ВходящийНомерПервичногоЛистка	= СписокПараметров[2];
		
		СтруктураРеквизитов.Вставить("ЯвляетсяПродолжениемБолезни",						СписокПараметров[3] = "0");
		СтруктураРеквизитов.Вставить("ЯвляетсяДубликатом",								СписокПараметров[4] = "1");
		СтруктураРеквизитов.Вставить("ДатаВыдачиЛисткаНетрудоспособности",				ДатаИзСтроки(СписокПараметров[5]));
		СтруктураРеквизитов.Вставить("НаименованиеМедицинскойОрганизации",				СписокПараметров[6]);
		СтруктураРеквизитов.Вставить("АдресМедицинскойОрганизации",						СписокПараметров[7]);
		СтруктураРеквизитов.Вставить("ОГРНМедицинскойОрганизации",						СписокПараметров[8]);
		СтруктураРеквизитов.Вставить("Фамилия",											СписокПараметров[9]);
		СтруктураРеквизитов.Вставить("Имя",												СписокПараметров[10]);
		СтруктураРеквизитов.Вставить("Отчество",										СписокПараметров[11]);
		ДатаРожденияСотрудника	= ДатаИзСтроки(СписокПараметров[12]);
		ВидЗанятостиСотрудника	= ?(СписокПараметров[15] = "0", Перечисления.ВидыЗанятости.Совместительство, Перечисления.ВидыЗанятости.ОсновноеМестоРаботы);
		
		НаименованиеОрганизации	= СписокПараметров[14];
		
		СтруктураРеквизитов.Вставить("КодПричиныНетрудоспособности",					СписокПараметров[16]);
		СтруктураРеквизитов.Вставить("ДополнительныйКодПричиныНетрудоспособности",		СписокПараметров[17]);
		СтруктураРеквизитов.Вставить("ВторойКодПричиныНетрудоспособности",				СписокПараметров[18]);
		СтруктураРеквизитов.Вставить("НомерЛисткаПоОсновномуМестуРаботы",				СписокПараметров[19]);
		СтруктураРеквизитов.Вставить("ДатаИзмененияКодаПричиныНетрудоспособности",		ДатаИзСтроки(СписокПараметров[21]));
		СтруктураРеквизитов.Вставить("ДатаОкончанияПутевки",							ДатаИзСтроки(СписокПараметров[22]));
		СтруктураРеквизитов.Вставить("НомерПутевки",									СписокПараметров[23]);
		СтруктураРеквизитов.Вставить("ОГРН_Санатория",									СписокПараметров[24]);
		
		Если СписокПараметров[28] <> "" Тогда
			СтруктураРеквизитов.Вставить("ПоУходуВозрастЛет1",							СписокПараметров[25]);
			СтруктураРеквизитов.Вставить("ПоУходуВозрастМесяцев1",						СписокПараметров[26]);
			СтруктураРеквизитов.Вставить("ПоУходуРодственнаяСвязь1",					СписокПараметров[27]);
			СтруктураРеквизитов.Вставить("ПоУходуФИО1",									СписокПараметров[28]);
		КонецЕсли;
		
		Если СписокПараметров[32] <> "" Тогда
			СтруктураРеквизитов.Вставить("ПоУходуВозрастЛет2",							СписокПараметров[29]);
			СтруктураРеквизитов.Вставить("ПоУходуВозрастМесяцев2",						СписокПараметров[30]);
			СтруктураРеквизитов.Вставить("ПоУходуРодственнаяСвязь2",					СписокПараметров[31]);
			СтруктураРеквизитов.Вставить("ПоУходуФИО2",									СписокПараметров[32]);
		КонецЕсли;
		
		СтруктураРеквизитов.Вставить("ПоставленаНаУчетВРанниеСрокиБеременности",		СписокПараметров[33] = "1");
		СтруктураРеквизитов.Вставить("ПериодНахожденияВСтационареСРебенкомС",			ДатаИзСтроки(СписокПараметров[34]));
		СтруктураРеквизитов.Вставить("ПериодНахожденияВСтационареСРебенкомПо",			ДатаИзСтроки(СписокПараметров[35]));
		СтруктураРеквизитов.Вставить("КодНарушенияРежима",								СписокПараметров[36]);
		СтруктураРеквизитов.Вставить("ДатаНарушенияРежима",								ДатаИзСтроки(СписокПараметров[37]));
		СтруктураРеквизитов.Вставить("ДатаНаправленияВБюроМСЭ",							ДатаИзСтроки(СписокПараметров[38]));
		СтруктураРеквизитов.Вставить("ДатаРегистрацииДокументовМСЭ",					ДатаИзСтроки(СписокПараметров[39]));
		СтруктураРеквизитов.Вставить("ДатаОсвидетельствованияМСЭ",						ДатаИзСтроки(СписокПараметров[40]));
		
		СтруктураРеквизитов.Вставить("ГруппаИнвалидности",								СписокПараметров[41]);
		СтруктураРеквизитов.Вставить("УстановленаИзмененаГруппаИнвалидности",			СписокПараметров[41] <> "");
		
		СтруктураРеквизитов.Вставить("ДатаНачала",										ДатаИзСтроки(СписокПараметров[42]));
		СтруктураРеквизитов.Вставить("ДатаНачалаОплаты",								ДатаИзСтроки(СписокПараметров[42]));
		СтруктураРеквизитов.Вставить("ДатаНачалаСобытия",								?(Не СтруктураРеквизитов.ЯвляетсяПродолжениемБолезни, ДатаИзСтроки(СписокПараметров[42]), Дата(1, 1, 1)));
		СтруктураРеквизитов.Вставить("ДатаОкончания",									ДатаИзСтроки(СписокПараметров[43]));
		СтруктураРеквизитов.Вставить("ДатаОкончанияОплаты",								ДатаИзСтроки(СписокПараметров[43]));
		
		Если СписокПараметров[42] <> "" Тогда
			СтруктураРеквизитов.Вставить("ОсвобождениеДатаНачала1",						ДатаИзСтроки(СписокПараметров[42]));
			СтруктураРеквизитов.Вставить("ОсвобождениеДатаОкончания1",					ДатаИзСтроки(СписокПараметров[43]));
			СтруктураРеквизитов.Вставить("ОсвобождениеДолжностьВрача1",					СписокПараметров[44]);
			СтруктураРеквизитов.Вставить("ОсвобождениеФИОВрача1",						СписокПараметров[45]);
		КонецЕсли;
		
		Если СписокПараметров[46] <> "" Тогда
			СтруктураРеквизитов.Вставить("ОсвобождениеДатаНачала2",						ДатаИзСтроки(СписокПараметров[46]));
			СтруктураРеквизитов.Вставить("ОсвобождениеДатаОкончания2",					ДатаИзСтроки(СписокПараметров[47]));
			СтруктураРеквизитов.Вставить("ОсвобождениеДолжностьВрача2",					СписокПараметров[48]);
			СтруктураРеквизитов.Вставить("ОсвобождениеФИОВрача2",						СписокПараметров[49]);
		КонецЕсли;
		
		Если СписокПараметров[50] <> "" Тогда
			СтруктураРеквизитов.Вставить("ОсвобождениеДатаНачала3",						ДатаИзСтроки(СписокПараметров[50]));
			СтруктураРеквизитов.Вставить("ОсвобождениеДатаОкончания3",					ДатаИзСтроки(СписокПараметров[51]));
			СтруктураРеквизитов.Вставить("ОсвобождениеДолжностьВрача3",					СписокПараметров[52]);
			СтруктураРеквизитов.Вставить("ОсвобождениеФИОВрача3",						СписокПараметров[53]);
		КонецЕсли;
		
		СтруктураРеквизитов.Вставить("НовыйСтатусНетрудопособного",						СписокПараметров[54]);
		СтруктураРеквизитов.Вставить("ДатаНовыйСтатусНетрудопособного",					ДатаИзСтроки(СписокПараметров[55]));
		СтруктураРеквизитов.Вставить("ПриступитьКРаботеС",								ДатаИзСтроки(СписокПараметров[56]));
		СтруктураРеквизитов.Вставить("НомерЛисткаПродолжения",							СокрЛП(СписокПараметров[57]));
		
		Если СтруктураРеквизитов.КодПричиныНетрудоспособности = "01" Или СтруктураРеквизитов.КодПричиныНетрудоспособности = "02" Тогда
			СтруктураРеквизитов.Вставить("ПричинаНетрудоспособности",					Перечисления.ПричиныНетрудоспособности.ОбщееЗаболевание);
			СтруктураРеквизитов.Вставить("СлучайУходаЗаБольнымРебенком",				Перечисления.СлучаиУходаЗаБольнымиДетьми.ПустаяСсылка());
			
		ИначеЕсли СтруктураРеквизитов.КодПричиныНетрудоспособности = "03" Тогда
			СтруктураРеквизитов.Вставить("ПричинаНетрудоспособности",					Перечисления.ПричиныНетрудоспособности.Карантин);
			СтруктураРеквизитов.Вставить("СлучайУходаЗаБольнымРебенком",				Перечисления.СлучаиУходаЗаБольнымиДетьми.ПустаяСсылка());
			
		ИначеЕсли СтруктураРеквизитов.КодПричиныНетрудоспособности = "04" Или СтруктураРеквизитов.КодПричиныНетрудоспособности = "07" Тогда
			СтруктураРеквизитов.Вставить("ПричинаНетрудоспособности",					Перечисления.ПричиныНетрудоспособности.ТравмаНаПроизводстве);
			СтруктураРеквизитов.Вставить("СлучайУходаЗаБольнымРебенком",				Перечисления.СлучаиУходаЗаБольнымиДетьми.ПустаяСсылка());
			
		ИначеЕсли СтруктураРеквизитов.КодПричиныНетрудоспособности = "05" Тогда
			СтруктураРеквизитов.Вставить("ПричинаНетрудоспособности",					Перечисления.ПричиныНетрудоспособности.ПоБеременностиИРодам);
			СтруктураРеквизитов.Вставить("СлучайУходаЗаБольнымРебенком",				Перечисления.СлучаиУходаЗаБольнымиДетьми.ПустаяСсылка());
			
		ИначеЕсли СтруктураРеквизитов.КодПричиныНетрудоспособности = "06" Тогда
			СтруктураРеквизитов.Вставить("ПричинаНетрудоспособности",					Перечисления.ПричиныНетрудоспособности.Протезирование);
			СтруктураРеквизитов.Вставить("СлучайУходаЗаБольнымРебенком",				Перечисления.СлучаиУходаЗаБольнымиДетьми.ПустаяСсылка());
			
		ИначеЕсли СтруктураРеквизитов.КодПричиныНетрудоспособности = "08" Тогда
			СтруктураРеквизитов.Вставить("ПричинаНетрудоспособности",					Перечисления.ПричиныНетрудоспособности.ПособиеПриДолечивании);
			СтруктураРеквизитов.Вставить("СлучайУходаЗаБольнымРебенком",				Перечисления.СлучаиУходаЗаБольнымиДетьми.ПустаяСсылка());
			
		ИначеЕсли СтруктураРеквизитов.КодПричиныНетрудоспособности = "09" Тогда
			СтруктураРеквизитов.Вставить("ПричинаНетрудоспособности",					Перечисления.ПричиныНетрудоспособности.ПоУходуЗаРебенком);
			СтруктураРеквизитов.Вставить("СлучайУходаЗаБольнымРебенком",				Перечисления.СлучаиУходаЗаБольнымиДетьми.ПустаяСсылка());
			
		ИначеЕсли СтруктураРеквизитов.КодПричиныНетрудоспособности = "10" Или СтруктураРеквизитов.КодПричиныНетрудоспособности = "11" Тогда
			СтруктураРеквизитов.Вставить("ПричинаНетрудоспособности",					Перечисления.ПричиныНетрудоспособности.ОбщееЗаболевание);
			СтруктураРеквизитов.Вставить("СлучайУходаЗаБольнымРебенком",				Перечисления.СлучаиУходаЗаБольнымиДетьми.ПустаяСсылка());
			
		ИначеЕсли СтруктураРеквизитов.КодПричиныНетрудоспособности = "12" Тогда
			СтруктураРеквизитов.Вставить("ПричинаНетрудоспособности",					Перечисления.ПричиныНетрудоспособности.ПоУходуЗаРебенком);
			СтруктураРеквизитов.Вставить("СлучайУходаЗаБольнымРебенком",				?(СтруктураРеквизитов.ПериодНахожденияВСтационареСРебенкомС = Дата(1, 1, 1), Перечисления.СлучаиУходаЗаБольнымиДетьми.ПоУходуДо7миЛетПриОсобомЗаболеванииАмбулаторно, Перечисления.СлучаиУходаЗаБольнымиДетьми.ПоУходуДо7миЛетПриОсобомЗаболеванииВСтационаре));
			
		ИначеЕсли СтруктураРеквизитов.КодПричиныНетрудоспособности = "13" Тогда
			СтруктураРеквизитов.Вставить("ПричинаНетрудоспособности",					Перечисления.ПричиныНетрудоспособности.ПоУходуЗаРебенком);
			СтруктураРеквизитов.Вставить("СлучайУходаЗаБольнымРебенком",				?(СтруктураРеквизитов.ПериодНахожденияВСтационареСРебенкомС = Дата(1, 1, 1), Перечисления.СлучаиУходаЗаБольнымиДетьми.ПоУходуЗаРебенкомИнвалидомАмбулаторно, Перечисления.СлучаиУходаЗаБольнымиДетьми.ПоУходуЗаРебенкомИнвалидомВСтационаре));
			
		ИначеЕсли СтруктураРеквизитов.КодПричиныНетрудоспособности = "14" Тогда
			СтруктураРеквизитов.Вставить("ПричинаНетрудоспособности",					Перечисления.ПричиныНетрудоспособности.ПоУходуЗаРебенком);
			СтруктураРеквизитов.Вставить("СлучайУходаЗаБольнымРебенком",				?(СтруктураРеквизитов.ПериодНахожденияВСтационареСРебенкомС = Дата(1, 1, 1), Перечисления.СлучаиУходаЗаБольнымиДетьми.ПоУходуДо15тиЛетПриПоствакцинальномОсложненииАмбулаторно, Перечисления.СлучаиУходаЗаБольнымиДетьми.ПоУходуДо15тиЛетПриПоствакцинальномОсложненииВСтационаре));
			
		ИначеЕсли СтруктураРеквизитов.КодПричиныНетрудоспособности = "15" Тогда
			СтруктураРеквизитов.Вставить("ПричинаНетрудоспособности",					Перечисления.ПричиныНетрудоспособности.ПоУходуЗаРебенком);
			СтруктураРеквизитов.Вставить("СлучайУходаЗаБольнымРебенком",				Перечисления.СлучаиУходаЗаБольнымиДетьми.ПоУходуДо15тиЛетПриВИЧ);
			
		Иначе
			СтруктураРеквизитов.Вставить("ПричинаНетрудоспособности",					Перечисления.ПричиныНетрудоспособности.ОбщееЗаболевание);
			СтруктураРеквизитов.Вставить("СлучайУходаЗаБольнымРебенком",				Перечисления.СлучаиУходаЗаБольнымиДетьми.ПустаяСсылка());
			ОписаниеОшибки = "Неизвестный код '" + СтруктураРеквизитов.КодПричиныНетрудоспособности + "' причины нетрудоспособности. В качестве причины нетрудоспособности установлено '" + Строка(Перечисления.ПричиныНетрудоспособности.ОбщееЗаболевание) + "'." + Символы.ПС;
			
		КонецЕсли;
		
	ИначеЕсли СписокПараметров[0] = "" Тогда // Неопубликованная версия
		СтруктураРеквизитов.Вставить("НомерЛисткаНетрудоспособности",					СписокПараметров[1]);
		
		ВходящийНомерПервичногоЛистка	= СписокПараметров[2];
		
		СтруктураРеквизитов.Вставить("ЯвляетсяПродолжениемБолезни",						СписокПараметров[3] = "0");
		СтруктураРеквизитов.Вставить("ЯвляетсяДубликатом",								СписокПараметров[4] = "1");
		СтруктураРеквизитов.Вставить("ДатаВыдачиЛисткаНетрудоспособности",				ДатаИзСтроки(СписокПараметров[5]));
		СтруктураРеквизитов.Вставить("НаименованиеМедицинскойОрганизации",				СписокПараметров[6]);
		СтруктураРеквизитов.Вставить("АдресМедицинскойОрганизации",						СписокПараметров[7]);
		СтруктураРеквизитов.Вставить("ОГРНМедицинскойОрганизации",						СписокПараметров[8]);
		СтруктураРеквизитов.Вставить("Фамилия",											СписокПараметров[9]);
		СтруктураРеквизитов.Вставить("Имя",												СписокПараметров[10]);
		СтруктураРеквизитов.Вставить("Отчество",										СписокПараметров[11]);
		ДатаРожденияСотрудника	= ДатаИзСтроки(СписокПараметров[12]);
		ВидЗанятостиСотрудника	= ?(СписокПараметров[15] = "0", Перечисления.ВидыЗанятости.Совместительство, Перечисления.ВидыЗанятости.ОсновноеМестоРаботы);
		
		НаименованиеОрганизации	= СписокПараметров[14];
		
		СтруктураРеквизитов.Вставить("КодПричиныНетрудоспособности",					СписокПараметров[16]);
		СтруктураРеквизитов.Вставить("ДополнительныйКодПричиныНетрудоспособности",		СписокПараметров[17]);
		СтруктураРеквизитов.Вставить("ВторойКодПричиныНетрудоспособности",				СписокПараметров[18]);
		СтруктураРеквизитов.Вставить("НомерЛисткаПоОсновномуМестуРаботы",				СписокПараметров[19]);
		СтруктураРеквизитов.Вставить("ДатаИзмененияКодаПричиныНетрудоспособности",		ДатаИзСтроки(СписокПараметров[21]));
		СтруктураРеквизитов.Вставить("ДатаОкончанияПутевки",							ДатаИзСтроки(СписокПараметров[22]));
		СтруктураРеквизитов.Вставить("НомерПутевки",									СписокПараметров[23]);
		СтруктураРеквизитов.Вставить("ОГРН_Санатория",									СписокПараметров[24]);
		
		Если СписокПараметров[28] <> "" Тогда
			СтруктураРеквизитов.Вставить("ПоУходуВозрастЛет1",							СписокПараметров[25]);
			СтруктураРеквизитов.Вставить("ПоУходуВозрастМесяцев1",						СписокПараметров[26]);
			СтруктураРеквизитов.Вставить("ПоУходуРодственнаяСвязь1",					СписокПараметров[27]);
			СтруктураРеквизитов.Вставить("ПоУходуФИО1",									СписокПараметров[28]);
		КонецЕсли;
		
		Если СписокПараметров[32] <> "" Тогда
			СтруктураРеквизитов.Вставить("ПоУходуВозрастЛет2",							СписокПараметров[29]);
			СтруктураРеквизитов.Вставить("ПоУходуВозрастМесяцев2",						СписокПараметров[30]);
			СтруктураРеквизитов.Вставить("ПоУходуРодственнаяСвязь2",					СписокПараметров[31]);
			СтруктураРеквизитов.Вставить("ПоУходуФИО2",									СписокПараметров[32]);
		КонецЕсли;
		
		СтруктураРеквизитов.Вставить("ПоставленаНаУчетВРанниеСрокиБеременности",		СписокПараметров[33] = "1");
		СтруктураРеквизитов.Вставить("ПериодНахожденияВСтационареСРебенкомС",			ДатаИзСтроки(СписокПараметров[34]));
		СтруктураРеквизитов.Вставить("ПериодНахожденияВСтационареСРебенкомПо",			ДатаИзСтроки(СписокПараметров[35]));
		СтруктураРеквизитов.Вставить("КодНарушенияРежима",								СписокПараметров[36]);
		СтруктураРеквизитов.Вставить("ДатаНарушенияРежима",								ДатаИзСтроки(СписокПараметров[37]));
		СтруктураРеквизитов.Вставить("ДатаНаправленияВБюроМСЭ",							ДатаИзСтроки(СписокПараметров[38]));
		СтруктураРеквизитов.Вставить("ДатаРегистрацииДокументовМСЭ",					ДатаИзСтроки(СписокПараметров[39]));
		СтруктураРеквизитов.Вставить("ДатаОсвидетельствованияМСЭ",						ДатаИзСтроки(СписокПараметров[40]));
		
		СтруктураРеквизитов.Вставить("ГруппаИнвалидности",								СписокПараметров[41]);
		СтруктураРеквизитов.Вставить("УстановленаИзмененаГруппаИнвалидности",			СписокПараметров[41] <> "");
		
		СтруктураРеквизитов.Вставить("ДатаНачала",										ДатаИзСтроки(СписокПараметров[42]));
		СтруктураРеквизитов.Вставить("ДатаНачалаОплаты",								ДатаИзСтроки(СписокПараметров[42]));
		СтруктураРеквизитов.Вставить("ДатаНачалаСобытия",								?(Не СтруктураРеквизитов.ЯвляетсяПродолжениемБолезни, ДатаИзСтроки(СписокПараметров[42]), Дата(1, 1, 1)));
		СтруктураРеквизитов.Вставить("ДатаОкончания",									ДатаИзСтроки(СписокПараметров[43]));
		СтруктураРеквизитов.Вставить("ДатаОкончанияОплаты",								ДатаИзСтроки(СписокПараметров[43]));
		
		Если СписокПараметров[42] <> "" Тогда
			СтруктураРеквизитов.Вставить("ОсвобождениеДатаНачала1",						ДатаИзСтроки(СписокПараметров[42]));
			СтруктураРеквизитов.Вставить("ОсвобождениеДатаОкончания1",					ДатаИзСтроки(СписокПараметров[43]));
			СтруктураРеквизитов.Вставить("ОсвобождениеДолжностьВрача1",					СписокПараметров[44]);
			СтруктураРеквизитов.Вставить("ОсвобождениеФИОВрача1",						СписокПараметров[45]);
			СтруктураРеквизитов.Вставить("ОсвобождениеИдентификационныйНомерВрача1",	СписокПараметров[46]);
			СтруктураРеквизитов.Вставить("ОсвобождениеФИОВрачаПредседателяВК1",			СписокПараметров[48]);
		КонецЕсли;
		
		Если СписокПараметров[50] <> "" Тогда
			СтруктураРеквизитов.Вставить("ОсвобождениеДатаНачала2",						ДатаИзСтроки(СписокПараметров[50]));
			СтруктураРеквизитов.Вставить("ОсвобождениеДатаОкончания2",					ДатаИзСтроки(СписокПараметров[51]));
			СтруктураРеквизитов.Вставить("ОсвобождениеДолжностьВрача2",					СписокПараметров[52]);
			СтруктураРеквизитов.Вставить("ОсвобождениеФИОВрача2",						СписокПараметров[53]);
			СтруктураРеквизитов.Вставить("ОсвобождениеИдентификационныйНомерВрача2",	СписокПараметров[54]);
			СтруктураРеквизитов.Вставить("ОсвобождениеФИОВрачаПредседателяВК2",			СписокПараметров[56]);
		КонецЕсли;
		
		Если СписокПараметров[58] <> "" Тогда
			СтруктураРеквизитов.Вставить("ОсвобождениеДатаНачала3",						ДатаИзСтроки(СписокПараметров[58]));
			СтруктураРеквизитов.Вставить("ОсвобождениеДатаОкончания3",					ДатаИзСтроки(СписокПараметров[59]));
			СтруктураРеквизитов.Вставить("ОсвобождениеДолжностьВрача3",					СписокПараметров[60]);
			СтруктураРеквизитов.Вставить("ОсвобождениеФИОВрача3",						СписокПараметров[61]);
			СтруктураРеквизитов.Вставить("ОсвобождениеИдентификационныйНомерВрача3",	СписокПараметров[62]);
			СтруктураРеквизитов.Вставить("ОсвобождениеФИОВрачаПредседателяВК3",			СписокПараметров[64]);
		КонецЕсли;
		
		СтруктураРеквизитов.Вставить("НовыйСтатусНетрудопособного",						СписокПараметров[66]);
		СтруктураРеквизитов.Вставить("ДатаНовыйСтатусНетрудопособного",					ДатаИзСтроки(СписокПараметров[67]));
		СтруктураРеквизитов.Вставить("ПриступитьКРаботеС",								ДатаИзСтроки(СписокПараметров[68]));
		СтруктураРеквизитов.Вставить("НомерЛисткаПродолжения",							СокрЛП(СписокПараметров[69]));
		
		Если СтруктураРеквизитов.КодПричиныНетрудоспособности = "01" Или СтруктураРеквизитов.КодПричиныНетрудоспособности = "02" Тогда
			СтруктураРеквизитов.Вставить("ПричинаНетрудоспособности",					Перечисления.ПричиныНетрудоспособности.ОбщееЗаболевание);
			СтруктураРеквизитов.Вставить("СлучайУходаЗаБольнымРебенком",				Перечисления.СлучаиУходаЗаБольнымиДетьми.ПустаяСсылка());
			
		ИначеЕсли СтруктураРеквизитов.КодПричиныНетрудоспособности = "03" Тогда
			СтруктураРеквизитов.Вставить("ПричинаНетрудоспособности",					Перечисления.ПричиныНетрудоспособности.Карантин);
			СтруктураРеквизитов.Вставить("СлучайУходаЗаБольнымРебенком",				Перечисления.СлучаиУходаЗаБольнымиДетьми.ПустаяСсылка());
			
		ИначеЕсли СтруктураРеквизитов.КодПричиныНетрудоспособности = "04" Или СтруктураРеквизитов.КодПричиныНетрудоспособности = "07" Тогда
			СтруктураРеквизитов.Вставить("ПричинаНетрудоспособности",					Перечисления.ПричиныНетрудоспособности.ТравмаНаПроизводстве);
			СтруктураРеквизитов.Вставить("СлучайУходаЗаБольнымРебенком",				Перечисления.СлучаиУходаЗаБольнымиДетьми.ПустаяСсылка());
			
		ИначеЕсли СтруктураРеквизитов.КодПричиныНетрудоспособности = "05" Тогда
			СтруктураРеквизитов.Вставить("ПричинаНетрудоспособности",					Перечисления.ПричиныНетрудоспособности.ПоБеременностиИРодам);
			СтруктураРеквизитов.Вставить("СлучайУходаЗаБольнымРебенком",				Перечисления.СлучаиУходаЗаБольнымиДетьми.ПустаяСсылка());
			
		ИначеЕсли СтруктураРеквизитов.КодПричиныНетрудоспособности = "06" Тогда
			СтруктураРеквизитов.Вставить("ПричинаНетрудоспособности",					Перечисления.ПричиныНетрудоспособности.Протезирование);
			СтруктураРеквизитов.Вставить("СлучайУходаЗаБольнымРебенком",				Перечисления.СлучаиУходаЗаБольнымиДетьми.ПустаяСсылка());
			
		ИначеЕсли СтруктураРеквизитов.КодПричиныНетрудоспособности = "08" Тогда
			СтруктураРеквизитов.Вставить("ПричинаНетрудоспособности",					Перечисления.ПричиныНетрудоспособности.ПособиеПриДолечивании);
			СтруктураРеквизитов.Вставить("СлучайУходаЗаБольнымРебенком",				Перечисления.СлучаиУходаЗаБольнымиДетьми.ПустаяСсылка());
			
		ИначеЕсли СтруктураРеквизитов.КодПричиныНетрудоспособности = "09" Тогда
			СтруктураРеквизитов.Вставить("ПричинаНетрудоспособности",					Перечисления.ПричиныНетрудоспособности.ПоУходуЗаРебенком);
			СтруктураРеквизитов.Вставить("СлучайУходаЗаБольнымРебенком",				Перечисления.СлучаиУходаЗаБольнымиДетьми.ПустаяСсылка());
			
		ИначеЕсли СтруктураРеквизитов.КодПричиныНетрудоспособности = "10" Или СтруктураРеквизитов.КодПричиныНетрудоспособности = "11" Тогда
			СтруктураРеквизитов.Вставить("ПричинаНетрудоспособности",					Перечисления.ПричиныНетрудоспособности.ОбщееЗаболевание);
			СтруктураРеквизитов.Вставить("СлучайУходаЗаБольнымРебенком",				Перечисления.СлучаиУходаЗаБольнымиДетьми.ПустаяСсылка());
			
		ИначеЕсли СтруктураРеквизитов.КодПричиныНетрудоспособности = "12" Тогда
			СтруктураРеквизитов.Вставить("ПричинаНетрудоспособности",					Перечисления.ПричиныНетрудоспособности.ПоУходуЗаРебенком);
			СтруктураРеквизитов.Вставить("СлучайУходаЗаБольнымРебенком",				?(СтруктураРеквизитов.ПериодНахожденияВСтационареСРебенкомС = Дата(1, 1, 1), Перечисления.СлучаиУходаЗаБольнымиДетьми.ПоУходуДо7миЛетПриОсобомЗаболеванииАмбулаторно, Перечисления.СлучаиУходаЗаБольнымиДетьми.ПоУходуДо7миЛетПриОсобомЗаболеванииВСтационаре));
			
		ИначеЕсли СтруктураРеквизитов.КодПричиныНетрудоспособности = "13" Тогда
			СтруктураРеквизитов.Вставить("ПричинаНетрудоспособности",					Перечисления.ПричиныНетрудоспособности.ПоУходуЗаРебенком);
			СтруктураРеквизитов.Вставить("СлучайУходаЗаБольнымРебенком",				?(СтруктураРеквизитов.ПериодНахожденияВСтационареСРебенкомС = Дата(1, 1, 1), Перечисления.СлучаиУходаЗаБольнымиДетьми.ПоУходуЗаРебенкомИнвалидомАмбулаторно, Перечисления.СлучаиУходаЗаБольнымиДетьми.ПоУходуЗаРебенкомИнвалидомВСтационаре));
			
		ИначеЕсли СтруктураРеквизитов.КодПричиныНетрудоспособности = "14" Тогда
			СтруктураРеквизитов.Вставить("ПричинаНетрудоспособности",					Перечисления.ПричиныНетрудоспособности.ПоУходуЗаРебенком);
			СтруктураРеквизитов.Вставить("СлучайУходаЗаБольнымРебенком",				?(СтруктураРеквизитов.ПериодНахожденияВСтационареСРебенкомС = Дата(1, 1, 1), Перечисления.СлучаиУходаЗаБольнымиДетьми.ПоУходуДо15тиЛетПриПоствакцинальномОсложненииАмбулаторно, Перечисления.СлучаиУходаЗаБольнымиДетьми.ПоУходуДо15тиЛетПриПоствакцинальномОсложненииВСтационаре));
			
		ИначеЕсли СтруктураРеквизитов.КодПричиныНетрудоспособности = "15" Тогда
			СтруктураРеквизитов.Вставить("ПричинаНетрудоспособности",					Перечисления.ПричиныНетрудоспособности.ПоУходуЗаРебенком);
			СтруктураРеквизитов.Вставить("СлучайУходаЗаБольнымРебенком",				Перечисления.СлучаиУходаЗаБольнымиДетьми.ПоУходуДо15тиЛетПриВИЧ);
			
		Иначе
			СтруктураРеквизитов.Вставить("ПричинаНетрудоспособности",					Перечисления.ПричиныНетрудоспособности.ОбщееЗаболевание);
			СтруктураРеквизитов.Вставить("СлучайУходаЗаБольнымРебенком",				Перечисления.СлучаиУходаЗаБольнымиДетьми.ПустаяСсылка());
			ОписаниеОшибки = "Неизвестный код '" + СтруктураРеквизитов.КодПричиныНетрудоспособности + "' причины нетрудоспособности. В качестве причины нетрудоспособности установлено '" + Строка(Перечисления.ПричиныНетрудоспособности.ОбщееЗаболевание) + "'." + Символы.ПС;
			
		КонецЕсли;
		
	ИначеЕсли СписокПараметров[0] = "04" Тогда // Неопубликованная версия
		СтруктураРеквизитов.Вставить("НомерЛисткаНетрудоспособности",					СписокПараметров[3]);
		
		ВходящийНомерПервичногоЛистка	= СписокПараметров[4];
		
		СтруктураРеквизитов.Вставить("ЯвляетсяПродолжениемБолезни",						СписокПараметров[5] = "0");
		СтруктураРеквизитов.Вставить("ЯвляетсяДубликатом",								СписокПараметров[6] = "1");
		СтруктураРеквизитов.Вставить("ДатаВыдачиЛисткаНетрудоспособности",				ДатаИзСтроки(СписокПараметров[7]));
		СтруктураРеквизитов.Вставить("НаименованиеМедицинскойОрганизации",				СписокПараметров[8]);
		СтруктураРеквизитов.Вставить("АдресМедицинскойОрганизации",						СписокПараметров[9]);
		СтруктураРеквизитов.Вставить("ОГРНМедицинскойОрганизации",						СписокПараметров[10]);
		СтруктураРеквизитов.Вставить("Фамилия",											СписокПараметров[11]);
		СтруктураРеквизитов.Вставить("Имя",												СписокПараметров[12]);
		СтруктураРеквизитов.Вставить("Отчество",										СписокПараметров[13]);
		ДатаРожденияСотрудника	= ДатаИзСтроки(СписокПараметров[14]);
		ВидЗанятостиСотрудника	= ?(СписокПараметров[15] = "0", Перечисления.ВидыЗанятости.Совместительство, Перечисления.ВидыЗанятости.ОсновноеМестоРаботы);
		
		НаименованиеОрганизации	= СписокПараметров[1];
		
		СтруктураРеквизитов.Вставить("КодПричиныНетрудоспособности",					СписокПараметров[16]);
		СтруктураРеквизитов.Вставить("ДополнительныйКодПричиныНетрудоспособности",		СписокПараметров[17]);
		СтруктураРеквизитов.Вставить("ВторойКодПричиныНетрудоспособности",				СписокПараметров[18]);
		СтруктураРеквизитов.Вставить("НомерЛисткаПоОсновномуМестуРаботы",				СписокПараметров[19]);
		СтруктураРеквизитов.Вставить("ДатаИзмененияКодаПричиныНетрудоспособности",		ДатаИзСтроки(СписокПараметров[20]));
		СтруктураРеквизитов.Вставить("ДатаОкончанияПутевки",							ДатаИзСтроки(СписокПараметров[21]));
		СтруктураРеквизитов.Вставить("НомерПутевки",									СписокПараметров[22]);
		СтруктураРеквизитов.Вставить("ОГРН_Санатория",									СписокПараметров[23]);
		
		Если СписокПараметров[27] <> "" Тогда
			СтруктураРеквизитов.Вставить("ПоУходуВозрастЛет1",							СписокПараметров[24]);
			СтруктураРеквизитов.Вставить("ПоУходуВозрастМесяцев1",						СписокПараметров[25]);
			СтруктураРеквизитов.Вставить("ПоУходуРодственнаяСвязь1",					СписокПараметров[26]);
			СтруктураРеквизитов.Вставить("ПоУходуФИО1",									СписокПараметров[27]);
		КонецЕсли;
		
		Если СписокПараметров[31] <> "" Тогда
			СтруктураРеквизитов.Вставить("ПоУходуВозрастЛет2",							СписокПараметров[28]);
			СтруктураРеквизитов.Вставить("ПоУходуВозрастМесяцев2",						СписокПараметров[29]);
			СтруктураРеквизитов.Вставить("ПоУходуРодственнаяСвязь2",					СписокПараметров[30]);
			СтруктураРеквизитов.Вставить("ПоУходуФИО2",									СписокПараметров[31]);
		КонецЕсли;
		
		СтруктураРеквизитов.Вставить("ПоставленаНаУчетВРанниеСрокиБеременности",		СписокПараметров[33] = "1");
		СтруктураРеквизитов.Вставить("ПериодНахожденияВСтационареСРебенкомС",			ДатаИзСтроки(СписокПараметров[34]));
		СтруктураРеквизитов.Вставить("ПериодНахожденияВСтационареСРебенкомПо",			ДатаИзСтроки(СписокПараметров[35]));
		СтруктураРеквизитов.Вставить("КодНарушенияРежима",								СписокПараметров[36]);
		СтруктураРеквизитов.Вставить("ДатаНарушенияРежима",								ДатаИзСтроки(СписокПараметров[37]));
		СтруктураРеквизитов.Вставить("ДатаНаправленияВБюроМСЭ",							ДатаИзСтроки(СписокПараметров[38]));
		СтруктураРеквизитов.Вставить("ДатаРегистрацииДокументовМСЭ",					ДатаИзСтроки(СписокПараметров[39]));
		СтруктураРеквизитов.Вставить("ДатаОсвидетельствованияМСЭ",						ДатаИзСтроки(СписокПараметров[40]));
		
		СтруктураРеквизитов.Вставить("ГруппаИнвалидности",								СписокПараметров[41]);
		СтруктураРеквизитов.Вставить("УстановленаИзмененаГруппаИнвалидности",			СписокПараметров[41] <> "");
		СтруктураРеквизитов.Вставить("НовыйСтатусНетрудопособного",						СписокПараметров[42]);
		
		СтруктураРеквизитов.Вставить("ДатаНачала",										ДатаИзСтроки(СписокПараметров[43]));
		СтруктураРеквизитов.Вставить("ДатаНачалаОплаты",								ДатаИзСтроки(СписокПараметров[43]));
		СтруктураРеквизитов.Вставить("ДатаНачалаСобытия",								?(Не СтруктураРеквизитов.ЯвляетсяПродолжениемБолезни, ДатаИзСтроки(СписокПараметров[43]), Дата(1, 1, 1)));
		СтруктураРеквизитов.Вставить("ДатаОкончания",									ДатаИзСтроки(СписокПараметров[44]));
		СтруктураРеквизитов.Вставить("ДатаОкончанияОплаты",								ДатаИзСтроки(СписокПараметров[44]));
		
		Если СписокПараметров[43] <> "" Тогда
			СтруктураРеквизитов.Вставить("ОсвобождениеДатаНачала1",						ДатаИзСтроки(СписокПараметров[43]));
			СтруктураРеквизитов.Вставить("ОсвобождениеДатаОкончания1",					ДатаИзСтроки(СписокПараметров[44]));
			СтруктураРеквизитов.Вставить("ОсвобождениеДолжностьВрача1",					СписокПараметров[45]);
			СтруктураРеквизитов.Вставить("ОсвобождениеФИОВрача1",						СписокПараметров[46]);
			СтруктураРеквизитов.Вставить("ОсвобождениеИдентификационныйНомерВрача1",	СписокПараметров[47]);
			СтруктураРеквизитов.Вставить("ОсвобождениеФИОВрачаПредседателяВК1",			СписокПараметров[49]);
		КонецЕсли;
		
		Если СписокПараметров[51] <> "" Тогда
			СтруктураРеквизитов.Вставить("ОсвобождениеДатаНачала2",						ДатаИзСтроки(СписокПараметров[51]));
			СтруктураРеквизитов.Вставить("ОсвобождениеДатаОкончания2",					ДатаИзСтроки(СписокПараметров[52]));
			СтруктураРеквизитов.Вставить("ОсвобождениеДолжностьВрача2",					СписокПараметров[53]);
			СтруктураРеквизитов.Вставить("ОсвобождениеФИОВрача2",						СписокПараметров[54]);
			СтруктураРеквизитов.Вставить("ОсвобождениеИдентификационныйНомерВрача2",	СписокПараметров[55]);
			СтруктураРеквизитов.Вставить("ОсвобождениеФИОВрачаПредседателяВК2",			СписокПараметров[57]);
		КонецЕсли;
		
		Если СписокПараметров[59] <> "" Тогда
			СтруктураРеквизитов.Вставить("ОсвобождениеДатаНачала3",						ДатаИзСтроки(СписокПараметров[59]));
			СтруктураРеквизитов.Вставить("ОсвобождениеДатаОкончания3",					ДатаИзСтроки(СписокПараметров[60]));
			СтруктураРеквизитов.Вставить("ОсвобождениеДолжностьВрача3",					СписокПараметров[61]);
			СтруктураРеквизитов.Вставить("ОсвобождениеФИОВрача3",						СписокПараметров[62]);
			СтруктураРеквизитов.Вставить("ОсвобождениеИдентификационныйНомерВрача3",	СписокПараметров[63]);
			СтруктураРеквизитов.Вставить("ОсвобождениеФИОВрачаПредседателяВК3",			СписокПараметров[65]);
		КонецЕсли;
		
		СтруктураРеквизитов.Вставить("ДатаНовыйСтатусНетрудопособного",					ДатаИзСтроки(СписокПараметров[67]));
		СтруктураРеквизитов.Вставить("ПриступитьКРаботеС",								ДатаИзСтроки(СписокПараметров[68]));
		СтруктураРеквизитов.Вставить("НомерЛисткаПродолжения",							СокрЛП(СписокПараметров[69]));
		
		Если СтруктураРеквизитов.КодПричиныНетрудоспособности = "01" Или СтруктураРеквизитов.КодПричиныНетрудоспособности = "02" Тогда
			СтруктураРеквизитов.Вставить("ПричинаНетрудоспособности",					Перечисления.ПричиныНетрудоспособности.ОбщееЗаболевание);
			СтруктураРеквизитов.Вставить("СлучайУходаЗаБольнымРебенком",				Перечисления.СлучаиУходаЗаБольнымиДетьми.ПустаяСсылка());
			
		ИначеЕсли СтруктураРеквизитов.КодПричиныНетрудоспособности = "03" Тогда
			СтруктураРеквизитов.Вставить("ПричинаНетрудоспособности",					Перечисления.ПричиныНетрудоспособности.Карантин);
			СтруктураРеквизитов.Вставить("СлучайУходаЗаБольнымРебенком",				Перечисления.СлучаиУходаЗаБольнымиДетьми.ПустаяСсылка());
			
		ИначеЕсли СтруктураРеквизитов.КодПричиныНетрудоспособности = "04" Или СтруктураРеквизитов.КодПричиныНетрудоспособности = "07" Тогда
			СтруктураРеквизитов.Вставить("ПричинаНетрудоспособности",					Перечисления.ПричиныНетрудоспособности.ТравмаНаПроизводстве);
			СтруктураРеквизитов.Вставить("СлучайУходаЗаБольнымРебенком",				Перечисления.СлучаиУходаЗаБольнымиДетьми.ПустаяСсылка());
			
		ИначеЕсли СтруктураРеквизитов.КодПричиныНетрудоспособности = "05" Тогда
			СтруктураРеквизитов.Вставить("ПричинаНетрудоспособности",					Перечисления.ПричиныНетрудоспособности.ПоБеременностиИРодам);
			СтруктураРеквизитов.Вставить("СлучайУходаЗаБольнымРебенком",				Перечисления.СлучаиУходаЗаБольнымиДетьми.ПустаяСсылка());
			
		ИначеЕсли СтруктураРеквизитов.КодПричиныНетрудоспособности = "06" Тогда
			СтруктураРеквизитов.Вставить("ПричинаНетрудоспособности",					Перечисления.ПричиныНетрудоспособности.Протезирование);
			СтруктураРеквизитов.Вставить("СлучайУходаЗаБольнымРебенком",				Перечисления.СлучаиУходаЗаБольнымиДетьми.ПустаяСсылка());
			
		ИначеЕсли СтруктураРеквизитов.КодПричиныНетрудоспособности = "08" Тогда
			СтруктураРеквизитов.Вставить("ПричинаНетрудоспособности",					Перечисления.ПричиныНетрудоспособности.ПособиеПриДолечивании);
			СтруктураРеквизитов.Вставить("СлучайУходаЗаБольнымРебенком",				Перечисления.СлучаиУходаЗаБольнымиДетьми.ПустаяСсылка());
			
		ИначеЕсли СтруктураРеквизитов.КодПричиныНетрудоспособности = "09" Тогда
			СтруктураРеквизитов.Вставить("ПричинаНетрудоспособности",					Перечисления.ПричиныНетрудоспособности.ПоУходуЗаРебенком);
			СтруктураРеквизитов.Вставить("СлучайУходаЗаБольнымРебенком",				Перечисления.СлучаиУходаЗаБольнымиДетьми.ПустаяСсылка());
			
		ИначеЕсли СтруктураРеквизитов.КодПричиныНетрудоспособности = "10" Или СтруктураРеквизитов.КодПричиныНетрудоспособности = "11" Тогда
			СтруктураРеквизитов.Вставить("ПричинаНетрудоспособности",					Перечисления.ПричиныНетрудоспособности.ОбщееЗаболевание);
			СтруктураРеквизитов.Вставить("СлучайУходаЗаБольнымРебенком",				Перечисления.СлучаиУходаЗаБольнымиДетьми.ПустаяСсылка());
			
		ИначеЕсли СтруктураРеквизитов.КодПричиныНетрудоспособности = "12" Тогда
			СтруктураРеквизитов.Вставить("ПричинаНетрудоспособности",					Перечисления.ПричиныНетрудоспособности.ПоУходуЗаРебенком);
			СтруктураРеквизитов.Вставить("СлучайУходаЗаБольнымРебенком",				?(СтруктураРеквизитов.ПериодНахожденияВСтационареСРебенкомС = Дата(1, 1, 1), Перечисления.СлучаиУходаЗаБольнымиДетьми.ПоУходуДо7миЛетПриОсобомЗаболеванииАмбулаторно, Перечисления.СлучаиУходаЗаБольнымиДетьми.ПоУходуДо7миЛетПриОсобомЗаболеванииВСтационаре));
			
		ИначеЕсли СтруктураРеквизитов.КодПричиныНетрудоспособности = "13" Тогда
			СтруктураРеквизитов.Вставить("ПричинаНетрудоспособности",					Перечисления.ПричиныНетрудоспособности.ПоУходуЗаРебенком);
			СтруктураРеквизитов.Вставить("СлучайУходаЗаБольнымРебенком",				?(СтруктураРеквизитов.ПериодНахожденияВСтационареСРебенкомС = Дата(1, 1, 1), Перечисления.СлучаиУходаЗаБольнымиДетьми.ПоУходуЗаРебенкомИнвалидомАмбулаторно, Перечисления.СлучаиУходаЗаБольнымиДетьми.ПоУходуЗаРебенкомИнвалидомВСтационаре));
			
		ИначеЕсли СтруктураРеквизитов.КодПричиныНетрудоспособности = "14" Тогда
			СтруктураРеквизитов.Вставить("ПричинаНетрудоспособности",					Перечисления.ПричиныНетрудоспособности.ПоУходуЗаРебенком);
			СтруктураРеквизитов.Вставить("СлучайУходаЗаБольнымРебенком",				?(СтруктураРеквизитов.ПериодНахожденияВСтационареСРебенкомС = Дата(1, 1, 1), Перечисления.СлучаиУходаЗаБольнымиДетьми.ПоУходуДо15тиЛетПриПоствакцинальномОсложненииАмбулаторно, Перечисления.СлучаиУходаЗаБольнымиДетьми.ПоУходуДо15тиЛетПриПоствакцинальномОсложненииВСтационаре));
			
		ИначеЕсли СтруктураРеквизитов.КодПричиныНетрудоспособности = "15" Тогда
			СтруктураРеквизитов.Вставить("ПричинаНетрудоспособности",					Перечисления.ПричиныНетрудоспособности.ПоУходуЗаРебенком);
			СтруктураРеквизитов.Вставить("СлучайУходаЗаБольнымРебенком",				Перечисления.СлучаиУходаЗаБольнымиДетьми.ПоУходуДо15тиЛетПриВИЧ);
			
		Иначе
			СтруктураРеквизитов.Вставить("ПричинаНетрудоспособности",					Перечисления.ПричиныНетрудоспособности.ОбщееЗаболевание);
			СтруктураРеквизитов.Вставить("СлучайУходаЗаБольнымРебенком",				Перечисления.СлучаиУходаЗаБольнымиДетьми.ПустаяСсылка());
			ОписаниеОшибки = "Неизвестный код '" + СтруктураРеквизитов.КодПричиныНетрудоспособности + "' причины нетрудоспособности. В качестве причины нетрудоспособности установлено '" + Строка(Перечисления.ПричиныНетрудоспособности.ОбщееЗаболевание) + "'." + Символы.ПС;
			
		КонецЕсли;
		
	ИначеЕсли СписокПараметров[0] = "05" Тогда // Неопубликованная версия
		СтруктураРеквизитов.Вставить("НомерЛисткаНетрудоспособности",					СписокПараметров[3]);
		
		ВходящийНомерПервичногоЛистка	= СписокПараметров[4];
		
		СтруктураРеквизитов.Вставить("ЯвляетсяПродолжениемБолезни",						СписокПараметров[5] = "0");
		СтруктураРеквизитов.Вставить("ЯвляетсяДубликатом",								СписокПараметров[6] = "1");
		СтруктураРеквизитов.Вставить("ДатаВыдачиЛисткаНетрудоспособности",				ДатаИзСтроки(СписокПараметров[7]));
		СтруктураРеквизитов.Вставить("НаименованиеМедицинскойОрганизации",				СписокПараметров[8]);
		СтруктураРеквизитов.Вставить("АдресМедицинскойОрганизации",						СписокПараметров[9]);
		СтруктураРеквизитов.Вставить("ОГРНМедицинскойОрганизации",						СписокПараметров[10]);
		СтруктураРеквизитов.Вставить("Фамилия",											СписокПараметров[11]);
		СтруктураРеквизитов.Вставить("Имя",												СписокПараметров[12]);
		СтруктураРеквизитов.Вставить("Отчество",										СписокПараметров[13]);
		ДатаРожденияСотрудника	= ДатаИзСтроки(СписокПараметров[14]);
		ВидЗанятостиСотрудника	= ?(СписокПараметров[15] = "0", Перечисления.ВидыЗанятости.Совместительство, Перечисления.ВидыЗанятости.ОсновноеМестоРаботы);
		
		НаименованиеОрганизации	= СписокПараметров[1];
		
		СтруктураРеквизитов.Вставить("КодПричиныНетрудоспособности",					СписокПараметров[16]);
		СтруктураРеквизитов.Вставить("ДополнительныйКодПричиныНетрудоспособности",		СписокПараметров[17]);
		СтруктураРеквизитов.Вставить("ВторойКодПричиныНетрудоспособности",				СписокПараметров[18]);
		СтруктураРеквизитов.Вставить("НомерЛисткаПоОсновномуМестуРаботы",				СписокПараметров[19]);
		СтруктураРеквизитов.Вставить("ДатаИзмененияКодаПричиныНетрудоспособности",		ДатаИзСтроки(СписокПараметров[20]));
		СтруктураРеквизитов.Вставить("ДатаОкончанияПутевки",							ДатаИзСтроки(СписокПараметров[21]));
		СтруктураРеквизитов.Вставить("НомерПутевки",									СписокПараметров[22]);
		СтруктураРеквизитов.Вставить("ОГРН_Санатория",									СписокПараметров[23]);
		
		Если СписокПараметров[27] <> "" Тогда
			СтруктураРеквизитов.Вставить("ПоУходуВозрастЛет1",							СписокПараметров[24]);
			СтруктураРеквизитов.Вставить("ПоУходуВозрастМесяцев1",						СписокПараметров[25]);
			СтруктураРеквизитов.Вставить("ПоУходуРодственнаяСвязь1",					СписокПараметров[26]);
			СтруктураРеквизитов.Вставить("ПоУходуФИО1",									СписокПараметров[27]);
		КонецЕсли;
		
		Если СписокПараметров[31] <> "" Тогда
			СтруктураРеквизитов.Вставить("ПоУходуВозрастЛет2",							СписокПараметров[28]);
			СтруктураРеквизитов.Вставить("ПоУходуВозрастМесяцев2",						СписокПараметров[29]);
			СтруктураРеквизитов.Вставить("ПоУходуРодственнаяСвязь2",					СписокПараметров[30]);
			СтруктураРеквизитов.Вставить("ПоУходуФИО2",									СписокПараметров[31]);
		КонецЕсли;
		
		СтруктураРеквизитов.Вставить("ПоставленаНаУчетВРанниеСрокиБеременности",		СписокПараметров[33] = "1");
		СтруктураРеквизитов.Вставить("ПериодНахожденияВСтационареСРебенкомС",			ДатаИзСтроки(СписокПараметров[34]));
		СтруктураРеквизитов.Вставить("ПериодНахожденияВСтационареСРебенкомПо",			ДатаИзСтроки(СписокПараметров[35]));
		СтруктураРеквизитов.Вставить("КодНарушенияРежима",								СписокПараметров[36]);
		СтруктураРеквизитов.Вставить("ДатаНарушенияРежима",								ДатаИзСтроки(СписокПараметров[37]));
		СтруктураРеквизитов.Вставить("ДатаНаправленияВБюроМСЭ",							ДатаИзСтроки(СписокПараметров[38]));
		СтруктураРеквизитов.Вставить("ДатаРегистрацииДокументовМСЭ",					ДатаИзСтроки(СписокПараметров[39]));
		СтруктураРеквизитов.Вставить("ДатаОсвидетельствованияМСЭ",						ДатаИзСтроки(СписокПараметров[40]));
		
		СтруктураРеквизитов.Вставить("ГруппаИнвалидности",								СписокПараметров[41]);
		СтруктураРеквизитов.Вставить("УстановленаИзмененаГруппаИнвалидности",			СписокПараметров[41] <> "");
		СтруктураРеквизитов.Вставить("НовыйСтатусНетрудопособного",						СписокПараметров[42]);
		
		СтруктураРеквизитов.Вставить("ДатаНачала",										ДатаИзСтроки(СписокПараметров[43]));
		СтруктураРеквизитов.Вставить("ДатаНачалаОплаты",								ДатаИзСтроки(СписокПараметров[43]));
		СтруктураРеквизитов.Вставить("ДатаНачалаСобытия",								?(Не СтруктураРеквизитов.ЯвляетсяПродолжениемБолезни, ДатаИзСтроки(СписокПараметров[43]), Дата(1, 1, 1)));
		СтруктураРеквизитов.Вставить("ДатаОкончания",									ДатаИзСтроки(СписокПараметров[44]));
		СтруктураРеквизитов.Вставить("ДатаОкончанияОплаты",								ДатаИзСтроки(СписокПараметров[44]));
		
		Если СписокПараметров[43] <> "" Тогда
			СтруктураРеквизитов.Вставить("ОсвобождениеДатаНачала1",						ДатаИзСтроки(СписокПараметров[43]));
			СтруктураРеквизитов.Вставить("ОсвобождениеДатаОкончания1",					ДатаИзСтроки(СписокПараметров[44]));
			СтруктураРеквизитов.Вставить("ОсвобождениеДолжностьВрача1",					СписокПараметров[45]);
			СтруктураРеквизитов.Вставить("ОсвобождениеФИОВрача1",						СписокПараметров[46]);
			СтруктураРеквизитов.Вставить("ОсвобождениеИдентификационныйНомерВрача1",	СписокПараметров[47]);
			СтруктураРеквизитов.Вставить("ОсвобождениеФИОВрачаПредседателяВК1",			СписокПараметров[49]);
		КонецЕсли;
		
		Если СписокПараметров[51] <> "" Тогда
			СтруктураРеквизитов.Вставить("ОсвобождениеДатаНачала2",						ДатаИзСтроки(СписокПараметров[51]));
			СтруктураРеквизитов.Вставить("ОсвобождениеДатаОкончания2",					ДатаИзСтроки(СписокПараметров[52]));
			СтруктураРеквизитов.Вставить("ОсвобождениеДолжностьВрача2",					СписокПараметров[53]);
			СтруктураРеквизитов.Вставить("ОсвобождениеФИОВрача2",						СписокПараметров[54]);
			СтруктураРеквизитов.Вставить("ОсвобождениеИдентификационныйНомерВрача2",	СписокПараметров[55]);
			СтруктураРеквизитов.Вставить("ОсвобождениеФИОВрачаПредседателяВК2",			СписокПараметров[57]);
		КонецЕсли;
		
		Если СписокПараметров[59] <> "" Тогда
			СтруктураРеквизитов.Вставить("ОсвобождениеДатаНачала3",						ДатаИзСтроки(СписокПараметров[59]));
			СтруктураРеквизитов.Вставить("ОсвобождениеДатаОкончания3",					ДатаИзСтроки(СписокПараметров[60]));
			СтруктураРеквизитов.Вставить("ОсвобождениеДолжностьВрача3",					СписокПараметров[61]);
			СтруктураРеквизитов.Вставить("ОсвобождениеФИОВрача3",						СписокПараметров[62]);
			СтруктураРеквизитов.Вставить("ОсвобождениеИдентификационныйНомерВрача3",	СписокПараметров[63]);
			СтруктураРеквизитов.Вставить("ОсвобождениеФИОВрачаПредседателяВК3",			СписокПараметров[65]);
		КонецЕсли;
		
		СтруктураРеквизитов.Вставить("ДатаНовыйСтатусНетрудопособного",					ДатаИзСтроки(СписокПараметров[67]));
		СтруктураРеквизитов.Вставить("ПриступитьКРаботеС",								ДатаИзСтроки(СписокПараметров[68]));
		СтруктураРеквизитов.Вставить("НомерЛисткаПродолжения",							СокрЛП(СписокПараметров[69]));
		
		Если СтруктураРеквизитов.КодПричиныНетрудоспособности = "01" Или СтруктураРеквизитов.КодПричиныНетрудоспособности = "02" Тогда
			СтруктураРеквизитов.Вставить("ПричинаНетрудоспособности",					Перечисления.ПричиныНетрудоспособности.ОбщееЗаболевание);
			СтруктураРеквизитов.Вставить("СлучайУходаЗаБольнымРебенком",				Перечисления.СлучаиУходаЗаБольнымиДетьми.ПустаяСсылка());
			
		ИначеЕсли СтруктураРеквизитов.КодПричиныНетрудоспособности = "03" Тогда
			СтруктураРеквизитов.Вставить("ПричинаНетрудоспособности",					Перечисления.ПричиныНетрудоспособности.Карантин);
			СтруктураРеквизитов.Вставить("СлучайУходаЗаБольнымРебенком",				Перечисления.СлучаиУходаЗаБольнымиДетьми.ПустаяСсылка());
			
		ИначеЕсли СтруктураРеквизитов.КодПричиныНетрудоспособности = "04" Или СтруктураРеквизитов.КодПричиныНетрудоспособности = "07" Тогда
			СтруктураРеквизитов.Вставить("ПричинаНетрудоспособности",					Перечисления.ПричиныНетрудоспособности.ТравмаНаПроизводстве);
			СтруктураРеквизитов.Вставить("СлучайУходаЗаБольнымРебенком",				Перечисления.СлучаиУходаЗаБольнымиДетьми.ПустаяСсылка());
			
		ИначеЕсли СтруктураРеквизитов.КодПричиныНетрудоспособности = "05" Тогда
			СтруктураРеквизитов.Вставить("ПричинаНетрудоспособности",					Перечисления.ПричиныНетрудоспособности.ПоБеременностиИРодам);
			СтруктураРеквизитов.Вставить("СлучайУходаЗаБольнымРебенком",				Перечисления.СлучаиУходаЗаБольнымиДетьми.ПустаяСсылка());
			
		ИначеЕсли СтруктураРеквизитов.КодПричиныНетрудоспособности = "06" Тогда
			СтруктураРеквизитов.Вставить("ПричинаНетрудоспособности",					Перечисления.ПричиныНетрудоспособности.Протезирование);
			СтруктураРеквизитов.Вставить("СлучайУходаЗаБольнымРебенком",				Перечисления.СлучаиУходаЗаБольнымиДетьми.ПустаяСсылка());
			
		ИначеЕсли СтруктураРеквизитов.КодПричиныНетрудоспособности = "08" Тогда
			СтруктураРеквизитов.Вставить("ПричинаНетрудоспособности",					Перечисления.ПричиныНетрудоспособности.ПособиеПриДолечивании);
			СтруктураРеквизитов.Вставить("СлучайУходаЗаБольнымРебенком",				Перечисления.СлучаиУходаЗаБольнымиДетьми.ПустаяСсылка());
			
		ИначеЕсли СтруктураРеквизитов.КодПричиныНетрудоспособности = "09" Тогда
			СтруктураРеквизитов.Вставить("ПричинаНетрудоспособности",					Перечисления.ПричиныНетрудоспособности.ПоУходуЗаРебенком);
			СтруктураРеквизитов.Вставить("СлучайУходаЗаБольнымРебенком",				Перечисления.СлучаиУходаЗаБольнымиДетьми.ПустаяСсылка());
			
		ИначеЕсли СтруктураРеквизитов.КодПричиныНетрудоспособности = "10" Или СтруктураРеквизитов.КодПричиныНетрудоспособности = "11" Тогда
			СтруктураРеквизитов.Вставить("ПричинаНетрудоспособности",					Перечисления.ПричиныНетрудоспособности.ОбщееЗаболевание);
			СтруктураРеквизитов.Вставить("СлучайУходаЗаБольнымРебенком",				Перечисления.СлучаиУходаЗаБольнымиДетьми.ПустаяСсылка());
			
		ИначеЕсли СтруктураРеквизитов.КодПричиныНетрудоспособности = "12" Тогда
			СтруктураРеквизитов.Вставить("ПричинаНетрудоспособности",					Перечисления.ПричиныНетрудоспособности.ПоУходуЗаРебенком);
			СтруктураРеквизитов.Вставить("СлучайУходаЗаБольнымРебенком",				?(СтруктураРеквизитов.ПериодНахожденияВСтационареСРебенкомС = Дата(1, 1, 1), Перечисления.СлучаиУходаЗаБольнымиДетьми.ПоУходуДо7миЛетПриОсобомЗаболеванииАмбулаторно, Перечисления.СлучаиУходаЗаБольнымиДетьми.ПоУходуДо7миЛетПриОсобомЗаболеванииВСтационаре));
			
		ИначеЕсли СтруктураРеквизитов.КодПричиныНетрудоспособности = "13" Тогда
			СтруктураРеквизитов.Вставить("ПричинаНетрудоспособности",					Перечисления.ПричиныНетрудоспособности.ПоУходуЗаРебенком);
			СтруктураРеквизитов.Вставить("СлучайУходаЗаБольнымРебенком",				?(СтруктураРеквизитов.ПериодНахожденияВСтационареСРебенкомС = Дата(1, 1, 1), Перечисления.СлучаиУходаЗаБольнымиДетьми.ПоУходуЗаРебенкомИнвалидомАмбулаторно, Перечисления.СлучаиУходаЗаБольнымиДетьми.ПоУходуЗаРебенкомИнвалидомВСтационаре));
			
		ИначеЕсли СтруктураРеквизитов.КодПричиныНетрудоспособности = "14" Тогда
			СтруктураРеквизитов.Вставить("ПричинаНетрудоспособности",					Перечисления.ПричиныНетрудоспособности.ПоУходуЗаРебенком);
			СтруктураРеквизитов.Вставить("СлучайУходаЗаБольнымРебенком",				?(СтруктураРеквизитов.ПериодНахожденияВСтационареСРебенкомС = Дата(1, 1, 1), Перечисления.СлучаиУходаЗаБольнымиДетьми.ПоУходуДо15тиЛетПриПоствакцинальномОсложненииАмбулаторно, Перечисления.СлучаиУходаЗаБольнымиДетьми.ПоУходуДо15тиЛетПриПоствакцинальномОсложненииВСтационаре));
			
		ИначеЕсли СтруктураРеквизитов.КодПричиныНетрудоспособности = "15" Тогда
			СтруктураРеквизитов.Вставить("ПричинаНетрудоспособности",					Перечисления.ПричиныНетрудоспособности.ПоУходуЗаРебенком);
			СтруктураРеквизитов.Вставить("СлучайУходаЗаБольнымРебенком",				Перечисления.СлучаиУходаЗаБольнымиДетьми.ПоУходуДо15тиЛетПриВИЧ);
			
		Иначе
			СтруктураРеквизитов.Вставить("ПричинаНетрудоспособности",					Перечисления.ПричиныНетрудоспособности.ОбщееЗаболевание);
			СтруктураРеквизитов.Вставить("СлучайУходаЗаБольнымРебенком",				Перечисления.СлучаиУходаЗаБольнымиДетьми.ПустаяСсылка());
			ОписаниеОшибки = "Неизвестный код '" + СтруктураРеквизитов.КодПричиныНетрудоспособности + "' причины нетрудоспособности. В качестве причины нетрудоспособности установлено '" + Строка(Перечисления.ПричиныНетрудоспособности.ОбщееЗаболевание) + "'." + Символы.ПС;
			
		КонецЕсли;
		
	Иначе
		ОписаниеОшибки = "Неизвестная версия '" + СписокПараметров[0] + "' штрихкода листка нетрудоспособности. Если Вы уверены, что считали правильный штрихкод, обратитесь в техническую поддержку.";
		Возврат Неопределено;
		
	КонецЕсли;
	
	Запрос = Новый Запрос;
	
	Запрос.УстановитьПараметр("Имя", СтруктураРеквизитов.Имя);
	Запрос.УстановитьПараметр("Отчество", СтруктураРеквизитов.Отчество);
	Запрос.УстановитьПараметр("Фамилия", СтруктураРеквизитов.Фамилия);
	Запрос.УстановитьПараметр("Период", СтруктураРеквизитов.ДатаВыдачиЛисткаНетрудоспособности);
	Запрос.УстановитьПараметр("ДатаРождения", ДатаРожденияСотрудника);
	
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	ФИОФизическихЛицСрезПоследних.ФизическоеЛицо КАК ФизическоеЛицо
	               |ИЗ
	               |	РегистрСведений.ФИОФизическихЛиц.СрезПоследних(
	               |			&Период,
	               |			Имя = &Имя
	               |				И Отчество = &Отчество
	               |				И Фамилия = &Фамилия
	               |				И ФизическоеЛицо.ДатаРождения = &ДатаРождения) КАК ФИОФизическихЛицСрезПоследних";

	СписокФизическихЛиц = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("ФизическоеЛицо");
	
	Если СписокФизическихЛиц.Количество() = 0 Тогда 
		ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru = 'Не найден сотрудник %1 %2 %3, дата рождения %4'"),
			СтруктураРеквизитов.Фамилия, СтруктураРеквизитов.Имя, СтруктураРеквизитов.Отчество, Формат(ДатаРожденияСотрудника, "ДЛФ=Д"));
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
		Возврат Неопределено;
	КонецЕсли;
	
	Запрос.УстановитьПараметр("Наименование", НаименованиеОрганизации);
	
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	Организации.Ссылка КАК Ссылка
	               |ИЗ
	               |	Справочник.Организации КАК Организации
	               |ГДЕ
	               |	(Организации.Наименование ПОДОБНО &Наименование
	               |			ИЛИ Организации.НаименованиеПолное ПОДОБНО &Наименование
	               |			ИЛИ Организации.НаименованиеСокращенное ПОДОБНО &Наименование)";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Организация = Неопределено;
	Если Выборка.Количество() = 1 Тогда 
		Выборка.Следующий();
		Организация = Выборка.Ссылка;
	КонецЕсли;
	
	Отборы = Новый Массив;
	ЗарплатаКадрыОбщиеНаборыДанных.ДобавитьВКоллекциюОтбор(Отборы, "ВидЗанятости", "=", ВидЗанятостиСотрудника);
	
	ПараметрыПолученияСотрудников = КадровыйУчет.ПараметрыПолученияСотрудниковОрганизацийПоСпискуФизическихЛиц();
	ПараметрыПолученияСотрудников.Организация = Организация;
	ПараметрыПолученияСотрудников.НачалоПериода = СтруктураРеквизитов.ДатаВыдачиЛисткаНетрудоспособности;
	ПараметрыПолученияСотрудников.ОкончаниеПериода = СтруктураРеквизитов.ДатаВыдачиЛисткаНетрудоспособности;
	ПараметрыПолученияСотрудников.СписокФизическихЛиц = СписокФизическихЛиц;
	ПараметрыПолученияСотрудников.КадровыеДанные = "Организация";
	ПараметрыПолученияСотрудников.Отборы = Отборы;
	
	СотрудникиОрганизации = КадровыйУчет.СотрудникиОрганизации(Истина, ПараметрыПолученияСотрудников);
	
	Если СотрудникиОрганизации.Количество() = 0 Тогда 
		ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru = 'Не найден сотрудник %1 %2 %3, дата рождения %4, вид занятости %5.'"),
			СтруктураРеквизитов.Фамилия, СтруктураРеквизитов.Имя, СтруктураРеквизитов.Отчество, Формат(ДатаРожденияСотрудника, "ДЛФ=Д"), ВидЗанятостиСотрудника);
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
		Возврат Неопределено;
	КонецЕсли;
	
	СтруктураРеквизитов.Вставить("Организация",		СотрудникиОрганизации[0].Организация);
	СтруктураРеквизитов.Вставить("Сотрудник",		СотрудникиОрганизации[0].Сотрудник);
	СтруктураРеквизитов.Вставить("ФизическоеЛицо",	СотрудникиОрганизации[0].ФизическоеЛицо);
	
	Если ЗначениеЗаполнено(СтруктураРеквизитов.ОГРНМедицинскойОрганизации) Тогда 
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("ОГРН", СтруктураРеквизитов.ОГРНМедицинскойОрганизации);
		Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
		               |	МедицинскиеОрганизации.Ссылка КАК Ссылка
		               |ИЗ
		               |	Справочник.МедицинскиеОрганизации КАК МедицинскиеОрганизации
		               |ГДЕ
		               |	МедицинскиеОрганизации.ОГРН = &ОГРН";
		Выборка = Запрос.Выполнить().Выбрать();
		Если Выборка.Следующий() Тогда 
			СтруктураРеквизитов.Вставить("МедицинскаяОрганизация", Выборка.Ссылка);
		КонецЕсли;
	КонецЕсли;
	
	Возврат СтруктураРеквизитов;
	
КонецФункции

Функция ДатаИзСтроки(ДатаСтрокой)
	
	Если ПустаяСтрока(ДатаСтрокой) Или СтрДлина(ДатаСтрокой) <> 10 Или СтрРазделить(ДатаСтрокой, "-").Количество() <> 3 Тогда
		Возврат Дата(1, 1, 1);
	КонецЕсли;
	
	Возврат Дата(Сред(ДатаСтрокой, 1, 4), Сред(ДатаСтрокой, 6, 2), Сред(ДатаСтрокой, 9, 2));
	
КонецФункции

#КонецОбласти

