#Область СлужебныеПроцедурыИФункции

Функция МассивСвязанныхДанных(ИмяПланаОбмена, ПолноеИмяОбъектаМетаданных) Экспорт
	
	МассивСвязанныхДанных = Новый Структура;
	
	ОбъектМетаданных = Метаданные.НайтиПоПолномуИмени(ПолноеИмяОбъектаМетаданных);
	Если ОбъектМетаданных = Неопределено Тогда
		Возврат МассивСвязанныхДанных;
	КонецЕсли;
	
	ТаблицаЗависимыхДанных = Неопределено;
	СинхронизацияДанныхЗарплатаКадрыСервер.ЗаполнитьТаблицуЗависимыхДанных(ТаблицаЗависимыхДанных);
	ТаблицаЗависимыхДанных.Свернуть("ЗависимыеМетаданные");
	МассивЗависимыхМетаданных = ТаблицаЗависимыхДанных.ВыгрузитьКолонку("ЗависимыеМетаданные");
	
	МассивСлужебныхРегистров = Новый Массив;
	МассивСлужебныхРегистров.Добавить("СоответствияОбъектовИнформационныхБаз");
	
	Для Каждого Состав Из Метаданные.ПланыОбмена[ИмяПланаОбмена].Состав Цикл
		МДСостава = Состав.Метаданные;
		Если Не ОбщегоНазначения.ЭтоРегистрСведений(МДСостава) Тогда
			Продолжить;
		КонецЕсли;
		Если МассивСлужебныхРегистров.Найти(МДСостава.Имя) <> Неопределено Или ВРег(Прав(МДСостава.Имя, 4)) = "ИСПР" Тогда
			Продолжить;
		КонецЕсли;
		Если МассивЗависимыхМетаданных.Найти(МДСостава) <> Неопределено Тогда
			Продолжить;
		КонецЕсли;
		Если МДСостава.РежимЗаписи = Метаданные.СвойстваОбъектов.РежимЗаписиРегистра.ПодчинениеРегистратору Тогда
			Продолжить;
		КонецЕсли;
		
		Для Каждого Измерение Из Состав.Метаданные.Измерения Цикл
			Если Не Измерение.ОсновнойОтбор Тогда
				Продолжить;
			КонецЕсли;
			
			Для Каждого ТипИзмерения Из Измерение.Тип.Типы() Цикл
				Если Метаданные.НайтиПоТипу(ТипИзмерения) = ОбъектМетаданных Тогда
					МассивСвязанныхДанных.Вставить(Состав.Метаданные.Имя, Измерение.Имя);
					Прервать;
				КонецЕсли;
			КонецЦикла;
		КонецЦикла;
	КонецЦикла;
	
	Возврат МассивСвязанныхДанных;
	
КонецФункции

Функция ПолучателиОбъекта(ИмяПланаОбмена, ОбъектМетаданных) Экспорт
	
	ОбъектСоответствуетРегламентированномуУчету = СинхронизацияДанныхЗарплатаКадрыСеансПовтИсп.ОбъектСоответствуетРегламентированномуУчету(ОбъектМетаданных);
	ОбъектСоответствуетУправленческомуУчету = СинхронизацияДанныхЗарплатаКадрыСеансПовтИсп.ОбъектСоответствуетУправленческомуУчету(ОбъектМетаданных);
	ОбъектСоответствуетОбщемуУчету = СинхронизацияДанныхЗарплатаКадрыСеансПовтИсп.ОбъектСоответствуетОбщемуУчету(ОбъектМетаданных);
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("СинхронизироватьДанныеПоОрганизациям", ОбъектСоответствуетРегламентированномуУчету Или ОбъектСоответствуетОбщемуУчету);
	Запрос.УстановитьПараметр("СинхронизироватьДанныеПоПодразделениям", ОбъектСоответствуетУправленческомуУчету Или ОбъектСоответствуетОбщемуУчету);
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ПланОбменаОсновнаяТаблица.Ссылка КАК Ссылка
	|ИЗ
	|	#ПланОбмена КАК ПланОбменаОсновнаяТаблица
	|ГДЕ
	|	НЕ ПланОбменаОсновнаяТаблица.ЭтотУзел
	|	И (ПланОбменаОсновнаяТаблица.СинхронизироватьДанныеПоОрганизациям = &СинхронизироватьДанныеПоОрганизациям
	|			ИЛИ ПланОбменаОсновнаяТаблица.СинхронизироватьДанныеПоПодразделениям = &СинхронизироватьДанныеПоПодразделениям)";
	
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "#ПланОбмена", "ПланОбмена." + ИмяПланаОбмена);
	
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");
	
КонецФункции

Функция ОбъектСоответствуетРегламентированномуУчету(ПолноеИмяОбъектаМетаданных) Экспорт
	
	ОбъектСоответствуетВидуУчета = Ложь;
	ОбъектыРегламентированногоУчета = СинхронизацияДанныхЗарплатаКадрыСервер.ОбъектыРегламентированногоУчета();
	Если ОбъектыРегламентированногоУчета.Найти(ПолноеИмяОбъектаМетаданных) <> Неопределено Тогда
		ОбъектСоответствуетВидуУчета = Истина;
	КонецЕсли;
	
	Возврат ОбъектСоответствуетВидуУчета;
	
КонецФункции

Функция ОбъектСоответствуетУправленческомуУчету(ПолноеИмяОбъектаМетаданных) Экспорт
	
	ОбъектСоответствуетВидуУчета = Ложь;
	ОбъектыУправленческогоУчета = СинхронизацияДанныхЗарплатаКадрыСервер.ОбъектыУправленческогоУчета();
	Если ОбъектыУправленческогоУчета.Найти(ПолноеИмяОбъектаМетаданных) <> Неопределено Тогда
		ОбъектСоответствуетВидуУчета = Истина;
	КонецЕсли;
	
	Возврат ОбъектСоответствуетВидуУчета;
	
КонецФункции

Функция ОбъектСоответствуетОбщемуУчету(ПолноеИмяОбъектаМетаданных) Экспорт
	
	ОбъектСоответствуетВидуУчета = Ложь;
	ОбщиеОбъекты = СинхронизацияДанныхЗарплатаКадрыСервер.ОбщиеОбъекты();
	Если ОбщиеОбъекты.Найти(ПолноеИмяОбъектаМетаданных) <> Неопределено Тогда
		ОбъектСоответствуетВидуУчета = Истина;
	КонецЕсли;
	
	Возврат ОбъектСоответствуетВидуУчета;
	
КонецФункции

Функция ЭтотУзелПланаОбмена(ИмяПланаОбмена) Экспорт
	Возврат ПланыОбмена[ИмяПланаОбмена].ЭтотУзел();
КонецФункции

Функция ОбъектыРегламентированногоУчета() Экспорт
	
	Объекты = Новый Массив;
	
	// ЗарплатаКадрыКорпоративнаяПодсистемы.АвтоматическийРасчетСтажейФизическихЛиц
	Объекты.Добавить("РегистрСведений.СтажиФизическихЛицКПересчету");
	// Конец ЗарплатаКадрыКорпоративнаяПодсистемы.АвтоматическийРасчетСтажейФизическихЛиц
	
	// ЗарплатаКадрыКорпоративнаяПодсистемы.АдаптацияУвольнение
	Объекты.Добавить("РегистрСведений.МероприятияАдаптацииУвольненияПоДокументу");
	Объекты.Добавить("РегистрСведений.ОбновлениеЗаданийАдаптацииУвольнения");
	Объекты.Добавить("РегистрСведений.ОтборыНазначенияМероприятийАдаптацииУвольнения");
	Объекты.Добавить("РегистрСведений.КадровыеДокументыПоРешениям");
	// Конец ЗарплатаКадрыКорпоративнаяПодсистемы.АдаптацияУвольнение
	
	// ЗарплатаКадрыКорпоративнаяПодсистемы.АрхивФизическихЛиц
	Объекты.Добавить("РегистрСведений.АрхивФизическихЛиц");
	Объекты.Добавить("РегистрСведений.АрхивФизическихЛицДокументыУдостоверяющиеЛичность");
	Объекты.Добавить("РегистрСведений.АрхивФизическихЛицКонтактнаяИнформация");
	// Конец ЗарплатаКадрыКорпоративнаяПодсистемы.АрхивФизическихЛиц
	
	// ЗарплатаКадрыКорпоративнаяПодсистемы.БронированиеКомандировок
	Объекты.Добавить("РегистрСведений.БронированиеКомандировок");
	Объекты.Добавить("РегистрСведений.ВерсияЗаказаБронированияКомандировки");
	Объекты.Добавить("РегистрСведений.КомандировкиВСистемеБронирования");
	// Конец ЗарплатаКадрыКорпоративнаяПодсистемы.БронированиеКомандировок
	
	// ЗарплатаКадрыПодсистемы.БронированиеКомандировок.РегулярнаяОтправкаСотрудников
	Объекты.Добавить("Константа.ИспользоватьАвтоматическуюОтправкуСотрудниковБронированияКомандировок");
	Объекты.Добавить("РегистрСведений.ИзмененияФизическихЛицБронированияКомандировок");
	Объекты.Добавить("РегистрСведений.ФизическиеЛицаБронированияКомандировок");
	// Конец ЗарплатаКадрыПодсистемы.БронированиеКомандировок.РегулярнаяОтправкаСотрудников
	
	// ЗарплатаКадрыКорпоративнаяПодсистемы.БронированиеПомещений
	Объекты.Добавить("Справочник.ТерриторииИПомещения");
	// Конец ЗарплатаКадрыКорпоративнаяПодсистемы.БронированиеПомещений
	
	// ЗарплатаКадрыКорпоративнаяПодсистемы.ВыплатыБывшимВоеннослужащим
	Объекты.Добавить("Документ.ВыплатыБывшимВоеннослужащим");
	Объекты.Добавить("Константа.ИспользоватьВыплатыБывшимВоеннослужащим");
	Объекты.Добавить("Справочник.ВыплатыБывшимВоеннослужащимПрисоединенныеФайлы");
	// Конец ЗарплатаКадрыКорпоративнаяПодсистемы.ВыплатыБывшимВоеннослужащим
	
	// ЗарплатаКадрыКорпоративнаяПодсистемы.ГрантыНеоблагаемыеНДФЛ
	Объекты.Добавить("Документ.СписокПолучателейГранта");
	Объекты.Добавить("Константа.ИспользоватьГрантыНеоблагаемыеНДФЛ");
	Объекты.Добавить("РегистрСведений.ПолучателиГрантов");
	Объекты.Добавить("Справочник.Гранты");
	// Конец ЗарплатаКадрыКорпоративнаяПодсистемы.ГрантыНеоблагаемыеНДФЛ
	
	// ЗарплатаКадрыКорпоративнаяПодсистемы.Грейды
	Объекты.Добавить("РегистрСведений.ГрейдыПозиций");
	Объекты.Добавить("РегистрСведений.ГрейдыСотрудников");
	Объекты.Добавить("РегистрСведений.ГрейдыСотрудниковИспр");
	Объекты.Добавить("РегистрСведений.ЗначенияПоказателейРасчетаЗарплатыГрейдов");
	Объекты.Добавить("РегистрСведений.НастройкиГрейдов");
	Объекты.Добавить("РегистрСведений.ОграничениеФОТГрейдов");
	Объекты.Добавить("Справочник.Грейды");
	Объекты.Добавить("Справочник.КритерииОценкиПозицийШтатногоРасписания");
	// Конец ЗарплатаКадрыКорпоративнаяПодсистемы.Грейды
	
	// ЗарплатаКадрыКорпоративнаяПодсистемы.ИнтеграцияРекрутинговыхСайтов
	Объекты.Добавить("РегистрСведений.НастройкиИнтеграцииРекрутинговыхСайтов");
	Объекты.Добавить("РегистрСведений.КлассификаторыРекрутинговыхСайтов");
	// Конец ЗарплатаКадрыКорпоративнаяПодсистемы.ИнтеграцияРекрутинговыхСайтов
	
	// ЗарплатаКадрыКорпоративнаяПодсистемы.ИспытательныйСрокСотрудников
	Объекты.Добавить("Документ.ЗавершениеИспытательногоСрока");
	Объекты.Добавить("Документ.ПродлениеИспытательногоСрока");
	Объекты.Добавить("РегистрСведений.ДанныеИспытательногоСрокаСотрудников");
	Объекты.Добавить("РегистрСведений.ДанныеИспытательногоСрокаСотрудниковИспр");
	Объекты.Добавить("РегистрСведений.ИспытательныйСрокСотрудников");
	Объекты.Добавить("Справочник.ЗавершениеИспытательногоСрокаПрисоединенныеФайлы");
	Объекты.Добавить("Справочник.ПродлениеИспытательногоСрокаПрисоединенныеФайлы");
	// Конец ЗарплатаКадрыКорпоративнаяПодсистемы.ИспытательныйСрокСотрудников
	
	// ЗарплатаКадрыКорпоративнаяПодсистемы.ЛьготыСотрудников
	Объекты.Добавить("РегистрСведений.ЛимитыЛьготСотрудникамПоШтатномуРасписанию");
	// Конец ЗарплатаКадрыКорпоративнаяПодсистемы.ЛьготыСотрудников
	
	// ЗарплатаКадрыКорпоративнаяПодсистемы.МедицинскоеСтрахование
	Объекты.Добавить("Документ.ОткреплениеОтПрограммМедицинскогоСтрахования");
	Объекты.Добавить("Документ.ПрикреплениеКПрограммамМедицинскогоСтрахования");
	Объекты.Добавить("РегистрСведений.АдресаОтправкиУведомленийСтраховыхКомпаний");
	Объекты.Добавить("РегистрСведений.ВозрастныеКоэффициентыСтраховыхКомпаний");
	Объекты.Добавить("РегистрСведений.ОтложенноеМедицинскоеСтрахованиеСотрудников");
	Объекты.Добавить("РегистрСведений.ПрограммыМедицинскогоСтрахованияПоУмолчанию");
	Объекты.Добавить("РегистрСведений.ПрограммыМедицинскогоСтрахованияСотрудников");
	Объекты.Добавить("РегистрСведений.РасширенияПрограммМедицинскогоСтрахованияСотрудников");
	Объекты.Добавить("РегистрСведений.УсловияМедицинскогоСтрахования");
	Объекты.Добавить("Справочник.ОткреплениеОтПрограммМедицинскогоСтрахованияПрисоединенныеФайлы");
	Объекты.Добавить("Справочник.ПрикреплениеКПрограммамМедицинскогоСтрахованияПрисоединенныеФайлы");
	Объекты.Добавить("Справочник.ПрограммыМедицинскогоСтрахования");
	Объекты.Добавить("Справочник.РасширенияПрограммМедицинскогоСтрахования");
	// Конец ЗарплатаКадрыКорпоративнаяПодсистемы.МедицинскоеСтрахование
	
	// ЗарплатаКадрыКорпоративнаяПодсистемы.ОтсутствияСотрудников
	Объекты.Добавить("Документ.ПериодыОтсутствияСотрудников");
	Объекты.Добавить("РегистрСведений.ПериодыОтсутствияСотрудников");
	Объекты.Добавить("Справочник.ПериодыОтсутствияСотрудниковПрисоединенныеФайлы");
	// Конец ЗарплатаКадрыКорпоративнаяПодсистемы.ОтсутствияСотрудников
	
	// ЗарплатаКадрыКорпоративнаяПодсистемы.ОхранаТруда
	Объекты.Добавить("Справочник.НазначениеРабочихМестСотрудникамПрисоединенныеФайлы");
	Объекты.Добавить("Справочник.РабочиеМестаОхраныТруда");
	Объекты.Добавить("Документ.НазначениеРабочихМестСотрудникам");
	// Конец ЗарплатаКадрыКорпоративнаяПодсистемы.ОхранаТруда
	
	// ЗарплатаКадрыКорпоративнаяПодсистемы.ОхранаТруда.Инструктажи
	Объекты.Добавить("Документ.ИнструктажПоОхранеТруда");
	Объекты.Добавить("РегистрСведений.ИнструктажиПоОхранеТруда");
	Объекты.Добавить("Справочник.ВидыИнструктажейПоОхранеТруда");
	Объекты.Добавить("Справочник.ИнструктажПоОхранеТрудаПрисоединенныеФайлы");
	// Конец ЗарплатаКадрыКорпоративнаяПодсистемы.ОхранаТруда.Инструктажи
	
	// ЗарплатаКадрыКорпоративнаяПодсистемы.ОхранаТруда.МедицинскиеОсмотры
	Объекты.Добавить("Документ.ЗаключениеМедицинскогоОсмотра");
	Объекты.Добавить("Документ.НаправлениеНаМедицинскийОсмотр");
	Объекты.Добавить("Константа.ИспользоватьМедицинскиеОсмотры");
	Объекты.Добавить("РегистрСведений.ВыданныеНаправленияНаМедицинскийОсмотр");
	Объекты.Добавить("РегистрСведений.МедицинскиеОсмотры");
	Объекты.Добавить("РегистрСведений.МедицинскиеОсмотрыПоВидамРабот");
	Объекты.Добавить("РегистрСведений.МедицинскиеОсмотрыПоВреднымФакторам");
	Объекты.Добавить("РегистрСведений.ОтстранениеОтРаботыПоРезультатамМедицинскогоОсмотра");
	Объекты.Добавить("РегистрСведений.ПериодическиеМедицинскиеОсмотры");
	Объекты.Добавить("Справочник.ВидыРаботМедицинскихОсмотров");
	Объекты.Добавить("Справочник.ВредныеОпасныеПроизводственныеФакторы");
	Объекты.Добавить("Справочник.ЗаключениеМедицинскогоОсмотраПрисоединенныеФайлы");
	Объекты.Добавить("Справочник.НаправлениеНаМедицинскийОсмотрПрисоединенныеФайлы");
	Объекты.Добавить("РегистрСведений.ВидыРаботМедицинскихОсмотровРабочегоМеста");
	Объекты.Добавить("РегистрСведений.ВредныеФакторыРабочегоМеста");
	Объекты.Добавить("РегистрСведений.ВредныеФакторыИВидыРаботРабочегоМеста");
	Объекты.Добавить("РегистрСведений.ПериодичностьМедицинскихОсмотровРабочихМест");
	// Конец ЗарплатаКадрыКорпоративнаяПодсистемы.ОхранаТруда.МедицинскиеОсмотры
	
	// ЗарплатаКадрыКорпоративнаяПодсистемы.ОхранаТруда.НесчастныеСлучаи
	Объекты.Добавить("Документ.НесчастныйСлучайНаПроизводстве");
	Объекты.Добавить("Документ.ПоследствияНесчастногоСлучая");
	Объекты.Добавить("Документ.ПротоколОпросаУчастникаНесчастногоСлучая");
	Объекты.Добавить("РегистрСведений.НастройкиНесчастныхСлучаевНаПроизводстве");
	Объекты.Добавить("Справочник.ВидыПроисшествий");
	Объекты.Добавить("Справочник.НесчастныйСлучайНаПроизводствеПрисоединенныеФайлы");
	Объекты.Добавить("Справочник.ПоследствияНесчастногоСлучаяПрисоединенныеФайлы");
	Объекты.Добавить("Справочник.ПричиныПроисшествий");
	Объекты.Добавить("Справочник.ПротоколОпросаУчастникаНесчастногоСлучаяПрисоединенныеФайлы");
	Объекты.Добавить("Справочник.ПоследствияНесчастныхСлучаев");
	// Конец ЗарплатаКадрыКорпоративнаяПодсистемы.ОхранаТруда.НесчастныеСлучаи
	
	// ЗарплатаКадрыКорпоративнаяПодсистемы.ОхранаТруда.СпециальнаяОценкаУсловийТруда
	Объекты.Добавить("Документ.ДекларацияСоответствияУсловийТруда");
	Объекты.Добавить("Документ.ПодготовкаСпецоценкиУсловийТруда");
	Объекты.Добавить("Документ.РезультатыСпецоценкиУсловийТруда");
	Объекты.Добавить("РегистрСведений.АналогичныеРабочиеМестаСпециальнойОценкиУсловийТруда");
	Объекты.Добавить("РегистрСведений.НастройкиСпециальнойОценкиУсловийТруда");
	Объекты.Добавить("РегистрСведений.ПлановыеДатыСпециальнойОценкиУсловийТруда");
	Объекты.Добавить("РегистрСведений.РезультатыСпециальнойОценкиУсловийТруда");
	Объекты.Добавить("Справочник.ДекларацияСоответствияУсловийТрудаПрисоединенныеФайлы");
	Объекты.Добавить("Справочник.ПодготовкаСпецоценкиУсловийТрудаПрисоединенныеФайлы");
	Объекты.Добавить("Справочник.РезультатыСпецоценкиУсловийТрудаПрисоединенныеФайлы");
	// Конец ЗарплатаКадрыКорпоративнаяПодсистемы.ОхранаТруда.СпециальнаяОценкаУсловийТруда
	
	// ЗарплатаКадрыКорпоративнаяПодсистемы.ОценкаПерсонала
	Объекты.Добавить("РегистрСведений.ОценкиВариантовОтвета");
	Объекты.Добавить("РегистрСведений.ОценкиОтветовНаВопросыАнкет");
	// Конец ЗарплатаКадрыКорпоративнаяПодсистемы.ОценкаПерсонала
	
	// ЗарплатаКадрыКорпоративнаяПодсистемы.ПодборПерсонала
	Объекты.Добавить("Справочник.ПрофилиДолжностейПрисоединенныеФайлы");
	// Конец ЗарплатаКадрыКорпоративнаяПодсистемы.ПодборПерсонала
	
	// ЗарплатаКадрыКорпоративнаяПодсистемы.ПроизвольныеКадровыеПриказы
	Объекты.Добавить("Документ.ПроизвольныйКадровыйПриказ");
	Объекты.Добавить("ПланВидовХарактеристик.РеквизитыПроизвольныхКадровыхПриказов");
	Объекты.Добавить("Справочник.ПроизвольныйКадровыйПриказПрисоединенныеФайлы");
	Объекты.Добавить("Справочник.ШаблоныПроизвольныхКадровыхПриказов");
	// Конец ЗарплатаКадрыКорпоративнаяПодсистемы.ПроизвольныеКадровыеПриказы
	
	// ЗарплатаКадрыКорпоративнаяПодсистемы.РабочийКалендарь
	Объекты.Добавить("РегистрСведений.НастройкиОтображенияЗаписейРабочегоКалендаря");
	Объекты.Добавить("РегистрСведений.НастройкиРабочегоКалендаря");
	Объекты.Добавить("Справочник.ЗаписиРабочегоКалендаря");
	// Конец ЗарплатаКадрыКорпоративнаяПодсистемы.РабочийКалендарь
	
	// ЗарплатаКадрыКорпоративнаяПодсистемы.РеестрГосслужащих
	Объекты.Добавить("Документ.СведенияОбОрганизацииДляРеестраГосслужащих");
	Объекты.Добавить("РегистрСведений.ОбъектыОкладовИНадбавокПоРееструГосслужащих");
	Объекты.Добавить("РегистрСведений.ОбъектыТрудовойДеятельностиДоЗамещенияПоРееструГосслужащих");
	Объекты.Добавить("РегистрСведений.ОбъектыТрудовойДеятельностиПоРееструГосслужащих");
	Объекты.Добавить("РегистрСведений.СведенияОбОрганизацииДляРеестраГосслужащих");
	Объекты.Добавить("РегистрСведений.ХарактеристикиНачисленийПоРееструГосслужащих");
	Объекты.Добавить("Справочник.ВидыНадбавокРеестраГосслужащих");
	Объекты.Добавить("Справочник.СведенияОбОрганизацииДляРеестраГосслужащихПрисоединенныеФайлы");
	Объекты.Добавить("РегистрСведений.ОбъектыАттестацийПоРееструГосслужащих");
	Объекты.Добавить("РегистрСведений.ОбъектыКлассныхЧиновПоРееструГосслужащих");
	Объекты.Добавить("РегистрСведений.ОбъектыНаградПоРееструГосслужащих");
	Объекты.Добавить("РегистрСведений.ОбъектыЗнанийИностранныхЯзыковПоРееструГосслужащих");
	Объекты.Добавить("РегистрСведений.ОбъектыОтпусковПоРееструГосслужащих");
	Объекты.Добавить("РегистрСведений.ПолисыОМСФизическихЛиц");
	Объекты.Добавить("РегистрСведений.ХарактеристикиКлассныхЧиновПоРееструГосслужащих");
	Объекты.Добавить("РегистрСведений.ХарактеристикиНаградПоРееструГосслужащих");
	Объекты.Добавить("РегистрСведений.ХарактеристикиОтпусковПоРееструГосслужащих");
	Объекты.Добавить("Справочник.ВидыНаградРеестраГосслужащих");
	Объекты.Добавить("Справочник.ВидыОтпусковРеестраГосслужащих");
	Объекты.Добавить("Справочник.КлассныеЧиныРеестраГосслужащих");
	Объекты.Добавить("Справочник.ТипыНагражденияРеестраГосслужащих");
	// Конец ЗарплатаКадрыКорпоративнаяПодсистемы.РеестрГосслужащих
	
	// ЗарплатаКадрыКорпоративнаяПодсистемы.СамообслуживаниеСотрудников
	Объекты.Добавить("Константа.ИспользоватьСамообслуживаниеСотрудников");
	Объекты.Добавить("Справочник.ВидыПредоставляемыхСотрудникамСправок");
	Объекты.Добавить("Справочник.ПричиныОтсутствияСотрудников");
	// Конец ЗарплатаКадрыКорпоративнаяПодсистемы.СамообслуживаниеСотрудников
	
	// ЗарплатаКадрыКорпоративнаяПодсистемы.ХарактеристикиПерсонала
	Объекты.Добавить("РегистрСведений.НастройкиДействийХарактеристикШтатногоРасписания");
	Объекты.Добавить("Справочник.ЗначенияХарактеристикПерсонала");
	Объекты.Добавить("Справочник.УровниКомпетенцийПерсонала");
	// Конец ЗарплатаКадрыКорпоративнаяПодсистемы.ХарактеристикиПерсонала
	
	// ЗарплатаКадрыКорпоративнаяПодсистемы.ЦепочкиДокументов
	Объекты.Добавить("Константа.ИспользоватьЦепочкиДокументов");
	Объекты.Добавить("РегистрСведений.ЦепочкиДокументов");
	// Конец ЗарплатаКадрыКорпоративнаяПодсистемы.ЦепочкиДокументов
	
	// ЗарплатаКадрыКорпоративнаяПодсистемы.ЭлектронноеОбучение.ЭлектронныеКурсы
	Объекты.Добавить("Справочник.ВариантыОтветовНаТестовыеВопросы");
	Объекты.Добавить("Справочник.ПоставщикиЭлектронныхКурсов");
	Объекты.Добавить("Справочник.СодержаниеЭлектронныхКурсов");
	Объекты.Добавить("Справочник.СтраницыЭлементовЭлектронныхКурсов");
	Объекты.Добавить("Справочник.ТеорияЭлектронныхКурсов");
	Объекты.Добавить("Справочник.ТерминыЭлектронныхГлоссариев");
	Объекты.Добавить("Справочник.ТестовыеВопросы");
	Объекты.Добавить("Справочник.ЭлектронныеГлоссарии");
	Объекты.Добавить("Справочник.ЭлектронныеКурсы");
	Объекты.Добавить("Справочник.ЭлектронныеРесурсы");
	Объекты.Добавить("Справочник.ЭлектронныеТесты");
	Объекты.Добавить("Справочник.ЭлементыЭлектронныхРесурсов");
	Объекты.Добавить("Справочник.ЭлементыЭлектронныхРесурсовПрисоединенныеФайлы");
	// Конец ЗарплатаКадрыКорпоративнаяПодсистемы.ЭлектронноеОбучение.ЭлектронныеКурсы
	
	// ЗарплатаКадрыПодсистемы
	Объекты.Добавить("Константа.ВыполнятьРасчетЗарплатыБезОптимизации");
	Объекты.Добавить("РегистрСведений.ДополнительныеНастройкиЗарплатаКадры");
	Объекты.Добавить("РегистрСведений.ЗначенияСтроковыхРеквизитов");
	Объекты.Добавить("РегистрСведений.ИсторияРегистрацийВНалоговомОргане");
	Объекты.Добавить("РегистрСведений.ИсторияРегистрацийВНалоговомОрганеВторичный");
	Объекты.Добавить("РегистрСведений.МакетыКомпоновкиДанных");
	Объекты.Добавить("РегистрСведений.НастройкиЗарплатаКадры");
	Объекты.Добавить("РегистрСведений.СоставДокументовЗарплатаКадры");
	Объекты.Добавить("РегистрСведений.ФизическиеЛицаДокументов");
	Объекты.Добавить("Справочник.ГруппыДоступаФизическихЛиц");
	Объекты.Добавить("Справочник.СпособыОкругленияПриРасчетеЗарплаты");
	Объекты.Добавить("Справочник.СтатьиРасходовЗарплата");
	Объекты.Добавить("Справочник.СтатьиФинансированияЗарплата");
	// Конец ЗарплатаКадрыПодсистемы
	
	// ЗарплатаКадрыПодсистемы.БанковскиеКарты
	Объекты.Добавить("Справочник.БанковскиеКартыКонтрагентов");
	// Конец ЗарплатаКадрыПодсистемы.БанковскиеКарты
	
	// ЗарплатаКадрыПодсистемы.Выплаты.ВзаиморасчетыССотрудниками
	Объекты.Добавить("Документ.ВедомостьНаВыплатуЗарплатыВБанк");
	Объекты.Добавить("Документ.ВедомостьНаВыплатуЗарплатыВКассу");
	Объекты.Добавить("РегистрНакопления.БухгалтерскиеВзаиморасчетыССотрудниками");
	Объекты.Добавить("РегистрНакопления.ВзаиморасчетыССотрудниками");
	Объекты.Добавить("РегистрНакопления.ЗарплатаКВыплате");
	Объекты.Добавить("РегистрНакопления.ЗарплатаКВыплатеАвансом");
	Объекты.Добавить("РегистрСведений.ОплатаВедомостейНаВыплатуЗарплаты");
	Объекты.Добавить("Справочник.ВедомостьНаВыплатуЗарплатыВБанкПрисоединенныеФайлы");
	Объекты.Добавить("Справочник.ВедомостьНаВыплатуЗарплатыВКассуПрисоединенныеФайлы");
	Объекты.Добавить("Справочник.СпособыВыплатыЗарплаты");
	// Конец ЗарплатаКадрыПодсистемы.Выплаты.ВзаиморасчетыССотрудниками
	
	// ЗарплатаКадрыПодсистемы.Выплаты.ОбменСБанкамиПоЗарплатнымПроектам
	Объекты.Добавить("Документ.ЗаявкаНаЗакрытиеЛицевыхСчетовСотрудников");
	Объекты.Добавить("Документ.ЗаявкаНаОткрытиеЛицевыхСчетовСотрудников");
	Объекты.Добавить("Документ.ПодтверждениеЗачисленияЗарплаты");
	Объекты.Добавить("Документ.ПодтверждениеОткрытияЛицевыхСчетовСотрудников");
	Объекты.Добавить("РегистрСведений.ЛицевыеСчетаСотрудниковПоЗарплатнымПроектам");
	Объекты.Добавить("РегистрСведений.ОтложенноеОткрытиеЛицевыхСчетовСотрудников");
	Объекты.Добавить("РегистрСведений.ПлатежныеДокументыПеречисленияЗарплаты");
	Объекты.Добавить("РегистрСведений.РеквизитыПлатежныхДокументовПеречисленияЗарплаты");
	Объекты.Добавить("РегистрСведений.СостоянияДокументовЗачисленияЗарплаты");
	Объекты.Добавить("РегистрСведений.СостоянияДокументовОткрытияЛицевыхСчетов");
	Объекты.Добавить("Справочник.ЗарплатныеПроекты");
	Объекты.Добавить("Справочник.ЗаявкаНаЗакрытиеЛицевыхСчетовСотрудниковПрисоединенныеФайлы");
	Объекты.Добавить("Справочник.ЗаявкаНаОткрытиеЛицевыхСчетовСотрудниковПрисоединенныеФайлы");
	Объекты.Добавить("Справочник.ПодтверждениеЗачисленияЗарплатыПрисоединенныеФайлы");
	Объекты.Добавить("Справочник.ПодтверждениеОткрытияЛицевыхСчетовСотрудниковПрисоединенныеФайлы");
	// Конец ЗарплатаКадрыПодсистемы.Выплаты.ОбменСБанкамиПоЗарплатнымПроектам
	
	// ЗарплатаКадрыПодсистемы.ДоговорыГПХ
	Объекты.Добавить("РегистрНакопления.НачисленияПоДоговорамГПХ");
	Объекты.Добавить("РегистрСведений.ОплаченныеДоговоры");
	Объекты.Добавить("РегистрСведений.ПлановыеНачисленияПоДоговорам");
	Объекты.Добавить("РегистрСведений.УсловияДоговораГПХ");
	// Конец ЗарплатаКадрыПодсистемы.ДоговорыГПХ
	
	// ЗарплатаКадрыПодсистемы.КадровыйУчет
	Объекты.Добавить("РегистрСведений.ВидыЗанятостиСотрудников");
	Объекты.Добавить("РегистрСведений.ГражданствоФизическихЛиц");
	Объекты.Добавить("РегистрСведений.КадроваяИсторияСотрудников");
	Объекты.Добавить("РегистрСведений.НастройкиКадровогоУчета");
	Объекты.Добавить("РегистрСведений.ПериодыДействияДоговоровГражданскоПравовогоХарактера");
	Объекты.Добавить("РегистрСведений.ПредставленияОснованийУвольнения");
	Объекты.Добавить("РегистрСведений.ТекущаяТарифнаяСтавкаСотрудников");
	Объекты.Добавить("РегистрСведений.ТекущиеКадровыеДанныеСотрудников");
	Объекты.Добавить("РегистрСведений.ФИОФизическихЛиц");
	Объекты.Добавить("Справочник.Должности");
	Объекты.Добавить("Справочник.ОснованияУвольнения");
	// Конец ЗарплатаКадрыПодсистемы.КадровыйУчет
	
	// ЗарплатаКадрыПодсистемы.КадровыйУчет.ЭлектронныеТрудовыеКнижки
	Объекты.Добавить("Документ.ЗаявленияОПредоставленииСведенийОТрудовойДеятельности");
	Объекты.Добавить("Документ.ОтзывЗаявленийОПредоставленииСведенийОТрудовойДеятельности");
	Объекты.Добавить("Документ.РегистрацияТрудовойДеятельности");
	Объекты.Добавить("Документ.СведенияОТрудовойДеятельностиРаботникаСТД_Р");
	Объекты.Добавить("РегистрСведений.ЗаявленияОВеденииТрудовыхКнижек");
	Объекты.Добавить("РегистрСведений.ЗаявленияОВеденииТрудовыхКнижекОтозванные");
	Объекты.Добавить("РегистрСведений.ЗаявленияОВеденииТрудовыхКнижекПереданные");
	Объекты.Добавить("РегистрСведений.МероприятияТрудовойДеятельности");
	Объекты.Добавить("РегистрСведений.МероприятияТрудовойДеятельностиПереданные");
	Объекты.Добавить("РегистрСведений.МероприятияТрудовойДеятельностиПрочие");
	Объекты.Добавить("Справочник.ЗаявленияОПредоставленииСведенийОТрудовойДеятельностиПрисоединенныеФайлы");
	Объекты.Добавить("Справочник.ОтзывЗаявленийОПредоставленииСведенийОТрудовойДеятельностиПрисоединенныеФайлы");
	Объекты.Добавить("Справочник.РегистрацияТрудовойДеятельностиПрисоединенныеФайлы");
	Объекты.Добавить("Справочник.СведенияОТрудовойДеятельностиРаботникаСТД_РПрисоединенныеФайлы");
	Объекты.Добавить("Справочник.ТрудовыеФункции");
	Объекты.Добавить("РегистрСведений.НастройкиЭлектронныхТрудовыхКнижек");
	// Конец ЗарплатаКадрыПодсистемы.КадровыйУчет.ЭлектронныеТрудовыеКнижки
	
	// ЗарплатаКадрыПодсистемы.ОтражениеЗарплатыВБухгалтерскомУчете
	Объекты.Добавить("РегистрСведений.БухучетЗарплатыОрганизаций");
	Объекты.Добавить("РегистрСведений.БухучетЗарплатыСотрудников");
	Объекты.Добавить("РегистрСведений.ОтражениеВРегламентированномУчетеНастройкиОрганизаций");
	Объекты.Добавить("РегистрСведений.ПроцентЕНВДДляУчетаЗатратНаЗарплату");
	// Конец ЗарплатаКадрыПодсистемы.ОтражениеЗарплатыВБухгалтерскомУчете
	
	// ЗарплатаКадрыПодсистемы.ПерсонифицированныйУчет
	Объекты.Добавить("Документ.ВедомостьУплатыАДВ_11");
	Объекты.Добавить("Документ.ДанныеОКорректировкеСведенийЗастрахованныхЛицСЗВ_КОРР");
	Объекты.Добавить("Документ.ОписьОДВ_1");
	Объекты.Добавить("Документ.ОписьПачекСЗВ_6");
	Объекты.Добавить("Документ.ПачкаДокументовАДВ_1");
	Объекты.Добавить("Документ.ПачкаДокументовАДВ_2");
	Объекты.Добавить("Документ.ПачкаДокументовАДВ_3");
	Объекты.Добавить("Документ.ПачкаДокументовДСВ_1");
	Объекты.Добавить("Документ.ПачкаДокументовСЗВ_6_1");
	Объекты.Добавить("Документ.ПачкаДокументовСЗВ_6_3");
	Объекты.Добавить("Документ.ПачкаДокументовСЗВ_6_4");
	Объекты.Добавить("Документ.ПачкаДокументовСЗВ_К");
	Объекты.Добавить("Документ.ПачкаДокументовСПВ_1");
	Объекты.Добавить("Документ.ПачкаДокументовСПВ_2");
	Объекты.Добавить("Документ.ПачкаРазделов6РасчетаРСВ_1");
	Объекты.Добавить("Документ.РеестрДСВ_3");
	Объекты.Добавить("Документ.РеестрСЗВ_6_2");
	Объекты.Добавить("Документ.СведенияОЗаработкеСтажеЗастрахованныхЛицСЗВ_ИСХ");
	Объекты.Добавить("Документ.СведенияОЗастрахованныхЛицахСЗВ_М");
	Объекты.Добавить("Документ.СведенияОСтраховомСтажеЗастрахованныхЛицСЗВ_СТАЖ");
	Объекты.Добавить("РегистрНакопления.СтраховыеВзносыПереданныеВПФР");
	Объекты.Добавить("РегистрСведений.ДопустимыеСочетанияКодовГруппСтажа");
	Объекты.Добавить("РегистрСведений.ЗаписиОСтажеСведенияОСтраховомСтажеЗастрахованныхЛицСЗВ_СТАЖ");
	Объекты.Добавить("РегистрСведений.ИсторияРегистрацийВОрганеПФР");
	Объекты.Добавить("РегистрСведений.КорректирующиеФормыРСВ_1");
	Объекты.Добавить("РегистрСведений.НастройкиПроверкиОтчетностиПерсУчета");
	Объекты.Добавить("РегистрСведений.ПодразделенияЗаПределамиРФ");
	Объекты.Добавить("РегистрСведений.СведенияОВзносахВПФР");
	Объекты.Добавить("РегистрСведений.ТерриториальныеУсловияДополнительныеПФР");
	Объекты.Добавить("РегистрСведений.ТерриториальныеУсловияПФР");
	Объекты.Добавить("Справочник.ВедомостьУплатыАДВ_11ПрисоединенныеФайлы");
	Объекты.Добавить("Справочник.ВидыОбщественноПолезнойДеятельностиСЗВК");
	Объекты.Добавить("Справочник.ДанныеОКорректировкеСведенийЗастрахованныхЛицСЗВ_КОРРПрисоединенныеФайлы");
	Объекты.Добавить("Справочник.ЗамещениеГосударственныхМуниципальныхДолжностейПФР");
	Объекты.Добавить("Справочник.КомплектыОтчетностиПерсучета");
	Объекты.Добавить("Справочник.КомплектыОтчетностиПерсучетаПрисоединенныеФайлы");
	Объекты.Добавить("Справочник.ОписьОДВ_1ПрисоединенныеФайлы");
	Объекты.Добавить("Справочник.ОписьПачекСЗВ_6ПрисоединенныеФайлы");
	Объекты.Добавить("Справочник.ОснованияДосрочногоНазначенияПенсии");
	Объекты.Добавить("Справочник.ОснованияДосрочногоНазначенияПенсииДляСЗВК");
	Объекты.Добавить("Справочник.ОснованияИсчисляемогоСтраховогоСтажа");
	Объекты.Добавить("Справочник.ОсобыеУсловияТрудаДляСЗВКПФР");
	Объекты.Добавить("Справочник.ОсобыеУсловияТрудаПФР");
	Объекты.Добавить("Справочник.ПараметрыИсчисляемогоСтраховогоСтажа");
	Объекты.Добавить("Справочник.ПачкаДокументовАДВ_1ПрисоединенныеФайлы");
	Объекты.Добавить("Справочник.ПачкаДокументовАДВ_2ПрисоединенныеФайлы");
	Объекты.Добавить("Справочник.ПачкаДокументовАДВ_3ПрисоединенныеФайлы");
	Объекты.Добавить("Справочник.ПачкаДокументовДСВ_1ПрисоединенныеФайлы");
	Объекты.Добавить("Справочник.ПачкаДокументовСЗВ_6_1ПрисоединенныеФайлы");
	Объекты.Добавить("Справочник.ПачкаДокументовСЗВ_6_3ПрисоединенныеФайлы");
	Объекты.Добавить("Справочник.ПачкаДокументовСЗВ_6_4ПрисоединенныеФайлы");
	Объекты.Добавить("Справочник.ПачкаДокументовСЗВ_КПрисоединенныеФайлы");
	Объекты.Добавить("Справочник.ПачкаДокументовСПВ_1ПрисоединенныеФайлы");
	Объекты.Добавить("Справочник.ПачкаДокументовСПВ_2ПрисоединенныеФайлы");
	Объекты.Добавить("Справочник.ПачкаРазделов6РасчетаРСВ_1ПрисоединенныеФайлы");
	Объекты.Добавить("Справочник.РеестрДСВ_3ПрисоединенныеФайлы");
	Объекты.Добавить("Справочник.РеестрСЗВ_6_2ПрисоединенныеФайлы");
	Объекты.Добавить("Справочник.СведенияОЗаработкеСтажеЗастрахованныхЛицСЗВ_ИСХПрисоединенныеФайлы");
	Объекты.Добавить("Справочник.СведенияОЗастрахованныхЛицахСЗВ_МПрисоединенныеФайлы");
	Объекты.Добавить("Справочник.СведенияОСтраховомСтажеЗастрахованныхЛицСЗВ_СТАЖПрисоединенныеФайлы");
	Объекты.Добавить("Справочник.СпискиПрофессийДолжностейЛьготногоПенсионногоОбеспечения");
	Объекты.Добавить("Справочник.ТерриториальныеУсловияПФР");
	Объекты.Добавить("Документ.СведенияОТрудовойДеятельностиРаботниковСЗВ_ТД");
	Объекты.Добавить("РегистрСведений.ДатыВступленияВСилуНА");
	Объекты.Добавить("Справочник.КомплектыОтчетностиПерсУчета");
	Объекты.Добавить("Справочник.КомплектыОтчетностиПерсУчетаПрисоединенныеФайлы");
	Объекты.Добавить("Справочник.СведенияОТрудовойДеятельностиРаботниковСЗВ_ТДПрисоединенныеФайлы");
	// Конец ЗарплатаКадрыПодсистемы.ПерсонифицированныйУчет
	
	// ЗарплатаКадрыПодсистемы.ПерсонифицированныйУчет.УчетСтажаПФР
	Объекты.Добавить("РегистрСведений.ПараметрыПериодовСтажаПФР");
	Объекты.Добавить("РегистрСведений.ПериодыСтажаПФР");
	// Конец ЗарплатаКадрыПодсистемы.ПерсонифицированныйУчет.УчетСтажаПФР
	
	// ЗарплатаКадрыПодсистемы.ПодписиДокументов
	Объекты.Добавить("РегистрСведений.ОснованияПолномочийОтветственныхЛиц");
	// Конец ЗарплатаКадрыПодсистемы.ПодписиДокументов
	
	// ЗарплатаКадрыПодсистемы.ПособияСоциальногоСтрахования
	Объекты.Добавить("Документ.ИсходящаяСправкаОЗаработкеДляРасчетаПособий");
	Объекты.Добавить("РегистрНакопления.ПособияПоСоциальномуСтрахованию");
	Объекты.Добавить("РегистрНакопления.ПособияПоУходуЗаРебенком");
	Объекты.Добавить("РегистрСведений.МаксимальныйРазмерЕжемесячнойСтраховойВыплаты");
	Объекты.Добавить("РегистрСведений.НастройкиУчетаПособийСоциальногоСтрахования");
	Объекты.Добавить("Справочник.ИсходящаяСправкаОЗаработкеДляРасчетаПособийПрисоединенныеФайлы");
	// Конец ЗарплатаКадрыПодсистемы.ПособияСоциальногоСтрахования
	
	// ЗарплатаКадрыПодсистемы.ПособияСоциальногоСтрахования.ПрямыеВыплаты
	Объекты.Добавить("Документ.ВозмещениеБольничныхВЧастиФБ");
	Объекты.Добавить("Документ.ЗаявлениеВФССОВозмещенииВыплатРодителямДетейИнвалидов");
	Объекты.Добавить("Документ.ЗаявлениеВФССОВозмещенииРасходовНаПогребение");
	Объекты.Добавить("Документ.ЗаявлениеСотрудникаНаВыплатуПособия");
	Объекты.Добавить("Документ.ОписьЗаявленийСотрудниковНаВыплатуПособий");
	Объекты.Добавить("Документ.РеестрСведенийНеобходимыхДляНазначенияИВыплатыПособий");
	Объекты.Добавить("Документ.УведомлениеОПрекращенииОтпускаПоУходуЗаРебенком");
	Объекты.Добавить("Справочник.МедицинскиеОрганизации");
	Объекты.Добавить("Справочник.ВозмещениеБольничныхВЧастиФБПрисоединенныеФайлы");
	Объекты.Добавить("Справочник.ЗаявлениеВФССОВозмещенииВыплатРодителямДетейИнвалидовПрисоединенныеФайлы");
	Объекты.Добавить("Справочник.ЗаявлениеВФССОВозмещенииРасходовНаПогребениеПрисоединенныеФайлы");
	Объекты.Добавить("Справочник.ЗаявлениеСотрудникаНаВыплатуПособияПрисоединенныеФайлы");
	Объекты.Добавить("Справочник.ОписьЗаявленийСотрудниковНаВыплатуПособийПрисоединенныеФайлы");
	Объекты.Добавить("Справочник.РеестрСведенийНеобходимыхДляНазначенияИВыплатыПособийПрисоединенныеФайлы");
	Объекты.Добавить("Справочник.УведомлениеОПрекращенииОтпускаПоУходуЗаРебенкомПрисоединенныеФайлы");
	// Конец ЗарплатаКадрыПодсистемы.ПособияСоциальногоСтрахования.ПрямыеВыплаты
	
	// ЗарплатаКадрыПодсистемы.ПособияСоциальногоСтрахования.СЭДО.ИзвещенияФСС
	Объекты.Добавить("Справочник.ИзвещениеФССПрисоединенныеФайлы");
	Объекты.Добавить("Документ.ИзвещениеФСС");
	// Конец ЗарплатаКадрыПодсистемы.ПособияСоциальногоСтрахования.СЭДО.ИзвещенияФСС
	
	// ЗарплатаКадрыПодсистемы.ПособияСоциальногоСтрахования.ЭЛН
	Объекты.Добавить("Документ.РеестрДанныхЭЛНЗаполняемыхРаботодателем");
	Объекты.Добавить("Справочник.РеестрДанныхЭЛНЗаполняемыхРаботодателемПрисоединенныеФайлы");
	Объекты.Добавить("РегистрСведений.СведенияОбЭЛН");
	// Конец ЗарплатаКадрыПодсистемы.ПособияСоциальногоСтрахования.ЭЛН
	
	// ЗарплатаКадрыПодсистемы.РасчетЗарплаты
	Объекты.Добавить("РегистрСведений.МинимальнаяОплатаТрудаРФ");
	Объекты.Добавить("РегистрСведений.ПлановыеАвансы");
	Объекты.Добавить("РегистрСведений.ПлановыеНачисления");
	Объекты.Добавить("РегистрСведений.ПлановыеУдержания");
	Объекты.Добавить("РегистрСведений.НастройкиРасчетаЗарплаты");
	// Конец ЗарплатаКадрыПодсистемы.РасчетЗарплаты
	
	// ЗарплатаКадрыПодсистемы.Сотрудники
	Объекты.Добавить("РегистрСведений.СведенияОРежимахРаботыФормыСотрудника");
	// Конец ЗарплатаКадрыПодсистемы.Сотрудники
	
	// ЗарплатаКадрыПодсистемы.УчетВзносовДокументы
	Объекты.Добавить("Документ.АктПроверкиСтраховыхВзносов");
	Объекты.Добавить("Документ.ПерерасчетСтраховыхВзносов");
	Объекты.Добавить("Справочник.АктПроверкиСтраховыхВзносовПрисоединенныеФайлы");
	Объекты.Добавить("Справочник.ПерерасчетСтраховыхВзносовПрисоединенныеФайлы");
	// Конец ЗарплатаКадрыПодсистемы.УчетВзносовДокументы
	
	// ЗарплатаКадрыПодсистемы.УчетНачисленнойЗарплаты
	Объекты.Добавить("РегистрНакопления.НачисленияУдержанияПоСотрудникам");
	Объекты.Добавить("РегистрНакопления.ОтработанноеВремяПоСотрудникам");
	// Конец ЗарплатаКадрыПодсистемы.УчетНачисленнойЗарплаты
	
	// ЗарплатаКадрыПодсистемы.УчетНДФЛ
	Объекты.Добавить("Документ.ОперацияНалоговогоУчетаПоНДФЛ");
	Объекты.Добавить("РегистрНакопления.АвансовыеПлатежиИностранцевПоНДФЛ");
	Объекты.Добавить("РегистрНакопления.ИмущественныеВычетыНДФЛ");
	Объекты.Добавить("РегистрНакопления.НДФЛКПеречислению");
	Объекты.Добавить("РегистрНакопления.НДФЛПеречисленный");
	Объекты.Добавить("РегистрНакопления.ПредоставленныеСтандартныеИСоциальныеВычетыНДФЛ");
	Объекты.Добавить("РегистрНакопления.РасчетыНалоговыхАгентовСБюджетомПоНДФЛ");
	Объекты.Добавить("РегистрНакопления.РасчетыНалогоплательщиковСБюджетомПоНДФЛ");
	Объекты.Добавить("РегистрНакопления.СведенияОДоходахНДФЛ");
	Объекты.Добавить("РегистрНакопления.УплатаНДФЛНалоговымиАгентамиКРаспределению");
	Объекты.Добавить("РегистрСведений.ВычетыПоДоходамНДФЛ");
	Объекты.Добавить("РегистрСведений.ДокументыУчтенныеПриРасчетеНДФЛ");
	Объекты.Добавить("РегистрСведений.ДоходыПредыдущегоМестаРаботыНДФЛ");
	Объекты.Добавить("РегистрСведений.ПрименениеСтандартныхВычетовПоНДФЛ");
	Объекты.Добавить("РегистрСведений.ПрименениеСтандартныхВычетовПоНДФЛВторичный");
	Объекты.Добавить("РегистрСведений.РазмерВычетовНДФЛ");
	Объекты.Добавить("РегистрСведений.РазмерВычетовНДФЛВторичный");
	Объекты.Добавить("РегистрСведений.РедактируемыеРеквизитыКодаДоходаНДФЛ");
	Объекты.Добавить("РегистрСведений.РеквизитыУведомленияИФНСНаЗачетАвансовыхПлатежей");
	Объекты.Добавить("РегистрСведений.СтандартныеВычетыНаДетейНДФЛ");
	Объекты.Добавить("РегистрСведений.СтандартныеВычетыПоНДФЛВторичный");
	Объекты.Добавить("РегистрСведений.СтандартныеВычетыФизическихЛицНДФЛ");
	Объекты.Добавить("РегистрСведений.СтатусФизическихЛицКакНалогоплательщиковНДФЛ");
	Объекты.Добавить("РегистрСведений.СтатусФизическихЛицКакНалогоплательщиковНДФЛВторичный");
	Объекты.Добавить("РегистрСведений.УчетнаяПолитикаПоНДФЛ");
	Объекты.Добавить("Справочник.ВидыВычетовНДФЛ");
	Объекты.Добавить("Справочник.ВидыДоходовНДФЛ");
	Объекты.Добавить("Справочник.СтатусыНалогоплательщиковПоНДФЛ");
	Объекты.Добавить("Справочник.ОперацияНалоговогоУчетаПоНДФЛПрисоединенныеФайлы");
	Объекты.Добавить("РегистрСведений.ВычетыПредыдущегоМестаРаботыНДФЛ");
	// Конец ЗарплатаКадрыПодсистемы.УчетНДФЛ
	
	// ЗарплатаКадрыПодсистемы.УчетНДФЛДокументы
	Объекты.Добавить("Документ.АвансовыйПлатежИностранцаПоНДФЛ");
	Объекты.Добавить("Документ.ВозвратНДФЛ");
	Объекты.Добавить("Документ.ЗаявлениеНаПредоставлениеСтандартныхВычетовПоНДФЛ");
	Объекты.Добавить("Документ.ЗаявлениеОПодтвержденииПраваНаЗачетАвансовПоНДФЛ");
	Объекты.Добавить("Документ.ПерерасчетНДФЛ");
	Объекты.Добавить("Документ.ПрекращениеСтандартныхВычетовНДФЛ");
	Объекты.Добавить("Документ.СправкаНДФЛ");
	Объекты.Добавить("Документ.СправкиНДФЛДляПередачиВНалоговыйОрган");
	Объекты.Добавить("Документ.УведомлениеОПравеНаИмущественныйВычетДляНДФЛ");
	Объекты.Добавить("РегистрСведений.СправкиНДФЛДляИФНССведенияОВычетах");
	Объекты.Добавить("РегистрСведений.СправкиНДФЛДляИФНССведенияОДоходах");
	Объекты.Добавить("Справочник.ЗаявлениеОПодтвержденииПраваНаЗачетАвансовПоНДФЛПрисоединенныеФайлы");
	Объекты.Добавить("Справочник.СправкиНДФЛДляПередачиВНалоговыйОрганПрисоединенныеФайлы");
	Объекты.Добавить("Справочник.АвансовыйПлатежИностранцаПоНДФЛПрисоединенныеФайлы");
	Объекты.Добавить("Справочник.ВозвратНДФЛПрисоединенныеФайлы");
	Объекты.Добавить("Справочник.ЗаявлениеНаПредоставлениеСтандартныхВычетовПоНДФЛПрисоединенныеФайлы");
	Объекты.Добавить("Справочник.ПерерасчетНДФЛПрисоединенныеФайлы");
	Объекты.Добавить("Справочник.ПрекращениеСтандартныхВычетовНДФЛПрисоединенныеФайлы");
	Объекты.Добавить("Справочник.СправкаНДФЛПрисоединенныеФайлы");
	Объекты.Добавить("Справочник.УведомлениеОПравеНаИмущественныйВычетДляНДФЛПрисоединенныеФайлы");
	// Конец ЗарплатаКадрыПодсистемы.УчетНДФЛДокументы
	
	// ЗарплатаКадрыПодсистемы.УчетРабочегоВремени
	Объекты.Добавить("Справочник.ВидыИспользованияРабочегоВремени");
	// Конец ЗарплатаКадрыПодсистемы.УчетРабочегоВремени
	
	// ЗарплатаКадрыПодсистемы.УчетСтраховыхВзносов
	Объекты.Добавить("Документ.ОперацияУчетаПоСтраховымВзносам");
	Объекты.Добавить("РегистрНакопления.ИсчисленныеСтраховыеВзносы");
	Объекты.Добавить("РегистрНакопления.РасчетыСФондамиПоСтраховымВзносам");
	Объекты.Добавить("РегистрНакопления.СведенияОДоходахСтраховыеВзносы");
	Объекты.Добавить("РегистрНакопления.СтраховыеВзносыПоФизическимЛицам");
	Объекты.Добавить("РегистрСведений.ВременноПребывающиеПринятыеПоДолгосрочнымДоговорам");
	Объекты.Добавить("РегистрСведений.КлассыУсловийТрудаПоДолжностям");
	Объекты.Добавить("РегистрСведений.НастройкиИспользованияСтраховыхВзносовПоКлассамУсловийТруда");
	Объекты.Добавить("РегистрСведений.НастройкиУчетаСтраховыхВзносов");
	Объекты.Добавить("РегистрСведений.ПредельнаяВеличинаБазыСтраховыхВзносов");
	Объекты.Добавить("РегистрСведений.ПрименяемыеТарифыСтраховыхВзносов");
	Объекты.Добавить("РегистрСведений.СтавкаВзносаНаСтрахованиеОтНесчастныхСлучаев");
	Объекты.Добавить("РегистрСведений.СтатусыЗастрахованныхФизическихЛиц");
	Объекты.Добавить("РегистрСведений.СтраховыеВзносыСкидкиКДоходам");
	Объекты.Добавить("РегистрСведений.ТарифыВзносовЗаЗанятыхНаРаботахСДосрочнойПенсией");
	Объекты.Добавить("РегистрСведений.ТарифыВзносовПоРезультатамСпециальнойОценкиУсловийТруда");
	Объекты.Добавить("РегистрСведений.ТарифыСтраховыхВзносов");
	Объекты.Добавить("Справочник.ВидыДоходовПоСтраховымВзносам");
	Объекты.Добавить("Справочник.ВидыТарифовСтраховыхВзносов");
	Объекты.Добавить("Справочник.ОперацияУчетаПоСтраховымВзносамПрисоединенныеФайлы");
	Объекты.Добавить("РегистрСведений.ИсторияСамостоятельныхКлассификационныхЕдиниц");
	Объекты.Добавить("Справочник.СамостоятельныеКлассификационныеЕдиницы");
	// Конец ЗарплатаКадрыПодсистемы.УчетСтраховыхВзносов
	
	// ЗарплатаКадрыПодсистемы.ФизическиеЛица
	Объекты.Добавить("РегистрСведений.ДокументыФизическихЛиц");
	Объекты.Добавить("РегистрСведений.СведенияОбИнвалидностиФизическихЛиц");
	Объекты.Добавить("Справочник.ВидыДокументовФизическихЛиц");
	// Конец ЗарплатаКадрыПодсистемы.ФизическиеЛица
	
	// ЗарплатаКадрыПриложения.АттестацииСотрудников
	Объекты.Добавить("Документ.НаправлениеНаВнешнююАттестацию");
	Объекты.Добавить("Документ.ПриказОбАттестацииСотрудников");
	Объекты.Добавить("Документ.РезультатыАттестацииСотрудников");
	Объекты.Добавить("Документ.ФормированиеАттестационнойКомиссииСотрудников");
	Объекты.Добавить("РегистрСведений.ВнеочередныеАттестацииСотрудников");
	Объекты.Добавить("РегистрСведений.РезультатыАттестацийСотрудников");
	Объекты.Добавить("Справочник.ВидыАттестацийСотрудников");
	Объекты.Добавить("Справочник.НаправлениеНаВнешнююАттестациюПрисоединенныеФайлы");
	Объекты.Добавить("Справочник.ПриказОбАттестацииСотрудниковПрисоединенныеФайлы");
	Объекты.Добавить("Справочник.РезультатыАттестацииСотрудниковПрисоединенныеФайлы");
	Объекты.Добавить("Справочник.РешенияАттестационныхКомиссий");
	Объекты.Добавить("Справочник.ФормированиеАттестационнойКомиссииСотрудниковПрисоединенныеФайлы");
	// Конец ЗарплатаКадрыПриложения.АттестацииСотрудников
	
	// ЗарплатаКадрыПриложения.БазовыеСправочныеДанные
	Объекты.Добавить("Справочник.Контрагенты");
	Объекты.Добавить("Справочник.СпособыОтраженияЗарплатыВБухУчете");
	// Конец ЗарплатаКадрыПриложения.БазовыеСправочныеДанные
	
	// ЗарплатаКадрыПриложения.БазовыеСправочныеДанные.НастройкиСистемыНалогообложения
	Объекты.Добавить("РегистрСведений.НастройкиСистемыНалогообложения");
	// Конец ЗарплатаКадрыПриложения.БазовыеСправочныеДанные.НастройкиСистемыНалогообложения
	
	// ЗарплатаКадрыПриложения.БазовыеСправочныеДанные.Организации
	Объекты.Добавить("Справочник.Организации");
	// Конец ЗарплатаКадрыПриложения.БазовыеСправочныеДанные.Организации
	
	// ЗарплатаКадрыПриложения.БазовыеСправочныеДанныеОтражениеВФинучете
	Объекты.Добавить("Справочник.ПрочиеРасходы");
	// Конец ЗарплатаКадрыПриложения.БазовыеСправочныеДанныеОтражениеВФинучете
	
	// ЗарплатаКадрыПриложения.БазовыеСправочныеДанныеРасширенная
	Объекты.Добавить("РегистрСведений.РасценкиРаботСотрудников");
	Объекты.Добавить("Справочник.БанковскиеСчетаКонтрагентов");
	Объекты.Добавить("Справочник.ВидыРаботСотрудников");
	Объекты.Добавить("Справочник.Кассы");
	// Конец ЗарплатаКадрыПриложения.БазовыеСправочныеДанныеРасширенная
	
	// ЗарплатаКадрыПриложения.БухучетХозрасчетныхОрганизаций
	Объекты.Добавить("Документ.ОтражениеЗарплатыВБухучете");
	Объекты.Добавить("Справочник.ОтражениеЗарплатыВБухучетеПрисоединенныеФайлы");
	Объекты.Добавить("Документ.ОтражениеСтатистикиПерсоналаВБухучете");
	Объекты.Добавить("Справочник.ОтражениеСтатистикиПерсоналаВБухучетеПрисоединенныеФайлы");
	// Конец ЗарплатаКадрыПриложения.БухучетХозрасчетныхОрганизаций
	
	// ЗарплатаКадрыПриложения.ВнешниеХозяйственныеОперации.ВзаиморасчетыССотрудникамиВХО
	Объекты.Добавить("Документ.ПлатежноеПоручение");
	Объекты.Добавить("Справочник.ПлатежноеПоручениеПрисоединенныеФайлы");
	// Конец ЗарплатаКадрыПриложения.ВнешниеХозяйственныеОперации.ВзаиморасчетыССотрудникамиВХО
	
	// ЗарплатаКадрыПриложения.ВнешниеХозяйственныеОперации.ВзаиморасчетыССотрудникамиВХОРасширенная
	Объекты.Добавить("Документ.ВозвратСотрудникомЗадолженности");
	Объекты.Добавить("Документ.СведенияОНезачисленнойЗарплате");
	Объекты.Добавить("Справочник.ВозвратСотрудникомЗадолженностиПрисоединенныеФайлы");
	Объекты.Добавить("Справочник.СведенияОНезачисленнойЗарплатеПрисоединенныеФайлы");
	// Конец ЗарплатаКадрыПриложения.ВнешниеХозяйственныеОперации.ВзаиморасчетыССотрудникамиВХОРасширенная
	
	// ЗарплатаКадрыПриложения.ВнешниеХозяйственныеОперации.ЗаймыСотрудникамВХО
	Объекты.Добавить("Документ.ВыдачаЗаймаСотруднику");
	Объекты.Добавить("Документ.ПогашениеЗаймаСотруднику");
	Объекты.Добавить("Справочник.ВыдачаЗаймаСотрудникуПрисоединенныеФайлы");
	Объекты.Добавить("Справочник.ПогашениеЗаймаСотрудникуПрисоединенныеФайлы");
	// Конец ЗарплатаКадрыПриложения.ВнешниеХозяйственныеОперации.ЗаймыСотрудникамВХО
	
	// ЗарплатаКадрыПриложения.ВнешниеХозяйственныеОперации.УчетДепонированнойЗарплатыВХО
	Объекты.Добавить("Документ.ВыплатаДепонированнойЗарплаты");
	Объекты.Добавить("Справочник.ВыплатаДепонированнойЗарплатыПрисоединенныеФайлы");
	// Конец ЗарплатаКадрыПриложения.ВнешниеХозяйственныеОперации.УчетДепонированнойЗарплатыВХО
	
	// ЗарплатаКадрыПриложения.ВнешниеХозяйственныеОперации.УчетНДФЛВХО
	Объекты.Добавить("Документ.ПеречислениеНДФЛВБюджет");
	Объекты.Добавить("Справочник.ПеречислениеНДФЛВБюджетПрисоединенныеФайлы");
	// Конец ЗарплатаКадрыПриложения.ВнешниеХозяйственныеОперации.УчетНДФЛВХО
	
	// ЗарплатаКадрыПриложения.ВнешниеХозяйственныеОперации.УчетСтраховыхВзносовВХО
	Объекты.Добавить("Документ.ВозмещениеРасходовФондомСоциальногоСтрахования");
	Объекты.Добавить("Документ.УплатаСтраховыхВзносовВФонды");
	Объекты.Добавить("Справочник.ВозмещениеРасходовФондомСоциальногоСтрахованияПрисоединенныеФайлы");
	Объекты.Добавить("Справочник.УплатаСтраховыхВзносовВФондыПрисоединенныеФайлы");
	// Конец ЗарплатаКадрыПриложения.ВнешниеХозяйственныеОперации.УчетСтраховыхВзносовВХО
	
	// ЗарплатаКадрыПриложения.ВнешниеХозяйственныеОперации.УчетФактическиПолученныхДоходов
	Объекты.Добавить("Документ.ПодтверждениеВыплатыДоходов");
	Объекты.Добавить("РегистрСведений.ДатыВыплатыДоходов");
	Объекты.Добавить("Справочник.ПодтверждениеВыплатыДоходовПрисоединенныеФайлы");
	// Конец ЗарплатаКадрыПриложения.ВнешниеХозяйственныеОперации.УчетФактическиПолученныхДоходов
	
	// ЗарплатаКадрыПриложения.ГосударственнаяСлужба
	Объекты.Добавить("РегистрСведений.ВариантыРасчетаСреднегоЗаработкаДокументов");
	Объекты.Добавить("РегистрСведений.КоэффициентыРаспределенияДенежногоСодержания");
	Объекты.Добавить("РегистрСведений.НастройкиГосударственнойСлужбы");
	Объекты.Добавить("РегистрСведений.СведенияОГосударственномСлужащем");
	Объекты.Добавить("РегистрСведений.СвойстваДолжностейГосударственнойСлужбы");
	Объекты.Добавить("РегистрСведений.СвойстваНачисленийГосударственныхСлужащих");
	Объекты.Добавить("Справочник.КатегорииНадбавокФормы3ОБ");
	Объекты.Добавить("Справочник.ОснованияЗаключенияСрочныхДоговоровМуниципальныхСлужащих");
	Объекты.Добавить("Справочник.ОснованияЗаключенияСрочныхКонтрактовГосслужащих");
	Объекты.Добавить("Справочник.ОснованияУвольненияСГосударственнойСлужбы");
	Объекты.Добавить("Справочник.ОснованияУвольненияСМуниципальнойСлужбы");
	Объекты.Добавить("Справочник.ОснованияУвольненияВоеннойИПравоохранительнойСлужб");
	// Конец ЗарплатаКадрыПриложения.ГосударственнаяСлужба
	
	// ЗарплатаКадрыПриложения.ГосударственнаяСлужба.ВоинскиеСпециальныеЗвания
	Объекты.Добавить("Документ.ПрисвоениеВоинскогоСпециальногоЗвания");
	Объекты.Добавить("Документ.ПрисвоениеВоинскогоСпециальногоЗванияСписком");
	Объекты.Добавить("Документ.УтверждениеОкладовЗаВоинскиеСпециальныеЗвания");
	Объекты.Добавить("РегистрСведений.ВоинскиеСпециальныеЗванияФизическихЛиц");
	Объекты.Добавить("РегистрСведений.ОкладыПоВоинскимСпециальнымЗваниям");
	Объекты.Добавить("Справочник.ВоинскиеСпециальныеЗвания");
	Объекты.Добавить("Справочник.ПрисвоениеВоинскогоСпециальногоЗванияПрисоединенныеФайлы");
	Объекты.Добавить("Справочник.ПрисвоениеВоинскогоСпециальногоЗванияСпискомПрисоединенныеФайлы");
	Объекты.Добавить("Справочник.УтверждениеОкладовЗаВоинскиеСпециальныеЗванияПрисоединенныеФайлы");
	// Конец ЗарплатаКадрыПриложения.ГосударственнаяСлужба.ВоинскиеСпециальныеЗвания
	
	// ЗарплатаКадрыПриложения.ГосударственнаяСлужба.КадровыйУчетВоеннослужащих
	Объекты.Добавить("Документ.ВозвратИзОтпускаПоУходуЗаРебенкомВоеннослужащего");
	Объекты.Добавить("Документ.ВосстановлениеВДолжностиВоеннослужащего");
	Объекты.Добавить("Документ.ЗачислениеВСпискиЧасти");
	Объекты.Добавить("Документ.ЗачислениеВСпискиЧастиСписком");
	Объекты.Добавить("Документ.ИзменениеУсловийОплатыОтпускаПоУходуЗаРебенкомВоеннослужащего");
	Объекты.Добавить("Документ.ИсключениеИзСписковЧасти");
	Объекты.Добавить("Документ.ИсключениеИзСписковЧастиСписком");
	Объекты.Добавить("Документ.КадровыйПереводВоеннослужащего");
	Объекты.Добавить("Документ.КадровыйПереводВоеннослужащегоСписком");
	Объекты.Добавить("Документ.ОплатаСверхурочныхВоеннослужащим");
	Объекты.Добавить("Документ.ОтпускВоеннослужащего");
	Объекты.Добавить("Документ.ОтпускаВоеннослужащих");
	Объекты.Добавить("Документ.ОтпускПоБеременностиИРодамВоеннослужащего");
	Объекты.Добавить("Документ.ОтпускПоУходуЗаРебенкомВоеннослужащего");
	Объекты.Добавить("Документ.СохраняемоеДенежноеДовольствие");
	Объекты.Добавить("РегистрСведений.ДатыУдовлетворенияДенежнымДовольствием");
	Объекты.Добавить("РегистрСведений.СведенияОКонтрактахВоеннослужащих");
	Объекты.Добавить("Справочник.ВозвратИзОтпускаПоУходуЗаРебенкомВоеннослужащегоПрисоединенныеФайлы");
	Объекты.Добавить("Справочник.ВосстановлениеВДолжностиВоеннослужащегоПрисоединенныеФайлы");
	Объекты.Добавить("Справочник.ЗачислениеВСпискиЧастиПрисоединенныеФайлы");
	Объекты.Добавить("Справочник.ЗачислениеВСпискиЧастиСпискомПрисоединенныеФайлы");
	Объекты.Добавить("Справочник.ИзменениеУсловийОплатыОтпускаПоУходуЗаРебенкомВоеннослужащегоПрисоединенныеФайлы");
	Объекты.Добавить("Справочник.ИсключениеИзСписковЧастиПрисоединенныеФайлы");
	Объекты.Добавить("Справочник.ИсключениеИзСписковЧастиСпискомПрисоединенныеФайлы");
	Объекты.Добавить("Справочник.КадровыйПереводВоеннослужащегоПрисоединенныеФайлы");
	Объекты.Добавить("Справочник.КадровыйПереводВоеннослужащегоСпискомПрисоединенныеФайлы");
	Объекты.Добавить("Справочник.ОплатаСверхурочныхВоеннослужащимПрисоединенныеФайлы");
	Объекты.Добавить("Справочник.ОтпускВоеннослужащегоПрисоединенныеФайлы");
	Объекты.Добавить("Справочник.ОтпускаВоеннослужащихПрисоединенныеФайлы");
	Объекты.Добавить("Справочник.ОтпускПоБеременностиИРодамВоеннослужащегоПрисоединенныеФайлы");
	Объекты.Добавить("Справочник.ОтпускПоУходуЗаРебенкомВоеннослужащегоПрисоединенныеФайлы");
	Объекты.Добавить("Справочник.СохраняемоеДенежноеДовольствиеПрисоединенныеФайлы");
	// Конец ЗарплатаКадрыПриложения.ГосударственнаяСлужба.КадровыйУчетВоеннослужащих
	
	// ЗарплатаКадрыПриложения.ГосударственнаяСлужба.КлассныеЧиныРанги
	Объекты.Добавить("Документ.ПрисвоениеКлассногоЧинаРанга");
	Объекты.Добавить("Документ.ПрисвоениеКлассногоЧинаРангаСписком");
	Объекты.Добавить("Документ.УтверждениеОкладовНадбавокЗаКлассныеЧины");
	Объекты.Добавить("РегистрСведений.КлассныеЧиныРангиФизическихЛиц");
	Объекты.Добавить("РегистрСведений.ОкладыНадбавкиПоКласснымЧинамРангам");
	Объекты.Добавить("Справочник.КлассныеЧиныРанги");
	Объекты.Добавить("Справочник.ПрисвоениеКлассногоЧинаРангаПрисоединенныеФайлы");
	Объекты.Добавить("Справочник.ПрисвоениеКлассногоЧинаРангаСпискомПрисоединенныеФайлы");
	Объекты.Добавить("Справочник.УтверждениеОкладовНадбавокЗаКлассныеЧиныПрисоединенныеФайлы");
	// Конец ЗарплатаКадрыПриложения.ГосударственнаяСлужба.КлассныеЧиныРанги
	
	// ЗарплатаКадрыПриложения.ГосударственнаяСлужба.РасчетДенежногоДовольствия
	Объекты.Добавить("РегистрСведений.ЗначенияПоказателейДоплатыЗаРаботуВНочноеВечернееВремяВоеннослужащих");
	Объекты.Добавить("РегистрСведений.КоэффициентыИндексацииДенежногоДовольствия");
	Объекты.Добавить("РегистрСведений.ПерерасчетДенежногоДовольствия");
	Объекты.Добавить("РегистрСведений.СреднемесячноеКоличествоДнейВоеннослужащих");
	// Конец ЗарплатаКадрыПриложения.ГосударственнаяСлужба.РасчетДенежногоДовольствия
	
	// ЗарплатаКадрыПриложения.ГосударственнаяСлужба.РасчетДенежногоСодержания
	Объекты.Добавить("РегистрНакопления.СоставСохраняемогоДенежногоСодержания");
	Объекты.Добавить("РегистрСведений.СведенияОНачисленияхДляРасчетаСохраняемогоДенежногоСодержания");
	Объекты.Добавить("РегистрСведений.СреднемесячноеКоличествоДнейДляОплатыОтпусковГосслужащих");
	Объекты.Добавить("РегистрСведений.КоэффициентыИндексацииДенежногоСодержания");
	Объекты.Добавить("РегистрСведений.КоэффициентыИндексацииДенежногоСодержанияИспр");
	// Конец ЗарплатаКадрыПриложения.ГосударственнаяСлужба.РасчетДенежногоСодержания
	
	// ЗарплатаКадрыПриложения.Дивиденды
	Объекты.Добавить("Документ.ДивидендыФизическимЛицам");
	Объекты.Добавить("Справочник.ДивидендыФизическимЛицамПрисоединенныеФайлы");
	// Конец ЗарплатаКадрыПриложения.Дивиденды
	
	// ЗарплатаКадрыПриложения.КонфигурацииЗарплатаКадрыРасширенная
	Объекты.Добавить("Справочник.ОрганизацииПрисоединенныеФайлы");
	// Конец ЗарплатаКадрыПриложения.КонфигурацииЗарплатаКадрыРасширенная
	
	// ЗарплатаКадрыПриложения.КонфигурацииЗарплатаКадрыРасширенная.ОтражениеРасчетовЗарплатыВБухучете
	Объекты.Добавить("РегистрНакопления.ОтражениеВБухучетеВыплатаОтпусковЗаСчетРезерва");
	Объекты.Добавить("РегистрНакопления.ОтражениеВБухучетеНачисленнаяЗарплатаИВзносы");
	Объекты.Добавить("РегистрНакопления.ОтражениеВБухучетеНачисленныйНДФЛ");
	Объекты.Добавить("РегистрНакопления.ОтражениеВБухучетеУдержаннаяЗарплата");
	// Конец ЗарплатаКадрыПриложения.КонфигурацииЗарплатаКадрыРасширенная.ОтражениеРасчетовЗарплатыВБухучете
	
	// ЗарплатаКадрыПриложения.Медицина
	Объекты.Добавить("РегистрСведений.СвойстваДолжностейМедицинскихРаботников");
	// Конец ЗарплатаКадрыПриложения.Медицина
	
	// ЗарплатаКадрыПриложения.Медицина.ДоступКНаркотическимСредствам
	Объекты.Добавить("Документ.ДопускКНаркотическимВеществам");
	Объекты.Добавить("Документ.ЗапросВФСКН");
	Объекты.Добавить("Документ.ОтветФСКН");
	Объекты.Добавить("РегистрСведений.ДопускиСотрудников");
	Объекты.Добавить("РегистрСведений.СостоянияЗапросовВФСКН");
	Объекты.Добавить("Справочник.ВидыДопусков");
	Объекты.Добавить("Справочник.ДопускКНаркотическимВеществамПрисоединенныеФайлы");
	Объекты.Добавить("Справочник.ЗапросВФСКНПрисоединенныеФайлы");
	Объекты.Добавить("Справочник.ОрганыФСКН");
	Объекты.Добавить("Справочник.ОтветФСКНПрисоединенныеФайлы");
	// Конец ЗарплатаКадрыПриложения.Медицина.ДоступКНаркотическимСредствам
	
	// ЗарплатаКадрыПриложения.Медицина.СертификатыПоСпециальностиФизическихЛиц
	Объекты.Добавить("РегистрСведений.СертификатыПоСпециальностиФизическихЛиц");
	// Конец ЗарплатаКадрыПриложения.Медицина.СертификатыПоСпециальностиФизическихЛиц
	
	// ЗарплатаКадрыПриложения.Медицина.ТарификационнаяОтчетностьУчрежденийФМБА
	Объекты.Добавить("РегистрСведений.НастройкаПоказателейТарификацииМедРаботников");
	Объекты.Добавить("РегистрСведений.ТарификационныеГруппыДолжностейМедРаботников");
	Объекты.Добавить("Справочник.ТарификационныеГруппыМедРаботников");
	// Конец ЗарплатаКадрыПриложения.Медицина.ТарификационнаяОтчетностьУчрежденийФМБА
	
	// ЗарплатаКадрыПриложения.Медицина.ФедеральныйРегистрМедицинскихРаботников
	Объекты.Добавить("Документ.СведенияОРаботникахДляМедРегистра");
	Объекты.Добавить("Документ.СведенияОШтатномРасписанииДляМедРегистра");
	Объекты.Добавить("РегистрСведений.СведенияОбОрганизацииДляМедРегистра");
	Объекты.Добавить("РегистрСведений.ХарактеристикиКадровыхСобытийПоМедРегистру");
	Объекты.Добавить("РегистрСведений.ХарактеристикиОбъектовПоМедРегистру");
	Объекты.Добавить("Справочник.КлассификаторыМедРегистра");
	Объекты.Добавить("Справочник.СведенияОРаботникахДляМедРегистраПрисоединенныеФайлы");
	Объекты.Добавить("Справочник.СведенияОШтатномРасписанииДляМедРегистраПрисоединенныеФайлы");
	Объекты.Добавить("Справочник.ЭлементыКлассификаторовМедРегистра");
	// Конец ЗарплатаКадрыПриложения.Медицина.ФедеральныйРегистрМедицинскихРаботников
	
	// ЗарплатаКадрыПриложения.ОбразовательныеУчреждения
	Объекты.Добавить("Документ.РаспределениеНагрузки");
	Объекты.Добавить("Константа.РаботаВОбразовательномУчреждении");
	Объекты.Добавить("РегистрСведений.НачисленияРаспределенияНагрузки");
	Объекты.Добавить("РегистрСведений.СвойстваДолжностейПедагогическихРаботников");
	Объекты.Добавить("Справочник.РаспределениеНагрузкиПрисоединенныеФайлы");
	// Конец ЗарплатаКадрыПриложения.ОбразовательныеУчреждения
	
	// ЗарплатаКадрыПриложения.ОбразовательныеУчреждения.РасчетОкладовПреподавателей
	Объекты.Добавить("Документ.ДанныеДляРасчетаТарификацийПреподавателей");
	Объекты.Добавить("Документ.ТарификацияПреподавателей");
	Объекты.Добавить("ПланВидовХарактеристик.ХарактеристикиПараметровРасчетаТарифныхСтавокПреподавателей");
	Объекты.Добавить("РегистрСведений.БухучетСЧТС");
	Объекты.Добавить("РегистрСведений.ЗначенияПараметровРасчетаПриУчебныхПланах");
	Объекты.Добавить("РегистрСведений.ЗначенияПараметровРасчетаТарифныхСтавокПреподавателей");
	Объекты.Добавить("РегистрСведений.ЗначенияСоставныхЧастейТарифныхСтавокПреподавателей");
	Объекты.Добавить("РегистрСведений.НагрузкаПреподавателейПоТарификациям");
	Объекты.Добавить("Справочник.ВидыУчебныхПланов");
	Объекты.Добавить("Справочник.ДанныеДляРасчетаТарификацийПреподавателейПрисоединенныеФайлы");
	Объекты.Добавить("Справочник.ПараметрыРасчетаТарифныхСтавокПреподавателей");
	Объекты.Добавить("Справочник.СоставныеЧастиТарифныхСтавокПреподавателей");
	Объекты.Добавить("Справочник.СтрокиУчебныхПланов");
	Объекты.Добавить("Справочник.СтупениОбучения");
	Объекты.Добавить("Справочник.ТарификацияПреподавателейПрисоединенныеФайлы");
	Объекты.Добавить("Справочник.УчебныеГруппы");
	Объекты.Добавить("Справочник.УчебныеПланы");
	Объекты.Добавить("Справочник.УчебныеПредметы");
	Объекты.Добавить("Документ.ОплатаПроведенныхУчебныхЗанятий");
	Объекты.Добавить("РегистрСведений.БухучетПоказателейТарифныхСтавокПреподавателей");
	Объекты.Добавить("РегистрСведений.ЗначенияСоставныхЧастейОплатыПреподавателей");
	Объекты.Добавить("Справочник.ОплатаПроведенныхУчебныхЗанятийПрисоединенныеФайлы");
	// Конец ЗарплатаКадрыПриложения.ОбразовательныеУчреждения.РасчетОкладовПреподавателей
	
	// ЗарплатаКадрыПриложения.ОперацииРасчетаЗарплаты
	Объекты.Добавить("РегистрСведений.ОперацииРасчетаЗарплаты");
	Объекты.Добавить("Справочник.ВидыОперацийРасчетаЗарплаты");
	// Конец ЗарплатаКадрыПриложения.ОперацииРасчетаЗарплаты
	
	// ЗарплатаКадрыПриложения.ОтложенноеПроведениеДокументов
	Объекты.Добавить("РегистрСведений.НастройкиОтраженияДокументовВУчетеСтраховыхВзносов");
	Объекты.Добавить("РегистрСведений.ОтражениеДокументовВУчетеСтраховыхВзносов");
	// Конец ЗарплатаКадрыПриложения.ОтложенноеПроведениеДокументов
	
	// ЗарплатаКадрыПриложения.ОтражениеВФинансовомУчете
	Объекты.Добавить("Документ.ОтражениеЗарплатыВФинансовомУчете");
	// Конец ЗарплатаКадрыПриложения.ОтражениеВФинансовомУчете
	
	// ЗарплатаКадрыПриложения.ОценочныеОбязательстваЗарплатаКадры
	Объекты.Добавить("Документ.НачислениеОценочныхОбязательствПоОтпускам");
	Объекты.Добавить("РегистрНакопления.ОценочныеОбязательства");
	Объекты.Добавить("РегистрНакопления.ОценочныеОбязательстваПоСотрудникам");
	Объекты.Добавить("РегистрСведений.ЗарплатаКадрыДолиСписанияКосвенныхРасходов");
	Объекты.Добавить("РегистрСведений.НастройкиРасчетаРезервовОтпусков");
	Объекты.Добавить("РегистрСведений.РасчетРезерваОтпусков");
	Объекты.Добавить("Справочник.НачислениеОценочныхОбязательствПоОтпускамПрисоединенныеФайлы");
	// Конец ЗарплатаКадрыПриложения.ОценочныеОбязательстваЗарплатаКадры
	
	// ЗарплатаКадрыПриложения.ПереносДанных
	Объекты.Добавить("Документ.ПереносДанных");
	Объекты.Добавить("Справочник.ПереносДанныхПрисоединенныеФайлы");
	// Конец ЗарплатаКадрыПриложения.ПереносДанных
	
	// ЗарплатаКадрыПриложения.ПлановыеПрочиеДоходы
	Объекты.Добавить("Документ.ПлановоеНачислениеПрочихДоходов");
	Объекты.Добавить("РегистрСведений.НастройкиПлановыхПрочихДоходов");
	Объекты.Добавить("РегистрСведений.ПлановыеПрочиеДоходы");
	Объекты.Добавить("Справочник.ПлановоеНачислениеПрочихДоходовПрисоединенныеФайлы");
	// Конец ЗарплатаКадрыПриложения.ПлановыеПрочиеДоходы
	
	// ЗарплатаКадрыПриложения.Подработки
	Объекты.Добавить("Документ.НазначениеПодработки");
	Объекты.Добавить("Документ.ПрекращениеПодработки");
	Объекты.Добавить("Справочник.НазначениеПодработкиПрисоединенныеФайлы");
	Объекты.Добавить("Справочник.ПрекращениеПодработкиПрисоединенныеФайлы");
	// Конец ЗарплатаКадрыПриложения.Подработки
	
	// ЗарплатаКадрыПриложения.ПодразделенияОрганизаций
	Объекты.Добавить("Справочник.ПодразделенияОрганизаций");
	// Конец ЗарплатаКадрыПриложения.ПодразделенияОрганизаций
	
	// ЗарплатаКадрыПриложения.РасчетыСБюджетомПоНДФЛ
	Объекты.Добавить("Документ.НачальныеРасчетыСБюджетомПоНДФЛ");
	Объекты.Добавить("РегистрНакопления.РасчетыСБюджетомПоНДФЛ");
	Объекты.Добавить("Справочник.НачальныеРасчетыСБюджетомПоНДФЛПрисоединенныеФайлы");
	// Конец ЗарплатаКадрыПриложения.РасчетыСБюджетомПоНДФЛ
	
	// ЗарплатаКадрыПриложения.РегламентированнаяОтчетностьЗаполнение
	Объекты.Добавить("Документ.СправкиПоНДФЛДляРасчетаПоНалогуНаПрибыль");
	Объекты.Добавить("Справочник.СправкиПоНДФЛДляРасчетаПоНалогуНаПрибыльПрисоединенныеФайлы");
	// Конец ЗарплатаКадрыПриложения.РегламентированнаяОтчетностьЗаполнение
	
	// ЗарплатаКадрыПриложения.РуководителиПодразделений
	Объекты.Добавить("РегистрСведений.ПозицииРуководителейПодразделений");
	// Конец ЗарплатаКадрыПриложения.РуководителиПодразделений
	
	// ЗарплатаКадрыПриложения.СведенияОбОтветственныхЛицах
	Объекты.Добавить("РегистрСведений.СведенияОбОтветственныхЛицах");
	// Конец ЗарплатаКадрыПриложения.СведенияОбОтветственныхЛицах
	
	// ЗарплатаКадрыПриложения.УчетБюджетныхУчреждений
	Объекты.Добавить("Документ.ОтражениеЗарплатыВБухучетеБюджетныхУчреждений");
	Объекты.Добавить("РегистрСведений.НастройкиБюджетныхУчреждений");
	Объекты.Добавить("РегистрСведений.СвойстваСтатейФинансированияУчетБюджетныхУчреждений");
	Объекты.Добавить("Справочник.ИсточникиФинансовогоОбеспечения");
	Объекты.Добавить("Справочник.ОтражениеЗарплатыВБухучетеБюджетныхУчрежденийПрисоединенныеФайлы");
	// Конец ЗарплатаКадрыПриложения.УчетБюджетныхУчреждений
	
	// ЗарплатаКадрыПриложения.УчетДепонированнойЗарплаты
	Объекты.Добавить("Документ.ДепонированиеЗарплаты");
	Объекты.Добавить("Документ.СписаниеДепонированнойЗарплаты");
	Объекты.Добавить("РегистрНакопления.ВзаиморасчетыСДепонентами");
	Объекты.Добавить("Справочник.ДепонированиеЗарплатыПрисоединенныеФайлы");
	Объекты.Добавить("Справочник.СписаниеДепонированнойЗарплатыПрисоединенныеФайлы");
	// Конец ЗарплатаКадрыПриложения.УчетДепонированнойЗарплаты
	
	// ЗарплатаКадрыРасширеннаяПодсистемы
	Объекты.Добавить("Константа.ВестиРасчетыСБюджетомПоНДФЛ");
	Объекты.Добавить("РегистрСведений.НастройкиЛьготСотрудников");
	Объекты.Добавить("РегистрСведений.ПодчиненностьПодразделенийОрганизаций");
	Объекты.Добавить("РегистрСведений.РолиФизическихЛиц");
	Объекты.Добавить("РегистрСведений.ТерриторииСотрудников");
	Объекты.Добавить("РегистрСведений.ТерриторииСотрудниковИспр");
	Объекты.Добавить("Справочник.ТерриторииВыполненияРабот");
	Объекты.Добавить("Справочник.УсловияТруда");
	// Конец ЗарплатаКадрыРасширеннаяПодсистемы
	
	// ЗарплатаКадрыРасширеннаяПодсистемы.Выплаты.ВзаиморасчетыПоПрочимДоходам
	Объекты.Добавить("Документ.ВедомостьПрочихДоходовВБанк");
	Объекты.Добавить("Документ.ВедомостьПрочихДоходовВКассу");
	Объекты.Добавить("Документ.ВедомостьПрочихДоходовПеречислением");
	Объекты.Добавить("РегистрНакопления.ВзаиморасчетыСКонтрагентамиАкционерами");
	Объекты.Добавить("РегистрСведений.НастройкиВзаиморасчетовПоПрочимДоходам");
	Объекты.Добавить("Справочник.ВедомостьПрочихДоходовВБанкПрисоединенныеФайлы");
	Объекты.Добавить("Справочник.ВедомостьПрочихДоходовВКассуПрисоединенныеФайлы");
	Объекты.Добавить("Справочник.ВедомостьПрочихДоходовПеречислениемПрисоединенныеФайлы");
	// Конец ЗарплатаКадрыРасширеннаяПодсистемы.Выплаты.ВзаиморасчетыПоПрочимДоходам
	
	// ЗарплатаКадрыРасширеннаяПодсистемы.Выплаты.ВзаиморасчетыССотрудникамиРасширенная
	Объекты.Добавить("Документ.ВедомостьНаВыплатуЗарплатыПеречислением");
	Объекты.Добавить("Документ.ВедомостьНаВыплатуЗарплатыРаздатчиком");
	Объекты.Добавить("Документ.НачальнаяЗадолженностьПоЗарплате");
	Объекты.Добавить("РегистрСведений.МестаВыплатыЗарплатыОрганизаций");
	Объекты.Добавить("РегистрСведений.МестаВыплатыЗарплатыПодразделений");
	Объекты.Добавить("РегистрСведений.МестаВыплатыЗарплатыСотрудников");
	Объекты.Добавить("РегистрСведений.НастройкиВзаиморасчетовССотрудниками");
	Объекты.Добавить("РегистрСведений.ПорядокВыплатыДокументов");
	Объекты.Добавить("Справочник.ВедомостьНаВыплатуЗарплатыПеречислениемПрисоединенныеФайлы");
	Объекты.Добавить("Справочник.ВедомостьНаВыплатуЗарплатыРаздатчикомПрисоединенныеФайлы");
	Объекты.Добавить("Справочник.НачальнаяЗадолженностьПоЗарплатеПрисоединенныеФайлы");
	// Конец ЗарплатаКадрыРасширеннаяПодсистемы.Выплаты.ВзаиморасчетыССотрудникамиРасширенная
	
	// ЗарплатаКадрыРасширеннаяПодсистемы.ДанныеДляРасчетаЗарплаты
	Объекты.Добавить("Документ.ДанныеДляРасчетаЗарплаты");
	Объекты.Добавить("РегистрСведений.БухучетРаботСотрудников");
	Объекты.Добавить("Справочник.ДанныеДляРасчетаЗарплатыПрисоединенныеФайлы");
	// Конец ЗарплатаКадрыРасширеннаяПодсистемы.ДанныеДляРасчетаЗарплаты
	
	// ЗарплатаКадрыРасширеннаяПодсистемы.ДоговорыГПХ
	Объекты.Добавить("Документ.АктПриемкиВыполненныхРаботОказанныхУслуг");
	Объекты.Добавить("Документ.ДоговорАвторскогоЗаказа");
	Объекты.Добавить("Документ.ДоговорРаботыУслуги");
	Объекты.Добавить("Документ.НачислениеПоДоговорам");
	Объекты.Добавить("Справочник.АктПриемкиВыполненныхРаботОказанныхУслугПрисоединенныеФайлы");
	Объекты.Добавить("Справочник.ВидыДоговоровАвторскогоЗаказа");
	Объекты.Добавить("Справочник.ДоговорАвторскогоЗаказаПрисоединенныеФайлы");
	Объекты.Добавить("Справочник.ДоговорРаботыУслугиПрисоединенныеФайлы");
	Объекты.Добавить("Справочник.НачислениеПоДоговорамПрисоединенныеФайлы");
	// Конец ЗарплатаКадрыРасширеннаяПодсистемы.ДоговорыГПХ
	
	// ЗарплатаКадрыРасширеннаяПодсистемы.ДоговорыГПХ.ВыплатыПоДоговорамОпеки
	Объекты.Добавить("Справочник.ВыплатыПоДоговорамОпекиПрисоединенныеФайлы");
	Объекты.Добавить("Справочник.ШаблоныВыплатПоДоговорамОпеки");
	Объекты.Добавить("Документ.ВыплатыПоДоговорамОпеки");
	Объекты.Добавить("РегистрСведений.НастройкиВыплатПоДоговорамОпеки");
	Объекты.Добавить("РегистрСведений.УсловияВыплатПоДоговоруОпеки");
	Объекты.Добавить("РегистрСведений.УсловияДоговораОпеки");
	// Конец ЗарплатаКадрыРасширеннаяПодсистемы.ДоговорыГПХ.ВыплатыПоДоговорамОпеки
	
	// ЗарплатаКадрыРасширеннаяПодсистемы.ЗаймыСотрудникам
	Объекты.Добавить("Документ.ДоговорЗаймаСотруднику");
	Объекты.Добавить("Документ.ИзменениеУсловийДоговораЗаймаСотруднику");
	Объекты.Добавить("РегистрНакопления.ВзаиморасчетыПоЗаймамСотрудникам");
	Объекты.Добавить("РегистрСведений.НастройкиЗаймовСотрудникам");
	Объекты.Добавить("РегистрСведений.ТраншиЗаймаСотруднику");
	Объекты.Добавить("РегистрСведений.УсловияДоговораЗаймаСотруднику");
	Объекты.Добавить("Справочник.ДоговорЗаймаСотрудникуПрисоединенныеФайлы");
	Объекты.Добавить("Справочник.ИзменениеУсловийДоговораЗаймаСотрудникуПрисоединенныеФайлы");
	// Конец ЗарплатаКадрыРасширеннаяПодсистемы.ЗаймыСотрудникам
	
	// ЗарплатаКадрыРасширеннаяПодсистемы.ИсправленияДокументов
	Объекты.Добавить("Документ.СторнированиеНачислений");
	Объекты.Добавить("Справочник.СторнированиеНачисленийПрисоединенныеФайлы");
	// Конец ЗарплатаКадрыРасширеннаяПодсистемы.ИсправленияДокументов
	
	// ЗарплатаКадрыРасширеннаяПодсистемы.КадровыйУчетДокументы
	Объекты.Добавить("Документ.ВосстановлениеВДолжности");
	Объекты.Добавить("Документ.ИзменениеГрафикаРаботыСписком");
	Объекты.Добавить("Документ.ИзменениеМестРаботы");
	Объекты.Добавить("Документ.НачальнаяШтатнаяРасстановка");
	Объекты.Добавить("Справочник.ВосстановлениеВДолжностиПрисоединенныеФайлы");
	Объекты.Добавить("Справочник.ИзменениеГрафикаРаботыСпискомПрисоединенныеФайлы");
	Объекты.Добавить("Справочник.ИзменениеМестРаботыПрисоединенныеФайлы");
	Объекты.Добавить("Справочник.НачальнаяШтатнаяРасстановкаПрисоединенныеФайлы");
	// Конец ЗарплатаКадрыРасширеннаяПодсистемы.КадровыйУчетДокументы
	
	// ЗарплатаКадрыРасширеннаяПодсистемы.КадровыйУчетРасширенная
	Объекты.Добавить("Документ.КадровыйПеревод");
	Объекты.Добавить("Документ.КадровыйПереводСписком");
	Объекты.Добавить("Документ.ПереводКДругомуРаботодателю");
	Объекты.Добавить("Документ.ПереводНаРаботуСКоронавирусом");
	Объекты.Добавить("Документ.ПеремещениеВДругоеПодразделение");
	Объекты.Добавить("Документ.ПеремещениеМеждуТерриториями");
	Объекты.Добавить("Документ.ПриемНаРаботу");
	Объекты.Добавить("Документ.ПриемНаРаботуСписком");
	Объекты.Добавить("Документ.Увольнение");
	Объекты.Добавить("Документ.УвольнениеСписком");
	Объекты.Добавить("РегистрСведений.ВидыЗанятостиСотрудниковИспр");
	Объекты.Добавить("РегистрСведений.ВидыСтажаТрудовойДеятельностиФизическихЛиц");
	Объекты.Добавить("РегистрСведений.ГрафикРаботыСотрудников");
	Объекты.Добавить("РегистрСведений.ГрафикРаботыСотрудниковИспр");
	Объекты.Добавить("РегистрСведений.ДанныеОбОплатеТрудаДляПодбораСотрудников");
	Объекты.Добавить("РегистрСведений.ЗнаниеЯзыковФизическихЛиц");
	Объекты.Добавить("РегистрСведений.КадроваяИсторияСотрудниковИспр");
	Объекты.Добавить("РегистрСведений.НаградыФизическихЛиц");
	Объекты.Добавить("РегистрСведений.ПлановыеЕжегодныеОтпуска");
	Объекты.Добавить("РегистрСведений.ПрофессииФизическихЛиц");
	Объекты.Добавить("РегистрСведений.РеестрКадровыхПриказов");
	Объекты.Добавить("РегистрСведений.РеестрКадровыхПриказовИспр");
	Объекты.Добавить("РегистрСведений.РеестрОтпусков");
	Объекты.Добавить("РегистрСведений.СостоянияВБракеФизическихЛиц");
	Объекты.Добавить("РегистрСведений.СпециальностиФизическихЛиц");
	Объекты.Добавить("РегистрСведений.СтажиФизическихЛиц");
	Объекты.Добавить("РегистрСведений.ТрудоваяДеятельностьФизическихЛиц");
	Объекты.Добавить("РегистрСведений.УченыеЗванияФизическихЛиц");
	Объекты.Добавить("РегистрСведений.УченыеСтепениФизическихЛиц");
	Объекты.Добавить("РегистрСведений.ФотографииФизическихЛиц");
	Объекты.Добавить("Справочник.ВидыДокументовОбОбразовании");
	Объекты.Добавить("Справочник.ВидыОбразованияФизическихЛиц");
	Объекты.Добавить("Справочник.ВидыСправок");
	Объекты.Добавить("Справочник.ВидыСтажа");
	Объекты.Добавить("Справочник.КадровыйПереводПрисоединенныеФайлы");
	Объекты.Добавить("Справочник.КадровыйПереводСпискомПрисоединенныеФайлы");
	Объекты.Добавить("Справочник.КлассификаторСпециальностейПоОбразованию");
	Объекты.Добавить("Справочник.Награды");
	Объекты.Добавить("Справочник.ОбразованиеФизическихЛиц");
	Объекты.Добавить("Справочник.ОснованияЗаключенияСрочныхТрудовыхДоговоров");
	Объекты.Добавить("Справочник.ОтраслиНауки");
	Объекты.Добавить("Справочник.ПереводКДругомуРаботодателюПрисоединенныеФайлы");
	Объекты.Добавить("Справочник.ПереводНаРаботуСКоронавирусомПрисоединенныеФайлы");
	Объекты.Добавить("Справочник.ПеремещениеВДругоеПодразделениеПрисоединенныеФайлы");
	Объекты.Добавить("Справочник.ПриемНаРаботуПрисоединенныеФайлы");
	Объекты.Добавить("Справочник.ПриемНаРаботуСпискомПрисоединенныеФайлы");
	Объекты.Добавить("Справочник.ПрофессииРабочих");
	Объекты.Добавить("Справочник.РодственникиФизическихЛиц");
	Объекты.Добавить("Справочник.СостояниеВБраке");
	Объекты.Добавить("Справочник.СправкиФизическихЛиц");
	Объекты.Добавить("Справочник.СправкиФизическихЛицПрисоединенныеФайлы");
	Объекты.Добавить("Справочник.СтепениЗнанияЯзыка");
	Объекты.Добавить("Справочник.СтепениРодстваФизическихЛиц");
	Объекты.Добавить("Справочник.УвольнениеПрисоединенныеФайлы");
	Объекты.Добавить("Справочник.УвольнениеСпискомПрисоединенныеФайлы");
	Объекты.Добавить("Справочник.УчебныеЗаведения");
	Объекты.Добавить("Справочник.УченыеЗвания");
	Объекты.Добавить("Справочник.УченыеСтепени");
	Объекты.Добавить("Справочник.ЯзыкиНародовМира");
	Объекты.Добавить("Справочник.ПеремещениеМеждуТерриториямиПрисоединенныеФайлы");
	// Конец ЗарплатаКадрыРасширеннаяПодсистемы.КадровыйУчетРасширенная
	
	// ЗарплатаКадрыРасширеннаяПодсистемы.КадровыйУчетРасширенная.ВоинскийУчет
	Объекты.Добавить("Документ.БронированиеГражданПребывающихВЗапасе");
	Объекты.Добавить("Документ.ЛистокСообщенияДляВоенкомата");
	Объекты.Добавить("Документ.ОтменаБронированияГражданПребывающихВЗапасе");
	Объекты.Добавить("Документ.ХодатайствоОБронированииГражданПребывающихВЗапасе");
	Объекты.Добавить("РегистрСведений.БронированиеСотрудников");
	Объекты.Добавить("РегистрСведений.ВоинскийУчет");
	Объекты.Добавить("РегистрСведений.ИзменениеСведенийФизическихЛиц");
	Объекты.Добавить("РегистрСведений.НастройкиВоинскогоУчета");
	Объекты.Добавить("РегистрСведений.ПотребностьВСпециалистахНаПериодМобилизации");
	Объекты.Добавить("Справочник.Военкоматы");
	Объекты.Добавить("Справочник.ЗванияГражданскогоВоинскогоУчета");
	Объекты.Добавить("Справочник.ПереченьДолжностейДляБронированияГраждан");
	Объекты.Добавить("Справочник.СоставыВоеннослужащих");
	Объекты.Добавить("Справочник.БронированиеГражданПребывающихВЗапасеПрисоединенныеФайлы");
	Объекты.Добавить("Справочник.ЛистокСообщенияДляВоенкоматаПрисоединенныеФайлы");
	Объекты.Добавить("Справочник.ОтменаБронированияГражданПребывающихВЗапасеПрисоединенныеФайлы");
	Объекты.Добавить("Справочник.ХодатайствоОБронированииГражданПребывающихВЗапасеПрисоединенныеФайлы");
	// Конец ЗарплатаКадрыРасширеннаяПодсистемы.КадровыйУчетРасширенная.ВоинскийУчет
	
	// ЗарплатаКадрыРасширеннаяПодсистемы.КадровыйУчетРасширенная.ГруппыСотрудников
	Объекты.Добавить("РегистрСведений.СоставГруппСотрудников");
	Объекты.Добавить("Справочник.ГруппыСотрудников");
	// Конец ЗарплатаКадрыРасширеннаяПодсистемы.КадровыйУчетРасширенная.ГруппыСотрудников
	
	// ЗарплатаКадрыРасширеннаяПодсистемы.КадровыйУчетРасширенная.КонтрактыДоговорыСотрудников
	Объекты.Добавить("Документ.ПродлениеКонтрактаДоговора");
	Объекты.Добавить("РегистрСведений.ОсновныеДанныеКонтрактаДоговораСотрудника");
	Объекты.Добавить("РегистрСведений.ОсновныеДанныеКонтрактаДоговораСотрудникаИспр");
	Объекты.Добавить("РегистрСведений.СведенияКонтрактаДоговораСотрудника");
	Объекты.Добавить("РегистрСведений.СведенияКонтрактаДоговораСотрудникаИспр");
	Объекты.Добавить("Справочник.ПродлениеКонтрактаДоговораПрисоединенныеФайлы");
	// Конец ЗарплатаКадрыРасширеннаяПодсистемы.КадровыйУчетРасширенная.КонтрактыДоговорыСотрудников
	
	// ЗарплатаКадрыРасширеннаяПодсистемы.КадровыйУчетРасширенная.СостоянияСотрудников
	Объекты.Добавить("РегистрСведений.ДанныеСостоянийСотрудников");
	Объекты.Добавить("РегистрСведений.ДанныеСостоянийСотрудниковИспр");
	Объекты.Добавить("РегистрСведений.СостоянияСотрудников");
	// Конец ЗарплатаКадрыРасширеннаяПодсистемы.КадровыйУчетРасширенная.СостоянияСотрудников
	
	// ЗарплатаКадрыРасширеннаяПодсистемы.НастройкаАдминистрирование
	Объекты.Добавить("РегистрСведений.НастройкиЗарплатаКадрыРасширенная");
	// Конец ЗарплатаКадрыРасширеннаяПодсистемы.НастройкаАдминистрирование
	
	// ЗарплатаКадрыРасширеннаяПодсистемы.НатуральныеДоходы
	Объекты.Добавить("Документ.ДоходВНатуральнойФорме");
	Объекты.Добавить("Документ.ПризПодарок");
	Объекты.Добавить("Справочник.ПризПодарокПрисоединенныеФайлы");
	Объекты.Добавить("Справочник.ДоходВНатуральнойФормеПрисоединенныеФайлы");
	// Конец ЗарплатаКадрыРасширеннаяПодсистемы.НатуральныеДоходы
	
	// ЗарплатаКадрыРасширеннаяПодсистемы.НачислениеЗарплатыДокументы
	Объекты.Добавить("Документ.НачислениеЗаПервуюПоловинуМесяца");
	Объекты.Добавить("Документ.НачислениеЗарплаты");
	Объекты.Добавить("Документ.ПериодыОплаченныеДоНачалаЭксплуатации");
	Объекты.Добавить("Справочник.НачислениеЗаПервуюПоловинуМесяцаПрисоединенныеФайлы");
	Объекты.Добавить("Справочник.НачислениеЗарплатыПрисоединенныеФайлы");
	Объекты.Добавить("Справочник.ПериодыОплаченныеДоНачалаЭксплуатацииПрисоединенныеФайлы");
	// Конец ЗарплатаКадрыРасширеннаяПодсистемы.НачислениеЗарплатыДокументы
	
	// ЗарплатаКадрыРасширеннаяПодсистемы.НачисленияДокументы
	Объекты.Добавить("Документ.Командировка");
	Объекты.Добавить("Документ.КомандировкиСотрудников");
	Объекты.Добавить("Документ.КомпенсацияЗаЗадержкуЗарплаты");
	Объекты.Добавить("Документ.МатериальнаяПомощь");
	Объекты.Добавить("Документ.ОплатаПоСреднемуЗаработку");
	Объекты.Добавить("Документ.Премия");
	Объекты.Добавить("Документ.ПрогулНеявка");
	Объекты.Добавить("Документ.ПрогулНеявкаСписком");
	Объекты.Добавить("Документ.ПростойСотрудников");
	Объекты.Добавить("Документ.РазовоеНачисление");
	Объекты.Добавить("Справочник.КомандировкаПрисоединенныеФайлы");
	Объекты.Добавить("Справочник.КомандировкиСотрудниковПрисоединенныеФайлы");
	Объекты.Добавить("Справочник.КомпенсацияЗаЗадержкуЗарплатыПрисоединенныеФайлы");
	Объекты.Добавить("Справочник.МатериальнаяПомощьПрисоединенныеФайлы");
	Объекты.Добавить("Справочник.ОплатаПоСреднемуЗаработкуПрисоединенныеФайлы");
	Объекты.Добавить("Справочник.ПремияПрисоединенныеФайлы");
	Объекты.Добавить("Справочник.ПрогулНеявкаПрисоединенныеФайлы");
	Объекты.Добавить("Справочник.ПрогулНеявкаСпискомПрисоединенныеФайлы");
	Объекты.Добавить("Справочник.ПростойСотрудниковПрисоединенныеФайлы");
	Объекты.Добавить("Справочник.РазовоеНачислениеПрисоединенныеФайлы");
	Объекты.Добавить("Справочник.ОплатаПоСреднемуЗаработкуСпискомПрисоединенныеФайлы");
	Объекты.Добавить("Документ.ОплатаПоСреднемуЗаработкуСписком");
	// Конец ЗарплатаКадрыРасширеннаяПодсистемы.НачисленияДокументы
	
	// ЗарплатаКадрыРасширеннаяПодсистемы.ОграничениеИспользованияДокументов
	Объекты.Добавить("РегистрСведений.ОграниченныеДокументы");
	// Конец ЗарплатаКадрыРасширеннаяПодсистемы.ОграничениеИспользованияДокументов
	
	// ЗарплатаКадрыРасширеннаяПодсистемы.ОстаткиОтпусков
	Объекты.Добавить("Документ.ВводНачальныхОстатковОтпусков");
	Объекты.Добавить("РегистрНакопления.ФактическиеОтпуска");
	Объекты.Добавить("РегистрСведений.ДанныеОтпусковКарточкиСотрудника");
	Объекты.Добавить("РегистрСведений.ЗаработанныеПраваНаОтпуска");
	Объекты.Добавить("РегистрСведений.НачальныеОстаткиОтпусков");
	Объекты.Добавить("РегистрСведений.ОтсутствияСдвигающиеРабочийГод");
	Объекты.Добавить("РегистрСведений.ПериодыОтпусков");
	Объекты.Добавить("РегистрСведений.ПериодыОтпусковИспр");
	Объекты.Добавить("РегистрСведений.ПоложенныеВидыЕжегодныхОтпусков");
	Объекты.Добавить("РегистрСведений.ПоложенныеВидыЕжегодныхОтпусковИспр");
	Объекты.Добавить("Справочник.ВводНачальныхОстатковОтпусковПрисоединенныеФайлы");
	// Конец ЗарплатаКадрыРасширеннаяПодсистемы.ОстаткиОтпусков
	
	// ЗарплатаКадрыРасширеннаяПодсистемы.Отпуска
	Объекты.Добавить("Документ.ГрафикОтпусков");
	Объекты.Добавить("Документ.Отгул");
	Объекты.Добавить("Документ.ОтгулСписком");
	Объекты.Добавить("Документ.Отпуск");
	Объекты.Добавить("Документ.ОтпускаСотрудников");
	Объекты.Добавить("Документ.ОтпускБезСохраненияОплаты");
	Объекты.Добавить("Документ.ОтпускБезСохраненияОплатыСписком");
	Объекты.Добавить("Документ.ПереносОтпуска");
	Объекты.Добавить("Справочник.ОтпускБезСохраненияОплатыПрисоединенныеФайлы");
	Объекты.Добавить("Справочник.ОтпускБезСохраненияОплатыСпискомПрисоединенныеФайлы");
	Объекты.Добавить("Справочник.ОтпускПрисоединенныеФайлы");
	Объекты.Добавить("Справочник.ПереносОтпускаПрисоединенныеФайлы");
	Объекты.Добавить("Справочник.ГрафикОтпусковПрисоединенныеФайлы");
	Объекты.Добавить("Справочник.ОтгулПрисоединенныеФайлы");
	Объекты.Добавить("Справочник.ОтгулСпискомПрисоединенныеФайлы");
	Объекты.Добавить("Справочник.ОтпускаСотрудниковПрисоединенныеФайлы");
	// Конец ЗарплатаКадрыРасширеннаяПодсистемы.Отпуска
	
	// ЗарплатаКадрыРасширеннаяПодсистемы.ОтражениеЗарплатыВБухгалтерскомУчетеРасширенная
	Объекты.Добавить("Документ.БухучетНачисленийСотрудников");
	Объекты.Добавить("Документ.ПереносЗатратНаПерсоналМеждуСтатьями");
	Объекты.Добавить("Документ.РаспределениеОсновногоЗаработка");
	Объекты.Добавить("РегистрНакопления.БухучетНачисленияУдержанияПоКонтрагентамАкционерам");
	Объекты.Добавить("РегистрНакопления.БухучетНачисленияУдержанияПоСотрудникам");
	Объекты.Добавить("РегистрНакопления.БухучетНачисленияУдержанияПоСотрудникамАвансом");
	Объекты.Добавить("РегистрСведений.БухучетЗарплатыПервичныхДокументов");
	Объекты.Добавить("РегистрСведений.БухучетЗарплатыПодразделений");
	Объекты.Добавить("РегистрСведений.БухучетЗарплатыСотрудниковИсправления");
	Объекты.Добавить("РегистрСведений.БухучетЗарплатыТерриторийВыполненияРабот");
	Объекты.Добавить("РегистрСведений.БухучетПлановыхНачислений");
	Объекты.Добавить("РегистрСведений.БухучетПлановыхУдержаний");
	Объекты.Добавить("РегистрСведений.БухучетРаспределениеОсновногоЗаработка");
	Объекты.Добавить("РегистрСведений.КоэффициентыРаспределенияСреднегоЗаработка");
	Объекты.Добавить("Справочник.БухучетНачисленийСотрудниковПрисоединенныеФайлы");
	Объекты.Добавить("Справочник.ПереносЗатратНаПерсоналМеждуСтатьямиПрисоединенныеФайлы");
	Объекты.Добавить("Справочник.РаспределениеОсновногоЗаработкаПрисоединенныеФайлы");
	Объекты.Добавить("РегистрСведений.БухучетРабочегоВремениСотрудников");
	Объекты.Добавить("РегистрСведений.СпособОтраженияДляЗаменыУстаревшейАналитикиВБухучете");
	Объекты.Добавить("РегистрСведений.СтатьяФинансированияДляЗаменыУстаревшейАналитикиВБухучете");
	// Конец ЗарплатаКадрыРасширеннаяПодсистемы.ОтражениеЗарплатыВБухгалтерскомУчетеРасширенная
	
	// ЗарплатаКадрыРасширеннаяПодсистемы.ПерерасчетЗарплаты
	Объекты.Добавить("РегистрСведений.ПерерасчетЗарплаты");
	Объекты.Добавить("РегистрСведений.ПерерасчетУдержаний");
	Объекты.Добавить("РегистрСведений.ПредварительныеПерерасчеты");
	// Конец ЗарплатаКадрыРасширеннаяПодсистемы.ПерерасчетЗарплаты
	
	// ЗарплатаКадрыРасширеннаяПодсистемы.ПерсонифицированныйУчетРасширенная.УчетСтажаПФР
	Объекты.Добавить("РегистрСведений.ЗаписиОСтажеДоНачалаЭксплуатации");
	Объекты.Добавить("РегистрСведений.НеобходимыеКорректировкиСтажаПФР");
	Объекты.Добавить("РегистрСведений.ПараметрыПериодовСтажаПФРИспр");
	// Конец ЗарплатаКадрыРасширеннаяПодсистемы.ПерсонифицированныйУчетРасширенная.УчетСтажаПФР
	
	// ЗарплатаКадрыРасширеннаяПодсистемы.ПлановыеНачисленияДокументы
	Объекты.Добавить("Документ.ВозвратИзОтпускаПоУходуЗаРебенком");
	Объекты.Добавить("Документ.ИзменениеАванса");
	Объекты.Добавить("Документ.ИзменениеОплатыТруда");
	Объекты.Добавить("Документ.ИзменениеПлановыхНачислений");
	Объекты.Добавить("Документ.ИзменениеУсловийОплатыОтпускаПоУходуЗаРебенком");
	Объекты.Добавить("Документ.ИндексацияЗаработка");
	Объекты.Добавить("Документ.НазначениеПлановогоНачисления");
	Объекты.Добавить("Документ.ОтменаДоплатыДоСреднегоЗаработка");
	Объекты.Добавить("Документ.ОтменаСовмещения");
	Объекты.Добавить("Документ.ОтпускПоУходуЗаРебенком");
	Объекты.Добавить("Документ.ПереводНаОплатуПоСреднемуЗаработку");
	Объекты.Добавить("Документ.ПрекращениеПлановогоНачисления");
	Объекты.Добавить("Документ.ПриказНаДоплатуДоСреднегоЗаработка");
	Объекты.Добавить("Документ.Совмещение");
	Объекты.Добавить("Справочник.ВозвратИзОтпускаПоУходуЗаРебенкомПрисоединенныеФайлы");
	Объекты.Добавить("Справочник.ИзменениеАвансаПрисоединенныеФайлы");
	Объекты.Добавить("Справочник.ИзменениеОплатыТрудаПрисоединенныеФайлы");
	Объекты.Добавить("Справочник.ИзменениеПлановыхНачисленийПрисоединенныеФайлы");
	Объекты.Добавить("Справочник.ИзменениеУсловийОплатыОтпускаПоУходуЗаРебенкомПрисоединенныеФайлы");
	Объекты.Добавить("Справочник.ИндексацияЗаработкаПрисоединенныеФайлы");
	Объекты.Добавить("Справочник.НазначениеПлановогоНачисленияПрисоединенныеФайлы");
	Объекты.Добавить("Справочник.ОтменаДоплатыДоСреднегоЗаработкаПрисоединенныеФайлы");
	Объекты.Добавить("Справочник.ОтменаСовмещенияПрисоединенныеФайлы");
	Объекты.Добавить("Справочник.ОтпускПоУходуЗаРебенкомПрисоединенныеФайлы");
	Объекты.Добавить("Справочник.ПереводНаОплатуПоСреднемуЗаработкуПрисоединенныеФайлы");
	Объекты.Добавить("Справочник.ПрекращениеПлановогоНачисленияПрисоединенныеФайлы");
	Объекты.Добавить("Справочник.ПриказНаДоплатуДоСреднегоЗаработкаПрисоединенныеФайлы");
	Объекты.Добавить("Справочник.СовмещениеПрисоединенныеФайлы");
	// Конец ЗарплатаКадрыРасширеннаяПодсистемы.ПлановыеНачисленияДокументы
	
	// ЗарплатаКадрыРасширеннаяПодсистемы.ПодключаемыеХарактеристики
	Объекты.Добавить("ПланВидовХарактеристик.ДолжностиПодключаемыеХарактеристики");
	Объекты.Добавить("ПланВидовХарактеристик.НачисленияПодключаемыеХарактеристики");
	Объекты.Добавить("ПланВидовХарактеристик.ШтатноеРасписаниеПодключаемыеХарактеристики");
	Объекты.Добавить("РегистрСведений.ДолжностиПодключаемыеХарактеристики");
	Объекты.Добавить("РегистрСведений.НачисленияПодключаемыеХарактеристики");
	Объекты.Добавить("РегистрСведений.ШтатноеРасписаниеПодключаемыеХарактеристики");
	// Конец ЗарплатаКадрыРасширеннаяПодсистемы.ПодключаемыеХарактеристики
	
	// ЗарплатаКадрыРасширеннаяПодсистемы.ПособияСоциальногоСтрахования
	Объекты.Добавить("Документ.БольничныйЛист");
	Объекты.Добавить("Документ.ВходящаяСправкаОЗаработкеДляРасчетаПособий");
	Объекты.Добавить("Документ.ЕдиновременноеПособиеЗаСчетФСС");
	Объекты.Добавить("Документ.ЗапросВФССОПроверкеРаботодателя");
	Объекты.Добавить("Документ.ОплатаДнейУходаЗаДетьмиИнвалидами");
	Объекты.Добавить("РегистрНакопления.ДанныеОНачисленияхДляРасчетаСреднегоЗаработкаФСС");
	Объекты.Добавить("РегистрНакопления.ДанныеСтрахователейДляРасчетаСреднегоЗаработкаФСС");
	Объекты.Добавить("РегистрНакопления.ПериодыУходаЗаБольнымиРодственниками");
	Объекты.Добавить("РегистрСведений.ДанныеОВремениДляРасчетаСреднегоФСС");
	Объекты.Добавить("РегистрСведений.ДанныеОВремениДляРасчетаСреднегоФССИспр");
	Объекты.Добавить("РегистрСведений.ПериодыБолезниУходаЗаДетьми");
	Объекты.Добавить("РегистрСведений.РазмерыГосударственныхПособий");
	Объекты.Добавить("РегистрСведений.СведенияОВремениДляРасчетаСреднегоФCC");
	Объекты.Добавить("РегистрСведений.СведенияОНачисленияхДляРасчетаСреднегоЗаработкаФСС");
	Объекты.Добавить("РегистрСведений.УсловияОплатыОтпускаПоУходуЗаРебенком");
	Объекты.Добавить("РегистрСведений.УсловияОплатыОтпускаПоУходуЗаРебенкомИспр");
	Объекты.Добавить("Справочник.БольничныйЛистПрисоединенныеФайлы");
	Объекты.Добавить("Справочник.ОплатаДнейУходаЗаДетьмиИнвалидамиПрисоединенныеФайлы");
	Объекты.Добавить("Справочник.Работодатели");
	Объекты.Добавить("Справочник.ВходящаяСправкаОЗаработкеДляРасчетаПособийПрисоединенныеФайлы");
	Объекты.Добавить("Справочник.ЕдиновременноеПособиеЗаСчетФССПрисоединенныеФайлы");
	Объекты.Добавить("Справочник.ЗапросВФССОПроверкеРаботодателяПрисоединенныеФайлы");
	// Конец ЗарплатаКадрыРасширеннаяПодсистемы.ПособияСоциальногоСтрахования
	
	// ЗарплатаКадрыРасширеннаяПодсистемы.ПособияСоциальногоСтрахования.СтимулирующиеВыплатыФСС
	Объекты.Добавить("Справочник.КатегорииПолучателейСтимулирующихВыплатФСС");
	Объекты.Добавить("Справочник.ТерриторииСПовышающимКоэффициентомПоКоронавирусу");
	Объекты.Добавить("Справочник.РеестрСтимулирующихВыплатМедицинскимИСоциальнымРаботникамПрисоединенныеФайлы");
	Объекты.Добавить("Документ.РеестрСтимулирующихВыплатМедицинскимИСоциальнымРаботникам");
	// Конец ЗарплатаКадрыРасширеннаяПодсистемы.ПособияСоциальногоСтрахования.СтимулирующиеВыплатыФСС
	
	// ЗарплатаКадрыРасширеннаяПодсистемы.ПособияСоциальногоСтрахования.СЭДО.УведомленияОбЭЛН
	Объекты.Добавить("РегистрСведений.ПодпискиНаУведомленияОбЭЛН");
	Объекты.Добавить("Документ.СогласиеНаУведомлениеОбЭЛН");
	Объекты.Добавить("Справочник.СогласиеНаУведомлениеОбЭЛНПрисоединенныеФайлы");
	Объекты.Добавить("Документ.ОтзывСогласияНаУведомлениеОбЭЛН");
	Объекты.Добавить("Справочник.ОтзывСогласияНаУведомлениеОбЭЛНПрисоединенныеФайлы");
	Объекты.Добавить("РегистрСведений.НастройкиПолученияУведомленийОбЭЛН");
	Объекты.Добавить("РегистрСведений.СогласияНаУведомленияОбЭЛН");
	Объекты.Добавить("РегистрСведений.СообщенияФССОбИзмененииСостоянийЭЛН");
	// Конец ЗарплатаКадрыРасширеннаяПодсистемы.ПособияСоциальногоСтрахования.СЭДО.УведомленияОбЭЛН
	
	// ЗарплатаКадрыРасширеннаяПодсистемы.РасчетЗарплатыРасширенная
	Объекты.Добавить("РегистрНакопления.ДниЧасыОтгулов");
	Объекты.Добавить("РегистрНакопления.ЗначенияОперативныхПоказателейРасчетаЗарплатыОрганизаций");
	Объекты.Добавить("РегистрНакопления.ЗначенияОперативныхПоказателейРасчетаЗарплатыПодразделений");
	Объекты.Добавить("РегистрНакопления.ЗначенияОперативныхПоказателейРасчетаЗарплатыСотрудников");
	Объекты.Добавить("РегистрНакопления.УдержанияДоПределаПоСотрудникам");
	Объекты.Добавить("РегистрРасчета.Начисления");
	Объекты.Добавить("РегистрРасчета.Удержания");
	Объекты.Добавить("РегистрСведений.ВремяРегистрацииДокументовПлановыхНачислений");
	Объекты.Добавить("РегистрСведений.ЗначенияПериодическихПоказателейРасчетаЗарплатыОрганизаций");
	Объекты.Добавить("РегистрСведений.ЗначенияПериодическихПоказателейРасчетаЗарплатыПодразделений");
	Объекты.Добавить("РегистрСведений.ЗначенияПериодическихПоказателейРасчетаЗарплатыСотрудников");
	Объекты.Добавить("РегистрСведений.ЗначенияПериодическихПоказателейРасчетаЗарплатыСотрудниковИспр");
	Объекты.Добавить("РегистрСведений.ЗначенияПоказателейДоплатыЗаРаботуВНочноеВечернееВремя");
	Объекты.Добавить("РегистрСведений.ЗначенияПоказателейНачислений");
	Объекты.Добавить("РегистрСведений.ЗначенияПоказателейУдержаний");
	Объекты.Добавить("РегистрСведений.ЗначенияРазовыхПоказателейРасчетаЗарплатыОрганизаций");
	Объекты.Добавить("РегистрСведений.ЗначенияРазовыхПоказателейРасчетаЗарплатыПодразделений");
	Объекты.Добавить("РегистрСведений.ЗначенияРазовыхПоказателейРасчетаЗарплатыСотрудников");
	Объекты.Добавить("РегистрСведений.ЗначенияРазовыхПоказателейРасчетаЗарплатыСотрудниковИспр");
	Объекты.Добавить("РегистрСведений.ИсходныеДанныеПерерасчетов");
	Объекты.Добавить("РегистрСведений.КоэффициентИндексацииЗаработка");
	Объекты.Добавить("РегистрСведений.НастройкиРасчетаЗарплатыРасширенный");
	Объекты.Добавить("РегистрСведений.ОперативныеПоказателиДляВыявленияНачислений");
	Объекты.Добавить("РегистрСведений.ОперативныеПоказателиДляВыявленияУдержаний");
	Объекты.Добавить("РегистрСведений.ПараметрыИсчисленияПроцентаСевернойНадбавкиФизическихЛиц");
	Объекты.Добавить("РегистрСведений.ПлановыеАвансыИспр");
	Объекты.Добавить("РегистрСведений.ПлановыеНачисленияИспр");
	Объекты.Добавить("РегистрСведений.ПлановыеУдержанияИспр");
	Объекты.Добавить("РегистрСведений.ПоказателиСовокупнойТарифнойСтавкиСотрудников");
	Объекты.Добавить("РегистрСведений.ПолучателиУдержаний");
	Объекты.Добавить("РегистрСведений.ПорядокРасчетаСтоимостиЕдиницыВремениСотрудников");
	Объекты.Добавить("РегистрСведений.ПорядокРасчетаСтоимостиЕдиницыВремениСотрудниковИспр");
	Объекты.Добавить("РегистрСведений.ПредельныеСуммыУдержанийСотрудников");
	Объекты.Добавить("РегистрСведений.ПрименениеДополнительныхПериодическихПоказателейРасчетаЗарплатыСотрудников");
	Объекты.Добавить("РегистрСведений.ПрименениеДополнительныхПериодическихПоказателейРасчетаЗарплатыСотрудниковИспр");
	Объекты.Добавить("РегистрСведений.ПрименениеПлановыхНачислений");
	Объекты.Добавить("РегистрСведений.ПрименениеПлановыхНачисленийИспр");
	Объекты.Добавить("РегистрСведений.ПроцентыСевернойНадбавкиФизическихЛиц");
	Объекты.Добавить("РегистрСведений.РабочиеМестаУдержаний");
	Объекты.Добавить("РегистрСведений.РаспределениеПоТерриториямУсловиямТруда");
	Объекты.Добавить("РегистрСведений.РаспределениеРезультатовНачислений");
	Объекты.Добавить("РегистрСведений.РолиСотрудников");
	Объекты.Добавить("РегистрСведений.СведенияОЛьготахФизическихЛицПострадавшихВАварииЧАЭС");
	Объекты.Добавить("РегистрСведений.СтавкаКомпенсацииЗаЗадержкуЗарплаты");
	Объекты.Добавить("РегистрСведений.СтавкаРефинансированияЦБ");
	Объекты.Добавить("Справочник.ВидыДокументовВводДанныхДляРасчетаЗарплаты");
	Объекты.Добавить("Справочник.ВидыОтпусков");
	Объекты.Добавить("Справочник.МестаРаботы");
	Объекты.Добавить("Справочник.ПоказателиРасчетаЗарплаты");
	Объекты.Добавить("РегистрСведений.НачисленияНеУчитываемыеПриРасчетеДоплатыЗаСовмещение");
	// Конец ЗарплатаКадрыРасширеннаяПодсистемы.РасчетЗарплатыРасширенная
	
	// ЗарплатаКадрыРасширеннаяПодсистемы.РасчетЗарплатыРасширенная.ИсполнительныеДокументы
	Объекты.Добавить("РегистрНакопления.УдержанияПоИсполнительнымДокументам");
	Объекты.Добавить("РегистрСведений.ВеличинаПрожиточногоМинимума");
	Объекты.Добавить("РегистрСведений.УсловияУдержанияПоИсполнительномуДокументу");
	Объекты.Добавить("Справочник.ПрожиточныеМинимумы");
	Объекты.Добавить("Справочник.ТарифыПлатежныхАгентов");
	// Конец ЗарплатаКадрыРасширеннаяПодсистемы.РасчетЗарплатыРасширенная.ИсполнительныеДокументы
	
	// ЗарплатаКадрыРасширеннаяПодсистемы.РасчетЗарплатыРасширенная.ОграничениеВзысканий
	Объекты.Добавить("Документ.ОграничениеВзысканий");
	Объекты.Добавить("Документ.ПогашениеЗадолженностиПоВзысканиям");
	Объекты.Добавить("РегистрНакопления.ЗадолженностьПоУдержаниямФизическихЛиц");
	Объекты.Добавить("Справочник.ОграничениеВзысканийПрисоединенныеФайлы");
	Объекты.Добавить("Справочник.ПогашениеЗадолженностиПоВзысканиямПрисоединенныеФайлы");
	// Конец ЗарплатаКадрыРасширеннаяПодсистемы.РасчетЗарплатыРасширенная.ОграничениеВзысканий
	
	// ЗарплатаКадрыРасширеннаяПодсистемы.РасчетЗарплатыРасширенная.РазрядыКатегорииДолжностей
	Объекты.Добавить("Документ.ИзменениеКвалификационногоРазряда");
	Объекты.Добавить("Документ.УтверждениеТарифнойСетки");
	Объекты.Добавить("РегистрСведений.ЗначенияБазовыхТарифов");
	Объекты.Добавить("РегистрСведений.ЗначенияТарифов");
	Объекты.Добавить("РегистрСведений.ПКУСотрудников");
	Объекты.Добавить("РегистрСведений.ПКУСотрудниковИспр");
	Объекты.Добавить("РегистрСведений.РазрядыКатегорииСотрудников");
	Объекты.Добавить("РегистрСведений.РазрядыКатегорииСотрудниковИспр");
	Объекты.Добавить("Справочник.ИзменениеКвалификационногоРазрядаПрисоединенныеФайлы");
	Объекты.Добавить("Справочник.РазрядыКатегорииДолжностей");
	Объекты.Добавить("Справочник.ТарифныеСетки");
	Объекты.Добавить("Справочник.УтверждениеТарифнойСеткиПрисоединенныеФайлы");
	// Конец ЗарплатаКадрыРасширеннаяПодсистемы.РасчетЗарплатыРасширенная.РазрядыКатегорииДолжностей
	
	// ЗарплатаКадрыРасширеннаяПодсистемы.СотрудникиРасширенная
	Объекты.Добавить("РегистрСведений.СведенияОРежимахРаботыФормыСотрудникаРасширенный");
	// Конец ЗарплатаКадрыРасширеннаяПодсистемы.СотрудникиРасширенная
	
	// ЗарплатаКадрыРасширеннаяПодсистемы.СтатистикаПерсоналаРасширенная
	Объекты.Добавить("РегистрСведений.НастройкиСтатистикиПерсонала");
	Объекты.Добавить("РегистрСведений.СтрокиОтчетностиМониторингаРаботниковСоциальнойСферы");
	Объекты.Добавить("РегистрСведений.СтрокиОтчетностиРасходовИЧисленностиРаботниковГосударственныхОрганов");
	Объекты.Добавить("РегистрСведений.Форма57ТРаздел2Сотрудники");
	Объекты.Добавить("Справочник.СтрокиОтчетностиМониторингаРаботниковСоциальнойСферы");
	Объекты.Добавить("Справочник.СтрокиОтчетностиРасходовИЧисленностиРаботниковГосударственныхОрганов");
	// Конец ЗарплатаКадрыРасширеннаяПодсистемы.СтатистикаПерсоналаРасширенная
	
	// ЗарплатаКадрыРасширеннаяПодсистемы.УдержанияДокументы
	Объекты.Добавить("Документ.ИзменениеУсловийИсполнительногоЛиста");
	Объекты.Добавить("Документ.ИсполнительныйЛист");
	Объекты.Добавить("Документ.ПостоянноеУдержаниеВПользуТретьихЛиц");
	Объекты.Добавить("Документ.УдержаниеВСчетРасчетовПоПрочимОперациям");
	Объекты.Добавить("Документ.УдержаниеДобровольныхВзносовВНПФ");
	Объекты.Добавить("Документ.УдержаниеДобровольныхСтраховыхВзносов");
	Объекты.Добавить("Документ.УдержаниеПрофсоюзныхВзносов");
	Объекты.Добавить("Справочник.ИзменениеУсловийИсполнительногоЛистаПрисоединенныеФайлы");
	Объекты.Добавить("Справочник.ИсполнительныйЛистПрисоединенныеФайлы");
	Объекты.Добавить("Справочник.ПостоянноеУдержаниеВПользуТретьихЛицПрисоединенныеФайлы");
	Объекты.Добавить("Справочник.УдержаниеВСчетРасчетовПоПрочимОперациямПрисоединенныеФайлы");
	Объекты.Добавить("Справочник.УдержаниеДобровольныхВзносовВНПФПрисоединенныеФайлы");
	Объекты.Добавить("Справочник.УдержаниеДобровольныхСтраховыхВзносовПрисоединенныеФайлы");
	Объекты.Добавить("Справочник.УдержаниеПрофсоюзныхВзносовПрисоединенныеФайлы");
	// Конец ЗарплатаКадрыРасширеннаяПодсистемы.УдержанияДокументы
	
	// ЗарплатаКадрыРасширеннаяПодсистемы.УправлениеШтатнымРасписанием
	Объекты.Добавить("Документ.ИзменениеШтатногоРасписания");
	Объекты.Добавить("Документ.ИндексацияШтатногоРасписания");
	Объекты.Добавить("Документ.УтверждениеШтатногоРасписания");
	Объекты.Добавить("РегистрСведений.ЗанятостьПозицийШтатногоРасписания");
	Объекты.Добавить("РегистрСведений.ЗанятостьПозицийШтатногоРасписанияИспр");
	Объекты.Добавить("РегистрСведений.ИсторияЕжегодныхОтпусковПоШтатномуРасписанию");
	Объекты.Добавить("РегистрСведений.ИсторияИспользованияШтатногоРасписания");
	Объекты.Добавить("РегистрСведений.ИсторияНачисленийПоШтатномуРасписанию");
	Объекты.Добавить("РегистрСведений.ИсторияПоказателейПоШтатномуРасписанию");
	Объекты.Добавить("РегистрСведений.ИсторияСпециальностейПоШтатномуРасписанию");
	Объекты.Добавить("РегистрСведений.НастройкиШтатногоРасписания");
	Объекты.Добавить("Справочник.ИзменениеШтатногоРасписанияПрисоединенныеФайлы");
	Объекты.Добавить("Справочник.ИндексацияШтатногоРасписанияПрисоединенныеФайлы");
	Объекты.Добавить("Справочник.УтверждениеШтатногоРасписанияПрисоединенныеФайлы");
	// Конец ЗарплатаКадрыРасширеннаяПодсистемы.УправлениеШтатнымРасписанием
	
	// ЗарплатаКадрыРасширеннаяПодсистемы.УчетВзносовДокументыРасширенная
	Объекты.Добавить("Документ.ЗаявлениеИЗапросВПФРОЗаработке");
	Объекты.Добавить("Справочник.ЗаявлениеИЗапросВПФРОЗаработкеПрисоединенныеФайлы");
	// Конец ЗарплатаКадрыРасширеннаяПодсистемы.УчетВзносовДокументыРасширенная
	
	// ЗарплатаКадрыРасширеннаяПодсистемы.УчетВремениДокументы
	Объекты.Добавить("Документ.ИндивидуальныйГрафик");
	Объекты.Добавить("Документ.РаботаВВыходныеИПраздничныеДни");
	Объекты.Добавить("Документ.РаботаСверхурочно");
	Объекты.Добавить("Документ.РегистрацияПереработок");
	Объекты.Добавить("Документ.ТабельУчетаРабочегоВремени");
	Объекты.Добавить("Справочник.ИндивидуальныйГрафикПрисоединенныеФайлы");
	Объекты.Добавить("Справочник.РаботаВВыходныеИПраздничныеДниПрисоединенныеФайлы");
	Объекты.Добавить("Справочник.РаботаСверхурочноПрисоединенныеФайлы");
	Объекты.Добавить("Справочник.РегистрацияПереработокПрисоединенныеФайлы");
	Объекты.Добавить("Справочник.ТабельУчетаРабочегоВремениПрисоединенныеФайлы");
	// Конец ЗарплатаКадрыРасширеннаяПодсистемы.УчетВремениДокументы
	
	// ЗарплатаКадрыРасширеннаяПодсистемы.УчетНачисленнойЗарплатыРасширенная
	Объекты.Добавить("РегистрНакопления.НачисленияУдержанияПоСотрудникамАвансом");
	Объекты.Добавить("РегистрНакопления.ОтработанноеВремяПоСотрудникамАвансом");
	Объекты.Добавить("РегистрНакопления.ОтработанноеВремяПоСотрудникамКорректировка");
	// Конец ЗарплатаКадрыРасширеннаяПодсистемы.УчетНачисленнойЗарплатыРасширенная
	
	// ЗарплатаКадрыРасширеннаяПодсистемы.УчетНДФЛРасширенная
	Объекты.Добавить("РегистрСведений.ПредоставлениеСоциальныхВычетовУРаботодателя");
	Объекты.Добавить("РегистрСведений.ПрименениеСтандартныхВычетовПоНДФЛИспр");
	Объекты.Добавить("РегистрСведений.СтандартныеВычетыНаДетейНДФЛИспр");
	Объекты.Добавить("РегистрСведений.СтандартныеВычетыФизическихЛицНДФЛИспр");
	Объекты.Добавить("РегистрСведений.УчетнаяПолитикаПоНДФЛРасширенный");
	Объекты.Добавить("РегистрСведений.ДокументыОплаченныеБезУдержанияНДФЛ");
	// Конец ЗарплатаКадрыРасширеннаяПодсистемы.УчетНДФЛРасширенная
	
	// ЗарплатаКадрыРасширеннаяПодсистемы.УчетПрочихДоходов
	Объекты.Добавить("Документ.ВыплатаБывшимСотрудникам");
	Объекты.Добавить("Документ.РегистрацияПрочихДоходов");
	Объекты.Добавить("РегистрНакопления.НачисленияУдержанияПоКонтрагентамАкционерам");
	Объекты.Добавить("Справочник.ВидыВыплатБывшимСотрудникам");
	Объекты.Добавить("Справочник.ВидыПрочихДоходовФизическихЛиц");
	Объекты.Добавить("Справочник.РегистрацияПрочихДоходовПрисоединенныеФайлы");
	Объекты.Добавить("Справочник.ВыплатаБывшимСотрудникамПрисоединенныеФайлы");
	// Конец ЗарплатаКадрыРасширеннаяПодсистемы.УчетПрочихДоходов
	
	// ЗарплатаКадрыРасширеннаяПодсистемы.УчетРабочегоВремениРасширенная
	Объекты.Добавить("РегистрНакопления.ВытесняемоеПлановоеВремяСотрудников");
	Объекты.Добавить("РегистрНакопления.ДанныеИндивидуальныхГрафиковСотрудников");
	Объекты.Добавить("РегистрНакопления.ДанныеОперативногоУчетаРабочегоВремениСотрудников");
	Объекты.Добавить("РегистрНакопления.ДанныеСводногоУчетаРабочегоВремениСотрудников");
	Объекты.Добавить("РегистрНакопления.ДанныеТабельногоУчетаРабочегоВремениСотрудников");
	Объекты.Добавить("РегистрСведений.ГрафикиРаботыПоВидамВремени");
	Объекты.Добавить("РегистрСведений.ДанныеПроизводственногоКалендаряПомесячно");
	Объекты.Добавить("РегистрСведений.НастройкиУчетаВремени");
	Объекты.Добавить("РегистрСведений.ПараметрыЗарегистрированныхДанныхУчетаВремениСотрудников");
	Объекты.Добавить("РегистрСведений.СреднемесячныеНормыВремениГрафиковРаботыСотрудников");
	Объекты.Добавить("Справочник.ГрафикиРаботыСотрудников");
	Объекты.Добавить("Справочник.РежимыРаботыСотрудников");
	Объекты.Добавить("Справочник.СменыРаботыСотрудников");
	Объекты.Добавить("Константа.ВыделятьНерабочиеДниОтдельнымВидомВремени");
	Объекты.Добавить("РегистрСведений.ПериодыОплатыНерабочихДней");
	// Конец ЗарплатаКадрыРасширеннаяПодсистемы.УчетРабочегоВремениРасширенная
	
	// ЗарплатаКадрыРасширеннаяПодсистемы.УчетСреднегоЗаработка
	Объекты.Добавить("РегистрНакопления.ДанныеОВремениДляРасчетаСреднегоОбщий");
	Объекты.Добавить("РегистрНакопления.ДанныеОНачисленияхДляРасчетаСреднегоЗаработкаОбщий");
	Объекты.Добавить("РегистрСведений.ДанныеОВремениДляРасчетаСреднегоОбщийКорректировка");
	Объекты.Добавить("РегистрСведений.ДокументыСреднегоЗаработка");
	Объекты.Добавить("РегистрСведений.НастройкиРасчетаСреднегоЗаработка");
	Объекты.Добавить("РегистрСведений.ПерерасчетСреднегоЗаработка");
	Объекты.Добавить("РегистрСведений.СведенияОВремениДляРасчетаСреднегоОбщий");
	Объекты.Добавить("РегистрСведений.СведенияОНачисленияхДляРасчетаСреднегоЗаработкаОбщий");
	Объекты.Добавить("Константа.УчитыватьОплачиваемоеНерабочееВремяИСуммыВСреднемЗаработке");
	// Конец ЗарплатаКадрыРасширеннаяПодсистемы.УчетСреднегоЗаработка
	
	// РегламентированнаяОтчетность
	Объекты.Добавить("Документ.ВыгрузкаРегламентированныхОтчетов");
	Объекты.Добавить("Документ.РегламентированныйОтчет");
	Объекты.Добавить("РегистрСведений.ЖурналОтчетовСтатусы");
	Объекты.Добавить("РегистрСведений.НумераторПачекПФР");
	Объекты.Добавить("РегистрСведений.СобытияКалендаряБухгалтера");
	Объекты.Добавить("РегистрСведений.СчетчикиВыгрузок");
	Объекты.Добавить("Справочник.РегистрацииВНалоговомОргане");
	Объекты.Добавить("Справочник.РегламентированныйОтчетПрисоединенныеФайлы");
	Объекты.Добавить("РегистрСведений.АрхивДанныхРегламентированнойОтчетности");
	Объекты.Добавить("РегистрСведений.ДополнительныеФайлыРегламентированныхОтчетов");
	Объекты.Добавить("РегистрСведений.АрхивДанныхРегламентированнойОтчетности");
	Объекты.Добавить("РегистрСведений.ДополнительныеФайлыРегламентированныхОтчетов");
	Объекты.Добавить("РегистрСведений.СкрытыеРегламентированныеОтчеты");
	Объекты.Добавить("РегистрСведений.ШаблоныПечатиМашиночитаемыхФорм");
	Объекты.Добавить("Справочник.РегламентированныеОтчеты");
	// Конец РегламентированнаяОтчетность
	
	// РегламентированнаяОтчетность.ОнлайнСервисыРегламентированнойОтчетности
	Объекты.Добавить("РегистрСведений.РесурсыМеханизмаОнлайнСервисовРО");
	// Конец РегламентированнаяОтчетность.ОнлайнСервисыРегламентированнойОтчетности
	
	// РегламентированнаяОтчетность.СообщенияВКонтролирующиеОрганы
	Объекты.Добавить("Документ.УведомлениеОСпецрежимахНалогообложения");
	Объекты.Добавить("Справочник.УведомлениеОСпецрежимахНалогообложенияПрисоединенныеФайлы");
	// Конец РегламентированнаяОтчетность.СообщенияВКонтролирующиеОрганы
	
	// РегламентированнаяОтчетность.СтатистическаяОтчетность
	Объекты.Добавить("РегистрСведений.ШаблоныЭВФОтчетовСтатистики");
	// Конец РегламентированнаяОтчетность.СтатистическаяОтчетность
	
	// РегламентированнаяОтчетность.ЭлектронныйДокументооборотСКонтролирующимиОрганами
	Объекты.Добавить("Документ.ПоясненияКДекларацииПоНДС");
	// Конец РегламентированнаяОтчетность.ЭлектронныйДокументооборотСКонтролирующимиОрганами
	
	// РегламентированнаяОтчетность.ЭлектронныйДокументооборотСКонтролирующимиОрганами.ЗапросыНаВыпискуЕГРЮЛ_ЕГРИП
	Объекты.Добавить("Документ.ЗапросНаВыпискуИзЕГРЮЛ_ЕГРИП");
	// Конец РегламентированнаяОтчетность.ЭлектронныйДокументооборотСКонтролирующимиОрганами.ЗапросыНаВыпискуЕГРЮЛ_ЕГРИП
	
	// РегламентированнаяОтчетность.ЭлектронныйДокументооборотСКонтролирующимиОрганами.ЭлектронныйДокументооборотС_ФНС_ПФР_ФСГС
	Объекты.Добавить("Документ.ЗапросНаИнформационноеОбслуживаниеНалогоплательщика");
	Объекты.Добавить("Документ.ЗапросНаИнформационноеОбслуживаниеСтрахователя");
	Объекты.Добавить("Документ.УведомлениеОПолучателеДокументов");
	Объекты.Добавить("Справочник.ВидыОтправляемыхДокументов");
	// Конец РегламентированнаяОтчетность.ЭлектронныйДокументооборотСКонтролирующимиОрганами.ЭлектронныйДокументооборотС_ФНС_ПФР_ФСГС
	
	// СтандартныеПодсистемы.БизнесПроцессыИЗадачи
	Объекты.Добавить("Задача.ЗадачаИсполнителя");
	Объекты.Добавить("ПланВидовХарактеристик.ОбъектыАдресацииЗадач");
	Объекты.Добавить("Справочник.ГруппыИсполнителейЗадач");
	// Конец СтандартныеПодсистемы.БизнесПроцессыИЗадачи
	
	// СтандартныеПодсистемы.Взаимодействия
	Объекты.Добавить("Справочник.ВстречаПрисоединенныеФайлы");
	Объекты.Добавить("Справочник.ЗапланированноеВзаимодействиеПрисоединенныеФайлы");
	// Конец СтандартныеПодсистемы.Взаимодействия
	
	// СтандартныеПодсистемы.ЗащитаПерсональныхДанных
	Объекты.Добавить("Документ.ОтзывСогласияНаОбработкуПерсональныхДанных");
	Объекты.Добавить("Документ.СогласиеНаОбработкуПерсональныхДанных");
	// Конец СтандартныеПодсистемы.ЗащитаПерсональныхДанных
	
	// СтандартныеПодсистемы.КалендарныеГрафики
	Объекты.Добавить("РегистрСведений.ПериодыНерабочихДнейКалендаря");
	// Конец СтандартныеПодсистемы.КалендарныеГрафики
	
	// СтандартныеПодсистемы.РаботаСФайлами
	Объекты.Добавить("РегистрСведений.УдалитьХранимыеФайлыВерсий");
	// Конец СтандартныеПодсистемы.РаботаСФайлами
	
	Возврат Объекты;
	
КонецФункции

Функция ОбъектыУправленческогоУчета() Экспорт
	
	Объекты = Новый Массив;
	Объекты.Добавить("Документ.Бронь");
	Объекты.Добавить("Документ.ВключениеВКадровыйРезерв");
	Объекты.Добавить("Документ.ЗапросСправкиСотрудником");
	Объекты.Добавить("Документ.ЗаявкаНаВключениеВКадровыйРезерв");
	Объекты.Добавить("Документ.ЗаявкаНаВключениеВПланОбучения");
	Объекты.Добавить("Документ.ЗаявкаНаЕдиновременнуюКомпенсацию");
	Объекты.Добавить("Документ.ЗаявкаНаКомандировку");
	Объекты.Добавить("Документ.ЗаявкаНаОбучениеРазвитие");
	Объекты.Добавить("Документ.ЗаявкаНаОтпуск");
	Объекты.Добавить("Документ.ЗаявкаНаПодборПерсонала");
	Объекты.Добавить("Документ.ИзменениеЛьготСотрудников");
	Объекты.Добавить("Документ.ИзучениеЭлектронногоКурса");
	Объекты.Добавить("Документ.ИсключениеИзКадровогоРезерва");
	Объекты.Добавить("Документ.НазначениеПоказателейЭффективности");
	Объекты.Добавить("Документ.ОбучениеРазвитиеСотрудников");
	Объекты.Добавить("Документ.ОтменаЗаявкиНаЕдиновременнуюКомпенсацию");
	Объекты.Добавить("Документ.ОтменаЗаявкиНаКомандировку");
	Объекты.Добавить("Документ.ОтменаЗаявкиНаОтпуск");
	Объекты.Добавить("Документ.ПланОбученияРазвития");
	Объекты.Добавить("Документ.ПланПоказателейЭффективностиПодразделения");
	Объекты.Добавить("Документ.ПланПоказателейЭффективностиПозиции");
	Объекты.Добавить("Документ.ПланПоказателейЭффективностиСотрудника");
	Объекты.Добавить("Документ.ПланПоказателяЭффективностиПодразделений");
	Объекты.Добавить("Документ.ПланПоказателяЭффективностиПозиций");
	Объекты.Добавить("Документ.ПубликацияМероприятияОбученияРазвития");
	Объекты.Добавить("Документ.РасходыНаИсточникИнформацииОКандидатах");
	Объекты.Добавить("Документ.РешениеОбОтпускеПоУходуЗаРебенком");
	Объекты.Добавить("Документ.РешениеОбУвольнении");
	Объекты.Добавить("Документ.РешениеОВозвратеИзОтпускаПоУходуЗаРебенком");
	Объекты.Добавить("Документ.РешениеОВосстановленииВДолжности");
	Объекты.Добавить("Документ.РешениеОКадровомПереводе");
	Объекты.Добавить("Документ.РешениеОПриемеНаРаботу");
	Объекты.Добавить("Документ.СообщениеОбОтсутствии");
	Объекты.Добавить("Документ.СообщениеОНеправильныхДанныхСотрудника");
	Объекты.Добавить("Документ.УченическийДоговор");
	Объекты.Добавить("Документ.ФактПоказателейЭффективностиПодразделения");
	Объекты.Добавить("Документ.ФактПоказателейЭффективностиСотрудника");
	Объекты.Добавить("Документ.ФактПоказателяЭффективностиПодразделений");
	Объекты.Добавить("Документ.ФактПоказателяЭффективностиСотрудников");
	Объекты.Добавить("Константа.ВыбиратьВидАттестацииСотрудников");
	Объекты.Добавить("Константа.ВыполнятьНачальнуюНастройкуПрограммы");
	Объекты.Добавить("Константа.ГрафикАттестацииИКомиссияУтверждаютсяОднимДокументом");
	Объекты.Добавить("Константа.ГрафикАттестацииИКомиссияУтверждаютсяРазнымиДокументами");
	Объекты.Добавить("Константа.ДоступенПереносДанныхИзПрежнихПрограмм");
	Объекты.Добавить("Константа.ИспользоватьАдаптациюУвольнение");
	Объекты.Добавить("Константа.ИспользоватьАнализТекучестиПерсонала");
	Объекты.Добавить("Константа.ИспользоватьАттестацииСотрудников");
	Объекты.Добавить("Константа.ИспользоватьБронированиеПомещений");
	Объекты.Добавить("Константа.ИспользоватьВнешниеХозяйственныеОперацииЗарплатаКадры");
	Объекты.Добавить("Константа.ИспользоватьВоеннуюСлужбу");
	Объекты.Добавить("Константа.ИспользоватьВыгрузкуВРеестрГосслужащих");
	Объекты.Добавить("Константа.ИспользоватьВыгрузкуВФедеральныйРегистрМедицинскихРаботников");
	Объекты.Добавить("Константа.ИспользоватьГосударственнуюСлужбу");
	Объекты.Добавить("Константа.ИспользоватьДоступКНаркотическимСредствам");
	Объекты.Добавить("Константа.ИспользоватьЗарплатаКадрыКорпоративнаяПодсистемы");
	Объекты.Добавить("Константа.ИспользоватьИнструктажиПоОхранеТруда");
	Объекты.Добавить("Константа.ИспользоватьИнтеграциюРекрутинговыхСайтов");
	Объекты.Добавить("Константа.ИспользоватьКадровыйУчет");
	Объекты.Добавить("Константа.ИспользоватьКлючевыеПоказателиЭффективности");
	Объекты.Добавить("Константа.ИспользоватьМедицинскоеСтрахованиеСотрудников");
	Объекты.Добавить("Константа.ИспользоватьМногофункциональностьДокументов");
	Объекты.Добавить("Константа.ИспользоватьМуниципальнуюСлужбу");
	Объекты.Добавить("Константа.ИспользоватьНачислениеЗарплаты");
	Объекты.Добавить("Константа.ИспользоватьНачислениеЗарплатыВНесколькихОрганизациях");
	Объекты.Добавить("Константа.ИспользоватьНесколькоОрганизаций");
	Объекты.Добавить("Константа.ИспользоватьПодработки");
	Объекты.Добавить("Константа.ИспользоватьПроизвольныеКадровыеПриказы");
	Объекты.Добавить("Константа.ИспользоватьРабочийКалендарь");
	Объекты.Добавить("Константа.ИспользоватьРасчетЗарплатыИСтатьиФинансированияЗарплата");
	Объекты.Добавить("Константа.ИспользоватьРасчетРезервовОтпусков");
	Объекты.Добавить("Константа.ИспользоватьРасчетСохраняемогоДенежногоСодержания");
	Объекты.Добавить("Константа.ИспользоватьСпециальностиФизическихЛиц");
	Объекты.Добавить("Константа.ИспользоватьСтатьиФинансированияЗарплата");
	Объекты.Добавить("Константа.ИспользоватьТарификационнуюОтчетностьУчрежденийФМБА");
	Объекты.Добавить("Константа.ИспользоватьУправленческуюЗарплату");
	Объекты.Добавить("Константа.ИспользоватьУчетКлассныхЧинов");
	Объекты.Добавить("Константа.ИспользоватьЭлектронноеИнтервью");
	Объекты.Добавить("Константа.ИспользоватьЭлектронноеОбучение");
	Объекты.Добавить("Константа.ИспользоватьЭлектронныйОбменСБанкамиПоЗарплатнымПроектам");
	Объекты.Добавить("Константа.ИспользуетсяЕНВД");
	Объекты.Добавить("Константа.ИспользуетсяЕНВДВБюджетномУчреждении");
	Объекты.Добавить("Константа.ИспользуютсяСтавкиНДФЛМеждународныхДоговоров");
	Объекты.Добавить("Константа.НачальнаяНастройкаПрограммыОтветыПользователя");
	Объекты.Добавить("Константа.НачислятьОкладЗаКлассныйЧинМуниципальнымСлужащим");
	Объекты.Добавить("Константа.НеВыполнятьНачальнуюНастройкуПрограммы");
	Объекты.Добавить("Константа.НеИспользоватьГосударственнуюМуниципальнуюСлужбу");
	Объекты.Добавить("Константа.НеИспользоватьНачислениеЗарплаты");
	Объекты.Добавить("Константа.НеИспользоватьНесколькоОрганизаций");
	Объекты.Добавить("Константа.НеИспользуетсяБазоваяВерсия");
	Объекты.Добавить("Константа.ОграничиватьДоступНаУровнеЗаписейПодразделенияОрганизаций");
	Объекты.Добавить("Константа.ОграничиватьДоступНаУровнеЗаписейФизическиеЛица");
	Объекты.Добавить("Константа.ПервоначальныйВводДанныхСохраненныеНастройки");
	Объекты.Добавить("Константа.РаботаВБюджетномУчреждении");
	Объекты.Добавить("Константа.РаботаВМедицинскомУчреждении");
	Объекты.Добавить("Константа.РаботаВНесколькихХозрасчетныхОрганизациях");
	Объекты.Добавить("Константа.РаботаВХозрасчетнойОрганизации");
	Объекты.Добавить("Константа.РазрешитьДобавлениеОрганизацииЗарплатаКадры");
	Объекты.Добавить("Константа.УчитыватьПрерываниеСтажейАвтоматически");
	Объекты.Добавить("ПланВидовХарактеристик.СтатьиРасходов");
	Объекты.Добавить("ПланВидовХарактеристик.ХарактеристикиПерсонала");
	Объекты.Добавить("РегистрНакопления.РасходыНаИсточникиИнформацииОКандидатах");
	Объекты.Добавить("РегистрНакопления.ФактическиеЗначенияПоказателейЭффективностиПодразделений");
	Объекты.Добавить("РегистрНакопления.ФактическиеЗначенияПоказателейЭффективностиСотрудников");
	Объекты.Добавить("РегистрСведений.АнкетыКандидатов");
	Объекты.Добавить("РегистрСведений.ВопросыДляСобеседованияВопросовШаблоновАнкет");
	Объекты.Добавить("РегистрСведений.ВопросыОценкиХарактеристикПерсонала");
	Объекты.Добавить("РегистрСведений.ВыбранныеВариантыОтветовЭлектронныхВопросов");
	Объекты.Добавить("РегистрСведений.ГруппыДоступаБезОграниченийНаКоличествоСеансов");
	Объекты.Добавить("РегистрСведений.ГруппыДоступаБезОграниченияПродолжительностиСеанса");
	Объекты.Добавить("РегистрСведений.ГруппыЭлементовЭлектронныхКурсов");
	Объекты.Добавить("РегистрСведений.ДанныеПоМотивацииВАнкетахДополнительно");
	Объекты.Добавить("РегистрСведений.ДанныеПубликацииВакансий");
	Объекты.Добавить("РегистрСведений.ДанныеПубликацииРезюме");
	Объекты.Добавить("РегистрСведений.ДанныеЭлектронныхКурсовДляПолнотекстовогоПоиска");
	Объекты.Добавить("РегистрСведений.ДатыОтправкиСообщенийСотрудникам");
	Объекты.Добавить("РегистрСведений.ДействияПозицийШтатногоРасписания");
	Объекты.Добавить("РегистрСведений.ДобавленныеПопыткиЭлектронногоТестирования");
	Объекты.Добавить("РегистрСведений.ДоступноеВремяПользователя");
	Объекты.Добавить("РегистрСведений.ЗаданияАдаптацииУвольнения");
	Объекты.Добавить("РегистрСведений.ЗанятостьПользователя");
	Объекты.Добавить("РегистрСведений.ЗначенияПоказателейЛьготСотрудникамПоШтатномуРасписанию");
	Объекты.Добавить("РегистрСведений.ИдентификаторыEStaff");
	Объекты.Добавить("РегистрСведений.ИзмененныеЭлектронныеКурсы");
	Объекты.Добавить("РегистрСведений.ИзученныеЭлектронныеКурсы");
	Объекты.Добавить("РегистрСведений.ИзученныеЭлементыЭлектронныхКурсов");
	Объекты.Добавить("РегистрСведений.ИмпортированныеЭлементыПакетаSCORM");
	Объекты.Добавить("РегистрСведений.ИндивидуальныеЛьготыФизическихЛиц");
	Объекты.Добавить("РегистрСведений.ИспользованиеНачисленийПоказателейГрейдов");
	Объекты.Добавить("РегистрСведений.ИсторияКадровогоРезерва");
	Объекты.Добавить("РегистрСведений.ИсторияНастроекРасчетаУправленческойЗарплатыПозицийШтатногоРасписания");
	Объекты.Добавить("РегистрСведений.ИсторияУправленческихНачисленийПоШтатномуРасписанию");
	Объекты.Добавить("РегистрСведений.ИсторияУправленческихПоказателейПоШтатномуРасписанию");
	Объекты.Добавить("РегистрСведений.КадровыйРезерв");
	Объекты.Добавить("РегистрСведений.КоличествоОдновременныхСеансовГруппДоступа");
	Объекты.Добавить("РегистрСведений.КомандировкаОснования");
	Объекты.Добавить("РегистрСведений.КомандировкиСотрудниковОснования");
	Объекты.Добавить("РегистрСведений.КомментарииКандидатов");
	Объекты.Добавить("РегистрСведений.МестоПозицииШтатногоРасписанияВСтруктуреПредприятия");
	Объекты.Добавить("РегистрСведений.МотиваторыВАнкетах");
	Объекты.Добавить("РегистрСведений.НастройкаВопросовДляСобеседования");
	Объекты.Добавить("РегистрСведений.НастройкиКадровогоРезерва");
	Объекты.Добавить("РегистрСведений.НастройкиКлючевыхПоказателейЭффективности");
	Объекты.Добавить("РегистрСведений.НастройкиОбученияРазвития");
	Объекты.Добавить("РегистрСведений.НастройкиОценкиПерсонала");
	Объекты.Добавить("РегистрСведений.НастройкиПодбораПерсонала");
	Объекты.Добавить("РегистрСведений.НастройкиПрограммОбученияПозицийШтатногоРасписания");
	Объекты.Добавить("РегистрСведений.НастройкиРасчетаУправленческойЗарплатыПозицийШтатногоРасписания");
	Объекты.Добавить("РегистрСведений.НастройкиСамообслуживанияСотрудников");
	Объекты.Добавить("РегистрСведений.НастройкиЭлектронныхКурсов");
	Объекты.Добавить("РегистрСведений.ОбразованиеФизическихЛицОснования");
	Объекты.Добавить("РегистрСведений.ОбучениеСотрудников");
	Объекты.Добавить("РегистрСведений.ОплатаПубликацийВакансий");
	Объекты.Добавить("РегистрСведений.ОтветыНаТестовыеВопросы");
	Объекты.Добавить("РегистрСведений.ОткликиКандидатов");
	Объекты.Добавить("РегистрСведений.ОткликиНаПубликациюМероприятияОбученияРазвития");
	Объекты.Добавить("РегистрСведений.ОтпускаСотрудниковОснования");
	Объекты.Добавить("РегистрСведений.ОтпускОснования");
	Объекты.Добавить("РегистрСведений.ОценкаПозицийШтатногоРасписанияПоКритериям");
	Объекты.Добавить("РегистрСведений.ОценкиКандидатовПоХарактеристикам");
	Объекты.Добавить("РегистрСведений.ПакетыЛьготСотрудникамПоШтатномуРасписанию");
	Объекты.Добавить("РегистрСведений.ПараметрыЗапретаДоступаУволеннымСотрудникамИсключаемыеФизическиеЛица");
	Объекты.Добавить("РегистрСведений.ПараметрыСозданияПользователейФизическихЛиц");
	Объекты.Добавить("РегистрСведений.ПараметрыСозданияПользователейФизическихЛицГруппыДоступа");
	Объекты.Добавить("РегистрСведений.ПерерасчетЛьгот");
	Объекты.Добавить("РегистрСведений.ПланОбученияПоМероприятиям");
	Объекты.Добавить("РегистрСведений.ПланОбученияСотрудников");
	Объекты.Добавить("РегистрСведений.ПлановыеЗначенияПоказателейЭффективностиПодразделений");
	Объекты.Добавить("РегистрСведений.ПлановыеЗначенияПоказателейЭффективностиПозиций");
	Объекты.Добавить("РегистрСведений.ПлановыеЗначенияПоказателейЭффективностиСотрудников");
	Объекты.Добавить("РегистрСведений.ПодразделенияБронированияКомандировок");
	Объекты.Добавить("РегистрСведений.ПодразделенияВводаЗначенийПоказателейЭффективности");
	Объекты.Добавить("РегистрСведений.ПодчиненностьСтруктурныхЕдиниц");
	Объекты.Добавить("РегистрСведений.ПозицииВводаЗначенийПоказателейЭффективности");
	Объекты.Добавить("РегистрСведений.ПоказателиЭффективностиПодразделений");
	Объекты.Добавить("РегистрСведений.ПоказателиЭффективностиПозиций");
	Объекты.Добавить("РегистрСведений.ПопыткиИзученияЭлементовЭлектронныхКурсов");
	Объекты.Добавить("РегистрСведений.ПричиныУвольненияСотрудников");
	Объекты.Добавить("РегистрСведений.ПрограммыОбученияПозицийШтатногоРасписания");
	Объекты.Добавить("РегистрСведений.ПродолжительностьСеансаГруппДоступа");
	Объекты.Добавить("РегистрСведений.ПротоколыОтправкиСообщенийКандидатам");
	Объекты.Добавить("РегистрСведений.ПротоколыОтправкиСообщенийОценкиПерсонала");
	Объекты.Добавить("РегистрСведений.ПубликацииЭлектронныхКурсов");
	Объекты.Добавить("РегистрСведений.ПубликацияВакансий");
	Объекты.Добавить("РегистрСведений.РаботаСКандидатами");
	Объекты.Добавить("РегистрСведений.РезультатыОценкиВПроизвольнойФорме");
	Объекты.Добавить("РегистрСведений.РезультатыОценкиРеспондентами");
	Объекты.Добавить("РегистрСведений.РезультатыОценкиСотрудников");
	Объекты.Добавить("РегистрСведений.СостоянияВакансий");
	Объекты.Добавить("РегистрСведений.СтатистикаЭлектронныхКурсовСотрудников");
	Объекты.Добавить("РегистрСведений.ТекущиеЭтапыРаботыСКандидатами");
	Объекты.Добавить("РегистрСведений.УсловияУченическогоДоговора");
	Объекты.Добавить("РегистрСведений.УчастникиЭтапаРаботыСКандидатом");
	Объекты.Добавить("РегистрСведений.ХарактеристикиПерсоналаПозицийШтатногоРасписания");
	Объекты.Добавить("РегистрСведений.ХарактеристикиФизическихЛиц");
	Объекты.Добавить("РегистрСведений.ШкалыПоказателиЭффективностиПодразделений");
	Объекты.Добавить("РегистрСведений.ШкалыПоказателиЭффективностиПозиций");
	Объекты.Добавить("РегистрСведений.ЭлектронныеКурсыСотрудников");
	Объекты.Добавить("РегистрСведений.ЭлектронныеТестыНаПроверку");
	Объекты.Добавить("Справочник.БроньПрисоединенныеФайлы");
	Объекты.Добавить("Справочник.Вакансии");
	Объекты.Добавить("Справочник.ВакансииПрисоединенныеФайлы");
	Объекты.Добавить("Справочник.ВидыЗаявокНаЕдиновременнуюКомпенсациюСотрудникам");
	Объекты.Добавить("Справочник.ВидыКадровогоРезерва");
	Объекты.Добавить("Справочник.ВидыМероприятияОбученияРазвития");
	Объекты.Добавить("Справочник.ВключениеВКадровыйРезервПрисоединенныеФайлы");
	Объекты.Добавить("Справочник.ВопросыДляСобеседования");
	Объекты.Добавить("Справочник.ГруппыХарактеристикПерсонала");
	Объекты.Добавить("Справочник.ДействияСотрудников");
	Объекты.Добавить("Справочник.Демотиваторы");
	Объекты.Добавить("Справочник.ЗапросСправкиСотрудникомПрисоединенныеФайлы");
	Объекты.Добавить("Справочник.ЗаявкаНаВключениеВКадровыйРезервПрисоединенныеФайлы");
	Объекты.Добавить("Справочник.ЗаявкаНаВключениеВПланОбученияПрисоединенныеФайлы");
	Объекты.Добавить("Справочник.ЗаявкаНаЕдиновременнуюКомпенсациюПрисоединенныеФайлы");
	Объекты.Добавить("Справочник.ЗаявкаНаКомандировкуПрисоединенныеФайлы");
	Объекты.Добавить("Справочник.ЗаявкаНаОбучениеРазвитиеПрисоединенныеФайлы");
	Объекты.Добавить("Справочник.ЗаявкаНаОтпускПрисоединенныеФайлы");
	Объекты.Добавить("Справочник.ЗаявкаНаПодборПерсоналаПрисоединенныеФайлы");
	Объекты.Добавить("Справочник.ИзменениеЛьготСотрудниковПрисоединенныеФайлы");
	Объекты.Добавить("Справочник.ИндивидуальныйПланРазвития");
	Объекты.Добавить("Справочник.ИсключениеИзКадровогоРезерваПрисоединенныеФайлы");
	Объекты.Добавить("Справочник.ИсточникиИнформацииОКандидатах");
	Объекты.Добавить("Справочник.КадровыйРезерв");
	Объекты.Добавить("Справочник.Кандидаты");
	Объекты.Добавить("Справочник.КандидатыПрисоединенныеФайлы");
	Объекты.Добавить("Справочник.КомпетенцииПерсонала");
	Объекты.Добавить("Справочник.МероприятияАдаптацииУвольнения");
	Объекты.Добавить("Справочник.МероприятияОбученияРазвития");
	Объекты.Добавить("Справочник.МероприятияОценкиПерсонала");
	Объекты.Добавить("Справочник.Мотиваторы");
	Объекты.Добавить("Справочник.НазначениеПоказателейЭффективностиПрисоединенныеФайлы");
	Объекты.Добавить("Справочник.ОбучениеРазвитиеСотрудниковПрисоединенныеФайлы");
	Объекты.Добавить("Справочник.ОтменаЗаявкиНаЕдиновременнуюКомпенсациюПрисоединенныеФайлы");
	Объекты.Добавить("Справочник.ОтменаЗаявкиНаКомандировкуПрисоединенныеФайлы");
	Объекты.Добавить("Справочник.ОтменаЗаявкиНаОтпускПрисоединенныеФайлы");
	Объекты.Добавить("Справочник.ОтражениеЗарплатыВФинансовомУчетеПрисоединенныеФайлы");
	Объекты.Добавить("Справочник.ОценкиОбучения");
	Объекты.Добавить("Справочник.ПланОбученияРазвитияПрисоединенныеФайлы");
	Объекты.Добавить("Справочник.ПланПоказателейЭффективностиПодразделенияПрисоединенныеФайлы");
	Объекты.Добавить("Справочник.ПланПоказателейЭффективностиПозицииПрисоединенныеФайлы");
	Объекты.Добавить("Справочник.ПланПоказателейЭффективностиСотрудникаПрисоединенныеФайлы");
	Объекты.Добавить("Справочник.ПланПоказателяЭффективностиПодразделенийПрисоединенныеФайлы");
	Объекты.Добавить("Справочник.ПланПоказателяЭффективностиПозицийПрисоединенныеФайлы");
	Объекты.Добавить("Справочник.ПричиныОтклоненияКандидатов");
	Объекты.Добавить("Справочник.ПричиныОткрытияВакансий");
	Объекты.Добавить("Справочник.ПричиныУвольнений");
	Объекты.Добавить("Справочник.ПрофилиДолжностей");
	Объекты.Добавить("Справочник.ПубликацияМероприятияОбученияРазвитияПрисоединенныеФайлы");
	Объекты.Добавить("Справочник.РасходыНаИсточникИнформацииОКандидатахПрисоединенныеФайлы");
	Объекты.Добавить("Справочник.РешенияПоКадровымИзменениямПрисоединенныеФайлы");
	Объекты.Добавить("Справочник.РолиРеспондентаОценкиПерсонала");
	Объекты.Добавить("Справочник.СообщениеОбОтсутствииПрисоединенныеФайлы");
	Объекты.Добавить("Справочник.СообщениеОНеправильныхДанныхСотрудникаПрисоединенныеФайлы");
	Объекты.Добавить("Справочник.СписокПолучателейГрантаПрисоединенныеФайлы");
	Объекты.Добавить("Справочник.СтруктураПредприятия");
	Объекты.Добавить("Справочник.СтруктураЦелей");
	Объекты.Добавить("Справочник.УченическийДоговорПрисоединенныеФайлы");
	Объекты.Добавить("Справочник.ФактПоказателейЭффективностиПодразделенияПрисоединенныеФайлы");
	Объекты.Добавить("Справочник.ФактПоказателейЭффективностиСотрудникаПрисоединенныеФайлы");
	Объекты.Добавить("Справочник.ФактПоказателяЭффективностиПодразделенийПрисоединенныеФайлы");
	Объекты.Добавить("Справочник.ФактПоказателяЭффективностиСотрудниковПрисоединенныеФайлы");
	Объекты.Добавить("Справочник.ФормыЗачетаМероприятийОбучения");
	Объекты.Добавить("Справочник.ЭтапыРаботыСКандидатами");
	Объекты.Добавить("Константа.ОтклонятьКандидатовЗадержавшихсяНаОдномЭтапе");
	Объекты.Добавить("РегистрСведений.ОтправкаРезюме");
	
	Возврат Объекты;
	
КонецФункции

Функция ОбщиеОбъекты() Экспорт
	
	Объекты = Новый Массив;
	Объекты.Добавить("Справочник.Сотрудники");
	Объекты.Добавить("Справочник.ФизическиеЛица");
	Объекты.Добавить("Справочник.ФизическиеЛицаПрисоединенныеФайлы");
	Объекты.Добавить("Справочник.ШтатноеРасписание");
	Объекты.Добавить("Справочник.ШтатноеРасписаниеПрисоединенныеФайлы");
	Объекты.Добавить("Документ.Анкета");
	Объекты.Добавить("Документ.Встреча");
	Объекты.Добавить("Документ.ЗапланированноеВзаимодействие");
	Объекты.Добавить("Документ.НазначениеОпросов");
	Объекты.Добавить("Документ.СообщениеSMS");
	Объекты.Добавить("Документ.ТелефонныйЗвонок");
	Объекты.Добавить("Документ.ЭлектронноеПисьмоВходящее");
	Объекты.Добавить("Документ.ЭлектронноеПисьмоИсходящее");
	Объекты.Добавить("Константа.АдресДляВосстановленияПароляУчетнойЗаписи");
	Объекты.Добавить("Константа.ВерсияКлассификатораБанков");
	Объекты.Добавить("Константа.ДанныеДляОтложенногоОбновления");
	Объекты.Добавить("Константа.ДетализироватьОбновлениеИБВЖурналеРегистрации");
	Объекты.Добавить("Константа.ДнейДоСкрытияПерсональныхДанныхСубъектов");
	Объекты.Добавить("Константа.ЗапретитьОтображениеНебезопасногоСодержимогоВПисьмах");
	Объекты.Добавить("Константа.ЗапрещатьВходВПрограммуУволеннымСотрудникамАвтоматически");
	Объекты.Добавить("Константа.ЗапрещатьЗагрузкуФайловПоРасширению");
	Объекты.Добавить("Константа.ИзменятьЗаданияЗаднимЧислом");
	Объекты.Добавить("Константа.ИспользоватьАнкетирование");
	Объекты.Добавить("Константа.ИспользоватьБизнесПроцессыИЗадачи");
	Объекты.Добавить("Константа.ИспользоватьБронированиеКомандировок");
	Объекты.Добавить("Константа.ИспользоватьВводДанныхДляРасчетаЗарплаты");
	Объекты.Добавить("Константа.ИспользоватьВерсионированиеОбъектов");
	Объекты.Добавить("Константа.ИспользоватьВнешнихПользователей");
	Объекты.Добавить("Константа.ИспользоватьГруппыПользователей");
	Объекты.Добавить("Константа.ИспользоватьДатуИВремяВСрокахЗадач");
	Объекты.Добавить("Константа.ИспользоватьДатуНачалаЗадач");
	Объекты.Добавить("Константа.ИспользоватьДатыЗапретаЗагрузки");
	Объекты.Добавить("Константа.ИспользоватьДатыЗапретаИзменения");
	Объекты.Добавить("Константа.ИспользоватьДополнительныеОтчетыИОбработки");
	Объекты.Добавить("Константа.ИспользоватьДополнительныеРеквизитыИСведения");
	Объекты.Добавить("Константа.ИспользоватьИндивидуальныеПравилаПересчетаТарифныхСтавокСотрудников");
	Объекты.Добавить("Константа.ИспользоватьНапоминанияПользователя");
	Объекты.Добавить("Константа.ИспользоватьНесколькоПроизводственныхКалендарей");
	Объекты.Добавить("Константа.ИспользоватьОнлайнПоддержку");
	Объекты.Добавить("Константа.ИспользоватьОтправкуSMSВШаблонахСообщений");
	Объекты.Добавить("Константа.ИспользоватьПодборПерсонала");
	Объекты.Добавить("Константа.ИспользоватьПодчиненныеБизнесПроцессы");
	Объекты.Добавить("Константа.ИспользоватьПолнотекстовыйПоиск");
	Объекты.Добавить("Константа.ИспользоватьПочтовыйКлиент");
	Объекты.Добавить("Константа.ИспользоватьПризнакРассмотрено");
	Объекты.Добавить("Константа.ИспользоватьПрочиеВзаимодействия");
	Объекты.Добавить("Константа.ИспользоватьСервисСклоненияMorpher");
	Объекты.Добавить("Константа.ИспользоватьСинхронизациюКалендарей");
	Объекты.Добавить("Константа.ИспользоватьСкрытиеПерсональныхДанныхСубъектов");
	Объекты.Добавить("Константа.ИспользоватьУведомления");
	Объекты.Добавить("Константа.ИспользоватьУдалениеПомеченныхОбъектов");
	Объекты.Добавить("Константа.ИспользоватьУниверсальнуюФормуСпискаСотрудников");
	Объекты.Добавить("Константа.ИспользоватьЧатботов");
	Объекты.Добавить("Константа.ИспользоватьШаблоныСообщений");
	Объекты.Добавить("Константа.ИспользоватьШифрование");
	Объекты.Добавить("Константа.ИспользоватьЭлектроннуюПочтуВШаблонахСообщений");
	Объекты.Добавить("Константа.ИспользоватьЭлектронныеПодписи");
	Объекты.Добавить("Константа.МаксимальныйРазмерФайла");
	Объекты.Добавить("Константа.МаксимальныйРазмерФайлаОбластиДанных");
	Объекты.Добавить("Константа.НастройкиПодчиненногоУзлаРИБ");
	Объекты.Добавить("Константа.ОграничиватьДоступНаУровнеЗаписей");
	Объекты.Добавить("Константа.ОграничиватьДоступНаУровнеЗаписейУниверсально");
	Объекты.Добавить("Константа.ОтложенноеОбновлениеВГлавномУзлеЗавершеноУспешно");
	Объекты.Добавить("Константа.ОтложенноеОбновлениеЗавершеноУспешно");
	Объекты.Добавить("Константа.ОтправлятьПисьмаВФорматеHTML");
	Объекты.Добавить("Константа.ПровайдерSMS");
	Объекты.Добавить("Константа.СведенияОБлокируемыхОбъектах");
	Объекты.Добавить("Константа.СведенияОбОбновленииИБ");
	Объекты.Добавить("Константа.СоздаватьПользователейДляПринятыхНаРаботуСотрудниковАвтоматически");
	Объекты.Добавить("Константа.СписокЗапрещенныхРасширений");
	Объекты.Добавить("Константа.СписокЗапрещенныхРасширенийОбластиДанных");
	Объекты.Добавить("Константа.СписокРасширенийТекстовыхФайлов");
	Объекты.Добавить("Константа.СписокРасширенийФайловOpenDocument");
	Объекты.Добавить("Константа.СписокРасширенийФайловOpenDocumentОбластиДанных");
	Объекты.Добавить("Константа.СтруктураПредприятияНеСоответствуетСтруктуреЮридическихЛиц");
	Объекты.Добавить("ПланВидовХарактеристик.ВопросыДляАнкетирования");
	Объекты.Добавить("ПланВидовХарактеристик.ДополнительныеРеквизитыИСведения");
	Объекты.Добавить("РегистрНакопления.ДополнениеРасчетнойБазыУдержаний");
	Объекты.Добавить("РегистрСведений.АвтоматическиОбновляемыеГрафикиРаботыСотрудников");
	Объекты.Добавить("РегистрСведений.ВакансииЧатботов");
	Объекты.Добавить("РегистрСведений.ВерсииОбъектов");
	Объекты.Добавить("РегистрСведений.ВерсииПодсистем");
	Объекты.Добавить("РегистрСведений.ВидыВремениДляВыявленияНачислений");
	Объекты.Добавить("РегистрСведений.ГруппыЗначенийДоступа");
	Объекты.Добавить("РегистрСведений.ДанныеБизнесПроцессов");
	Объекты.Добавить("РегистрСведений.ДанныеОбработанныеВЦентральномУзлеРИБ");
	Объекты.Добавить("РегистрСведений.ДанныеПроизводственногоКалендаря");
	Объекты.Добавить("РегистрСведений.ДатыЗапретаИзменения");
	Объекты.Добавить("РегистрСведений.ДатыПоследнейЗагрузкиПочтовыхСообщений");
	Объекты.Добавить("РегистрСведений.ДвоичныеДанныеФайлов");
	Объекты.Добавить("РегистрСведений.ДополнительныеСведения");
	Объекты.Добавить("РегистрСведений.ЗависимостиНачисленийПоФПД");
	Объекты.Добавить("РегистрСведений.ЗависимостиПравДоступа");
	Объекты.Добавить("РегистрСведений.ЗаписиСинхронизацииКалендарей");
	Объекты.Добавить("РегистрСведений.ЗначенияГруппДоступа");
	Объекты.Добавить("РегистрСведений.ЗначенияГруппДоступаПоУмолчанию");
	Объекты.Добавить("РегистрСведений.ИдентификаторыПолученныхЭлектронныхПисем");
	Объекты.Добавить("РегистрСведений.ИсполнителиЗадач");
	Объекты.Добавить("РегистрСведений.КодировкиФайлов");
	Объекты.Добавить("РегистрСведений.КонтактыВзаимодействий");
	Объекты.Добавить("РегистрСведений.КурсыВалют");
	Объекты.Добавить("РегистрСведений.НаборыЗначенийДоступа");
	Объекты.Добавить("РегистрСведений.НазначениеДополнительныхОбработок");
	Объекты.Добавить("РегистрСведений.НаличиеФайлов");
	Объекты.Добавить("РегистрСведений.НапоминанияПользователя");
	Объекты.Добавить("РегистрСведений.НаследованиеНастроекПравОбъектов");
	Объекты.Добавить("РегистрСведений.НастройкиВариантовОтчетов");
	Объекты.Добавить("РегистрСведений.НастройкиВерсионированияОбъектов");
	Объекты.Добавить("РегистрСведений.НастройкиКомандПечати");
	Объекты.Добавить("РегистрСведений.НастройкиОчисткиФайлов");
	Объекты.Добавить("РегистрСведений.НастройкиПравОбъектов");
	Объекты.Добавить("РегистрСведений.НастройкиУчетныхЗаписейЭлектроннойПочты");
	Объекты.Добавить("РегистрСведений.НепринятыеКОбработкеПочтовымСерверомИсходящиеПисьма");
	Объекты.Добавить("РегистрСведений.ОтправленныеСообщенияЧатботов");
	Объекты.Добавить("РегистрСведений.ПакетыИнформацииПриЗапуске");
	Объекты.Добавить("РегистрСведений.ПараметрыОграниченияДоступа");
	Объекты.Добавить("РегистрСведений.ПараметрыРаботыПрограммы");
	Объекты.Добавить("РегистрСведений.ПользовательскиеМакетыПечати");
	Объекты.Добавить("РегистрСведений.ПользовательскиеНастройкиДоступаКОбработкам");
	Объекты.Добавить("РегистрСведений.ПраваРолей");
	Объекты.Добавить("РегистрСведений.ПредметыПапкиВзаимодействий");
	Объекты.Добавить("РегистрСведений.ПредметыУведомленийОбИзменениях");
	Объекты.Добавить("РегистрСведений.ПринятыеСведенияЧатботами");
	Объекты.Добавить("РегистрСведений.ПринятыеСообщенияЧатботов");
	Объекты.Добавить("РегистрСведений.ПроцессыДляЗапуска");
	Объекты.Добавить("РегистрСведений.СведенияОФайлах");
	Объекты.Добавить("РегистрСведений.СертификатыШифрования");
	Объекты.Добавить("РегистрСведений.СклоненияПредставленийОбъектов");
	Объекты.Добавить("РегистрСведений.СкрытыеРегламентированныеОтчеты");
	Объекты.Добавить("РегистрСведений.СогласияНаОбработкуПерсональныхДанных");
	Объекты.Добавить("РегистрСведений.СогласованиеВакансий");
	Объекты.Добавить("РегистрСведений.СоставыГруппПользователей");
	Объекты.Добавить("РегистрСведений.СостоянияЧатовЧатботов");
	Объекты.Добавить("РегистрСведений.СубъектыДляСкрытияПерсональныхДанных");
	Объекты.Добавить("РегистрСведений.ТаблицыГруппДоступа");
	Объекты.Добавить("РегистрСведений.Уведомления");
	Объекты.Добавить("РегистрСведений.УведомленияОПрочтении");
	Объекты.Добавить("РегистрСведений.ШаблоныПечатиМашиночитаемыхФорм");
	Объекты.Добавить("РегистрСведений.ШаблоныЭВФОтчетовСтатистики");
	Объекты.Добавить("РегистрСведений.ЭлектронныеПодписи");
	Объекты.Добавить("Справочник.Валюты");
	Объекты.Добавить("Справочник.ВариантыОтветовАнкет");
	Объекты.Добавить("Справочник.ВариантыОтчетов");
	Объекты.Добавить("Справочник.ВерсииФайлов");
	Объекты.Добавить("Справочник.ВидыКонтактнойИнформации");
	Объекты.Добавить("Справочник.ВидыОтправляемыхДокументов");
	Объекты.Добавить("Справочник.ВидыУведомлений");
	Объекты.Добавить("Справочник.ВнешниеПользователи");
	Объекты.Добавить("Справочник.ВопросыШаблонаАнкеты");
	Объекты.Добавить("Справочник.ГруппыВнешнихПользователей");
	Объекты.Добавить("Справочник.ГруппыДоступа");
	Объекты.Добавить("Справочник.ГруппыПользователей");
	Объекты.Добавить("Справочник.ДополнительныеОтчетыИОбработки");
	Объекты.Добавить("Справочник.ЗакладкиВзаимодействий");
	Объекты.Добавить("Справочник.ЗначенияСвойствОбъектов");
	Объекты.Добавить("Справочник.ЗначенияСвойствОбъектовИерархия");
	Объекты.Добавить("Справочник.ИдентификаторыОбъектовМетаданных");
	Объекты.Добавить("Справочник.КлассификаторБанков");
	Объекты.Добавить("Справочник.НаборыДополнительныхРеквизитовИСведений");
	Объекты.Добавить("Справочник.ПапкиФайлов");
	Объекты.Добавить("Справочник.ПапкиЭлектронныхПисем");
	Объекты.Добавить("Справочник.Пользователи");
	Объекты.Добавить("Справочник.ПользовательскиеНастройкиОтчетов");
	Объекты.Добавить("Справочник.ПравилаОбработкиЭлектроннойПочты");
	Объекты.Добавить("Справочник.ПредопределенныеВариантыОтчетов");
	Объекты.Добавить("Справочник.ПрограммыЭлектроннойПодписиИШифрования");
	Объекты.Добавить("Справочник.ПроизводственныеКалендари");
	Объекты.Добавить("Справочник.ПрофилиГруппДоступа");
	Объекты.Добавить("Справочник.РассылкиУведомлений");
	Объекты.Добавить("Справочник.РегламентированныеОтчеты");
	Объекты.Добавить("Справочник.РолиИсполнителей");
	Объекты.Добавить("Справочник.СертификатыКлючейЭлектроннойПодписиИШифрования");
	Объекты.Добавить("Справочник.СобеседникиЧатботов");
	Объекты.Добавить("Справочник.СообщениеSMSПрисоединенныеФайлы");
	Объекты.Добавить("Справочник.СтраныМира");
	Объекты.Добавить("Справочник.СтроковыеКонтактыВзаимодействий");
	Объекты.Добавить("Справочник.ТелефонныйЗвонокПрисоединенныеФайлы");
	Объекты.Добавить("Справочник.УчебныеПараллели");
	Объекты.Добавить("Справочник.УчетныеЗаписиЭлектроннойПочты");
	Объекты.Добавить("Справочник.Файлы");
	Объекты.Добавить("Справочник.Чатботы");
	Объекты.Добавить("Справочник.ЧатыЧатботов");
	Объекты.Добавить("Справочник.ШаблоныАнкет");
	Объекты.Добавить("Справочник.ШаблоныСообщений");
	Объекты.Добавить("Справочник.ШаблоныСообщенийПрисоединенныеФайлы");
	Объекты.Добавить("Справочник.ЭлектронноеПисьмоВходящееПрисоединенныеФайлы");
	Объекты.Добавить("Справочник.ЭлектронноеПисьмоИсходящееПрисоединенныеФайлы");
	Объекты.Добавить("БизнесПроцесс.Задание");
	Объекты.Добавить("Константа.ДополнительныйЯзык1");
	Объекты.Добавить("Константа.ДополнительныйЯзык2");
	Объекты.Добавить("Константа.ИспользоватьДополнительныйЯзык1");
	Объекты.Добавить("Константа.ИспользоватьДополнительныйЯзык2");
	Объекты.Добавить("Константа.ОсновнойЯзык");
	Объекты.Добавить("Константа.ПервоеОбновлениеДоступаЗавершилось");
	Объекты.Добавить("Константа.РазрешеноРедактированиеОбщихДанных");
	Объекты.Добавить("Константа.СпособФормированияИнтервальныхРегистров");
	Объекты.Добавить("Константа.УдалитьЛогинДоступаКСервисуMorpher");
	Объекты.Добавить("ПланВидовРасчета.Начисления");
	Объекты.Добавить("ПланВидовРасчета.Удержания");
	Объекты.Добавить("Константа.НастройкиКолонтитулов");
	Объекты.Добавить("РегистрСведений.ОтветыНаВопросыАнкет");
	
	Возврат Объекты;
	
КонецФункции

#КонецОбласти