#Область ПрограммныйИнтерфейс

// Получает сведения о руководителях подразделений предприятия и помещает их в параметр ДанныеРуководителей.
//
// Параметры:
// 		ДанныеРуководителей - Соответствие - заполняется руководителя подразделений.
// 			* Ключ - СправочникСсылка.СтруктураПредприятия
// 			* Значение - СправочникСсылка.ФизическоеЛицо.
// 		ПодразделенияПредприятия - Массив - содержит СправочникСсылка.СтруктураПредприятия,
//			подразделения предприятия, по которым необходимо получить руководителей.
//
Процедура ЗаполнитьДанныеРуководителей(ДанныеРуководителей, ПодразделенияПредприятия) Экспорт

	

КонецПроцедуры

#КонецОбласти