#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаПолученияДанныхВыбора(ДанныеВыбора, Параметры, СтандартнаяОбработка)
	
	БезПроизводныхЗначений = Неопределено;
	Параметры.Свойство("БезПроизводныхЗначений", БезПроизводныхЗначений);
	
	Если БезПроизводныхЗначений = Истина Тогда
		
		СтандартнаяОбработка = Ложь;
		
		ДанныеВыбора = Новый СписокЗначений;
		ДанныеВыбора.Добавить(Перечисления.ВидыЗастрахованныхЛицОбязательногоСтрахования.ГражданеРФ, НСтр("ru = 'Гражданин Российской Федерации'"));
		ДанныеВыбора.Добавить(Перечисления.ВидыЗастрахованныхЛицОбязательногоСтрахования.ВременноПребывающиеИностранцы, НСтр("ru = 'Иностранец, временно пребывающий на территории РФ, кроме высококвалифицированных иностранных специалистов'"));
		ДанныеВыбора.Добавить(Перечисления.ВидыЗастрахованныхЛицОбязательногоСтрахования.ВременноПребывающиеИностранцыПризнанныеБеженцами, НСтр("ru = 'Иностранец, которому предоставлено временное убежище, временно пребывающий на территории РФ'"));
		ДанныеВыбора.Добавить(Перечисления.ВидыЗастрахованныхЛицОбязательногоСтрахования.ПостоянноПроживающиеИностранцы, НСтр("ru = 'Приравнен к гражданам РФ (постоянно проживает, признан беженцем, гражданин страны-участника Договора о ЕАЭС)'"));
		ДанныеВыбора.Добавить(Перечисления.ВидыЗастрахованныхЛицОбязательногоСтрахования.ВременноПребывающиеИностранцыНестрахуемые, НСтр("ru = 'Иностранец, временно пребывающий на территории РФ, не подлежащий страхованию (как ВКС или в соответствии с международным договором)'"));
		ДанныеВыбора.Добавить(Перечисления.ВидыЗастрахованныхЛицОбязательногоСтрахования.ВременноПроживающиеИностранцы, НСтр("ru = 'Иностранец, временно проживающий на территории РФ'"));
		ДанныеВыбора.Добавить(Перечисления.ВидыЗастрахованныхЛицОбязательногоСтрахования.ВысококвалифицированныеСпециалистыПостоянноПроживающие, НСтр("ru = 'Высококвалифицированный иностранный специалист или член его семьи, постоянно проживающий на территории РФ'"));
		ДанныеВыбора.Добавить(Перечисления.ВидыЗастрахованныхЛицОбязательногоСтрахования.ВысококвалифицированныеСпециалистыВременноПроживающие, НСтр("ru = 'Высококвалифицированный иностранный специалист или член его семьи, временно проживающий на территории РФ'"));
		ДанныеВыбора.Добавить(Перечисления.ВидыЗастрахованныхЛицОбязательногоСтрахования.ВысококвалифицированныеСпециалистыИзЕАЭС, НСтр("ru = 'Высококвалифицированный иностранный специалист или член его семьи из страны-участника Договора о ЕАЭС, временно пребывающий на территории РФ'"));
		ДанныеВыбора.Добавить(Перечисления.ВидыЗастрахованныхЛицОбязательногоСтрахования.ВременноПребывающиеИностранцыСтрахуемыеФСС, НСтр("ru = 'Иностранец, временно пребывающий на территории РФ, не подлежащий страхованию на ОПС и ОМС в соответствии с международным договором'"));
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// Возвращает категории доходов НДФЛ по дивидендам.
//
// Возвращаемое значение:
//    Массив - Значения типа ПеречислениеСсылка.КатегорииДоходовНДФЛ
//
Функция ВысококвалифицированныеСпециалисты() Экспорт
	
	Категории = Новый Массив;
	Категории.Добавить(ВысококвалифицированныеСпециалистыВременноПроживающие);
	Категории.Добавить(ВысококвалифицированныеСпециалистыПостоянноПроживающие);
	Категории.Добавить(ВысококвалифицированныеСпециалистыИзЕАЭС);
	
	Возврат Категории;
	
КонецФункции

#КонецОбласти

#КонецЕсли