#Область СлужебныйПрограммныйИнтерфейс

Процедура ЗаполнитьИсточникиДанныхДляПроверкиЗапретаИзменения(ИсточникиДанных) Экспорт
	
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.ОтражениеЗарплатыВБухучете", "ПериодРегистрации", "БухгалтерскийУчетЗарплаты", "Организация");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.ОтражениеСтатистикиПерсоналаВБухучете", "ПериодРегистрации", "БухгалтерскийУчетЗарплаты", "Организация");
	
КонецПроцедуры

// См. УправлениеДоступомПереопределяемый.ПриЗаполненииСписковСОграничениемДоступа.
Процедура ПриЗаполненииСписковСОграничениемДоступа(Списки) Экспорт
	
	Списки.Вставить(Метаданные.Документы.ОтражениеЗарплатыВБухучете, Истина);
	Списки.Вставить(Метаданные.Справочники.ОтражениеЗарплатыВБухучетеПрисоединенныеФайлы, Истина);
	Списки.Вставить(Метаданные.Документы.ОтражениеСтатистикиПерсоналаВБухучете, Истина);
	Списки.Вставить(Метаданные.Справочники.ОтражениеСтатистикиПерсоналаВБухучетеПрисоединенныеФайлы, Истина);
	
КонецПроцедуры

// Определяет объекты, в которых есть процедура ДобавитьКомандыПечати().
// Подробнее см. УправлениеПечатьюПереопределяемый.
//
// Параметры:
//  СписокОбъектов - Массив - список менеджеров объектов.
//
Процедура ПриОпределенииОбъектовСКомандамиПечати(СписокОбъектов) Экспорт
	
	СписокОбъектов.Добавить(Документы.ОтражениеЗарплатыВБухучете);
	СписокОбъектов.Добавить(Документы.ОтражениеСтатистикиПерсоналаВБухучете);
	
КонецПроцедуры

// Содержит настройки размещения вариантов отчетов в панели отчетов.
// Описание см. ЗарплатаКадрыВариантыОтчетов.НастроитьВариантыОтчетов.
//
Процедура НастроитьВариантыОтчетов(Настройки) Экспорт
	
	ВариантыОтчетов.НастроитьОтчетВМодулеМенеджера(Настройки, Метаданные.Отчеты.ДанныеДляОтраженияВБухучете);
	
КонецПроцедуры

// Определяет имя документа, которым выполняется отражение зарплаты в бухгалтерском учете.
//
Процедура ЗаполнитьИмяДокументаОтраженияВБухучете(ИмяДокументаОтраженияВБухучете) Экспорт
	ИмяДокументаОтраженияВБухучете = Метаданные.Документы.ОтражениеЗарплатыВБухучете.ПолноеИмя();
КонецПроцедуры

#Область Свойства

// См. УправлениеСвойствамиПереопределяемый.ПриПолученииПредопределенныхНаборовСвойств.
Процедура ПриПолученииПредопределенныхНаборовСвойств(Наборы) Экспорт
	
	УправлениеСвойствамиБЗК.ЗарегистрироватьНаборСвойств(Наборы, "d42dbfbb-9802-11e9-80cd-4cedfb43b11a", Метаданные.Документы.ОтражениеЗарплатыВБухучете);
	УправлениеСвойствамиБЗК.ЗарегистрироватьНаборСвойств(Наборы, "29aa5007-daeb-4923-b395-aeb90e7d9f8d", Метаданные.Документы.ОтражениеСтатистикиПерсоналаВБухучете);
	
КонецПроцедуры

#КонецОбласти

#Область ОбновлениеИнформационнойБазы

// См. ОбновлениеИнформационнойБазыЗарплатаКадрыБазовый.ПриДобавленииОбработчиковОбновления.
Процедура ЗарегистрироватьОбработчикиОбновления(Обработчики) Экспорт
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "3.1.9.8";
	Обработчик.Процедура = "ОтражениеЗарплатыВБухучете.ЗаполнитьСтатьюРасходовВДокументеОтражениеЗарплатыВБухучете";
	Обработчик.РежимВыполнения = ОбновлениеИнформационнойБазыЗарплатаКадрыБазовый.ОсновнойРежимВыполненияОбновления();   
	Обработчик.Идентификатор = Новый УникальныйИдентификатор("5ebfc016-52c3-4a57-8659-6ab38f58333c");
	Обработчик.Комментарий = НСтр("ru = 'Заполнение статьи расходов в документе ""Отражение зарплаты в бухучете.""'");
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти
