#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ЗаполнитьЗначенияСвойств(ЭтотОбъект, Параметры, 
		"Заголовок,Идентификатор,ВидДеятельности,ДатаВыдачиСвидетельства,РегистрационныйНомерСвидетельства,СпециальностьПоОбразованию,УровеньОбразования");	
	ВозвращаемоеЗначениеУстановлено = Ложь;
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
	Если ВозвращаемоеЗначениеУстановлено Тогда 
		ВозвращаемыйПараметр = Новый Структура;
		ВозвращаемыйПараметр.Вставить("Идентификатор", Идентификатор);
		ВозвращаемыйПараметр.Вставить("ВидДеятельности", ВидДеятельности);
		ВозвращаемыйПараметр.Вставить("ДатаВыдачиСвидетельства", ДатаВыдачиСвидетельства);
		ВозвращаемыйПараметр.Вставить("РегистрационныйНомерСвидетельства", РегистрационныйНомерСвидетельства);
		ВозвращаемыйПараметр.Вставить("СпециальностьПоОбразованию", СпециальностьПоОбразованию);
		ВозвращаемыйПараметр.Вставить("УровеньОбразования", УровеньОбразования);
		ОповеститьОВыборе(ВозвращаемыйПараметр);
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Ок(Команда)
	ВозвращаемоеЗначениеУстановлено = Истина;
	Закрыть();
КонецПроцедуры

&НаКлиенте
Процедура Отмена(Команда)
	Закрыть();
КонецПроцедуры

#КонецОбласти