
#Область СлужебныйПрограммныйИнтерфейс

Процедура ВвестиДанныеОПеречисленииНДФЛВБюджет(Форма, Ссылка) Экспорт
	
	Если Форма.Модифицированность Тогда
		ТекстСообщения = НСтр("ru = 'Ввести перечисление НДФЛ возможно только по проведенному документу'");
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения);
		Возврат;
	КонецЕсли;
	
	ОткрытьФорму("Обработка.СозданиеПеречисленияНДФЛВБюджет.Форма.СозданиеПеречисленияНалога", 
					Новый Структура("ДокументОснование", Ссылка), 
					Форма);
	
КонецПроцедуры

#КонецОбласти

