
#Область СлужебныйПрограммныйИнтерфейс

// См. ОбновлениеИнформационнойБазы.НоваяТаблицаОбработчиковОбновления.
Процедура ЗарегистрироватьОбработчикиОбновления(Обработчики) Экспорт
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия          = "3.1.21.36";
	Обработчик.РежимВыполнения = "Монопольно";
	Обработчик.Процедура       = "ОбменДаннымиЗарплата3Бухгалтерия3Расширенный.ОбновитьНастройкуИспользуетсяОбмен";
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ОбновитьНастройкиИспользованияОбменаДанными() Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	ИспользованиеОбменаЗарплата3Бухгалтерия3ПоОрганизациям.Используется КАК Используется
	|ИЗ
	|	РегистрСведений.ИспользованиеОбменаЗарплата3Бухгалтерия3ПоОрганизациям КАК ИспользованиеОбменаЗарплата3Бухгалтерия3ПоОрганизациям
	|ГДЕ
	|	ИспользованиеОбменаЗарплата3Бухгалтерия3ПоОрганизациям.Используется";
	РезультатЗапроса = Запрос.Выполнить();
	
	ОбменИспользуется = Константы.ИспользоватьОбменЗарплата3Бухгалтерия3ПоВсемОрганизациям.Получить()
		Или Не РезультатЗапроса.Пустой();
		
	Если Константы.ИспользоватьОбменЗарплата3Бухгалтерия3.Получить() <> ОбменИспользуется Тогда
		Константы.ИспользоватьОбменЗарплата3Бухгалтерия3.Установить(ОбменИспользуется);
	КонецЕсли;

КонецПроцедуры

#Область ОбработчикиОбновления

Процедура ОбновитьНастройкуИспользуетсяОбмен() Экспорт

	ОбновитьНастройкиИспользованияОбменаДанными();

КонецПроцедуры

#КонецОбласти

#КонецОбласти