#Область СлужебныеПроцедурыИФункции

Функция ТипыОбъектовСоСтороннимиПечатнымиФормами() Экспорт
	
	ТипыОбъектов = КадровыйЭДОБазовый.ТипыОбъектовСоСтороннимиПечатнымиФормами();
	ТипыОбъектов.Добавить(Тип("ДокументСсылка.УвольнениеСписком"));
	
	Возврат ТипыОбъектов;
	
КонецФункции

Процедура ЗаполнитьНастройкиПечатныхФормПоУмолчанию(ОписанияНастроек) Экспорт
	
	КадровыйЭДОБазовый.ЗаполнитьНастройкиПечатныхФормПоУмолчанию(ОписанияНастроек);
	
	ЗарплатаКадрыРасширенный.ЗаполнитьНастройкиПечатныхФормПоУмолчанию(ОписанияНастроек);
	ЗаймыСотрудникам.ЗаполнитьНастройкиПечатныхФормПоУмолчанию(ОписанияНастроек);
	РазрядыКатегорииДолжностей.ЗаполнитьНастройкиПечатныхФормПоУмолчанию(ОписанияНастроек);
	РасчетЗарплатыРасширенный.ЗаполнитьНастройкиПечатныхФормПоУмолчанию(ОписанияНастроек);
	
	Если ОбщегоНазначения.ПодсистемаСуществует("ЗарплатаКадрыКорпоративнаяПодсистемы.КадровыйУчет.ДистанционнаяРабота") Тогда
		МодульДистанционнаяРабота = ОбщегоНазначения.ОбщийМодуль("ДистанционнаяРабота");
		МодульДистанционнаяРабота.ЗаполнитьНастройкиПечатныхФормПоУмолчанию(ОписанияНастроек);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
