
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ПубликуемаяСтруктураКомпании = ?(Параметры.ПубликоватьСтруктуруЮридическихЛиц, 0, 1);
	
	Если Параметры.СервисПодключен Тогда
		УстановитьЗаголовкиПубликуемойСтруктуры();
		ТекстЗаголовка = НСтр("ru = 'Изменить структуру Компании в сервисе'");
	Иначе
		УстановитьЗаголовкиПубликуемойСтруктурыПриПодключении();
		ТекстЗаголовка = НСтр("ru = 'Установить структуру Компании в сервисе'");
	КонецЕсли;
	
	Заголовок = ТекстЗаголовка;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Изменить(Команда)
	
	Отказ = Ложь;
		
	Результат = Новый Структура("ПубликоватьСтруктуруЮридическихЛиц");
	Результат.ПубликоватьСтруктуруЮридическихЛиц = ?(ПубликуемаяСтруктураКомпании = 0, Истина, Ложь);
	
	Если Не Отказ Тогда
		Закрыть(Результат);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Отменить(Команда)
	Закрыть();
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура УстановитьЗаголовкиПубликуемойСтруктуры()

	Если ПубликуемаяСтруктураКомпании = 0 Тогда
		ТекстЗаголовка = НСтр("ru = 'Структура Компании в сервисе соответствует Подразделениям организации (структуре юридических лиц), эту настройку можно изменить.'");
	Иначе
		ТекстЗаголовка = НСтр("ru = 'Структура Компании в сервисе соответствует Структуре предприятия, эту настройку можно изменить.'");
	КонецЕсли;
	Элементы.ДекорацияПубликуемаяСтруктура.Заголовок = ТекстЗаголовка;
	
	ТекстЗаголовка = НСтр("ru = 'При изменении настройки потребуется выполнить настройку правил обработки заявок сотрудников. Структура Компании в сервисе обновится после очередного обмена с сервисом, при большом количестве сотрудников обновление может выполняться несколько десятков минут.'");
	Элементы.ДекорацияПояснение.Заголовок = ТекстЗаголовка;

КонецПроцедуры

&НаСервере
Процедура УстановитьЗаголовкиПубликуемойСтруктурыПриПодключении()

	Если ПубликуемаяСтруктураКомпании = 0 Тогда
		ТекстЗаголовка = НСтр("ru = 'Структура Компании в сервисе будет соответствовать Подразделениям организации (структуре юридических лиц), эту настройку можно изменить.'");
	Иначе
		ТекстЗаголовка = НСтр("ru = 'Структура Компании в сервисе будет соответствовать Структуре предприятия, эту настройку можно изменить.'");
	КонецЕсли;
	Элементы.ДекорацияПубликуемаяСтруктура.Заголовок = ТекстЗаголовка;
	
	ТекстЗаголовка = НСтр("ru = 'Эту настройку можно будет изменить после подключения к сервису.'");
	Элементы.ДекорацияПояснение.Заголовок = ТекстЗаголовка;

КонецПроцедуры

#КонецОбласти