
#Область СлужебныйПрограммныйИнтерфейс

// Добавляет в список Обработчики процедуры-обработчики обновления,
// необходимые данной подсистеме.
//
// Параметры:
//   Обработчики - ТаблицаЗначений - см. описание функции НоваяТаблицаОбработчиковОбновления
//                                   общего модуля ОбновлениеИнформационнойБазы.
// 
Процедура ЗарегистрироватьОбработчикиОбновления(Обработчики) Экспорт
	
КонецПроцедуры	

#Область Свойства

// См. УправлениеСвойствамиПереопределяемый.ПриПолученииПредопределенныхНаборовСвойств.
Процедура ПриПолученииПредопределенныхНаборовСвойств(Наборы) Экспорт
	
	УправлениеСвойствамиБЗК.ЗарегистрироватьНаборСвойств(Наборы, "d42dbfc1-9802-11e9-80cd-4cedfb43b11a", Метаданные.Документы.ВозмещениеРасходовФондомСоциальногоСтрахования);
	УправлениеСвойствамиБЗК.ЗарегистрироватьНаборСвойств(Наборы, "d42dbf07-9802-11e9-80cd-4cedfb43b11a", Метаданные.Документы.УплатаСтраховыхВзносовВФонды);
	
КонецПроцедуры

#КонецОбласти

#Область УправлениеДоступом

// См. УправлениеДоступомПереопределяемый.ПриЗаполненииСписковСОграничениемДоступа.
Процедура ПриЗаполненииСписковСОграничениемДоступа(Списки) Экспорт
	
	Списки.Вставить(Метаданные.Документы.ВозмещениеРасходовФондомСоциальногоСтрахования, Истина);
	Списки.Вставить(Метаданные.Справочники.ВозмещениеРасходовФондомСоциальногоСтрахованияПрисоединенныеФайлы, Истина);
	Списки.Вставить(Метаданные.Документы.УплатаСтраховыхВзносовВФонды, Истина);
	Списки.Вставить(Метаданные.Справочники.УплатаСтраховыхВзносовВФондыПрисоединенныеФайлы, Истина);
	
КонецПроцедуры

#КонецОбласти

// Определяет объекты, в которых есть процедура ДобавитьКомандыПечати().
// Подробнее см. УправлениеПечатьюПереопределяемый.
//
// Параметры:
//  СписокОбъектов - Массив - список менеджеров объектов.
//
Процедура ПриОпределенииОбъектовСКомандамиПечати(СписокОбъектов) Экспорт
	
	СписокОбъектов.Добавить(Документы.УплатаСтраховыхВзносовВФонды);
	СписокОбъектов.Добавить(Документы.ВозмещениеРасходовФондомСоциальногоСтрахования);
	
КонецПроцедуры

#КонецОбласти