
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Узел = Параметры.Узел;
	
	СинхронизацияРазрешена = СинхронизацияДанныхЗарплатаКадрыСервер.СинхронизацияРазрешена(Параметры.Узел);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Отказ = Истина;
	
	Если СинхронизацияРазрешена Тогда
		
		ПараметрыПомощника = Новый Структура("Ключ, Узел", Узел, Узел);
		
		ОповещениеОЗакрытии = Новый ОписаниеОповещения("СоздатьНачальныйОбразРИБЗавершение", ЭтотОбъект.ВладелецФормы);
		ОткрытьФорму("ОбщаяФорма.СозданиеНачальногоОбразаСФайлами",
			ПараметрыПомощника, ЭтотОбъект.ВладелецФормы, , , , ОповещениеОЗакрытии, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
		
	Иначе
		
		ТекстПредупреждения =
			НСтр("ru='Производится заполнение организаций и структурных подразделений по сотрудникам и физическим лицам.
			|Создание начального образа недоступно, пока заполнение данных не будет выполнено.'");
		
		ПоказатьПредупреждение(, ТекстПредупреждения, , НСтр("ru = 'Создание начального образа не доступно'"));
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
