#Область СлужебныйПрограммныйИнтерфейс

#Область Свойства

// См. УправлениеСвойствамиПереопределяемый.ПриПолученииПредопределенныхНаборовСвойств.
Процедура ПриПолученииПредопределенныхНаборовСвойств(Наборы) Экспорт
	
	УправлениеСвойствамиБЗК.ЗарегистрироватьНаборСвойств(Наборы, "d42dbf6e-9802-11e9-80cd-4cedfb43b11a", Метаданные.Документы.ВыплатаДепонированнойЗарплаты);
	
КонецПроцедуры

#КонецОбласти

#Область УправлениеДоступом

// См. УправлениеДоступомПереопределяемый.ПриЗаполненииСписковСОграничениемДоступа.
Процедура ПриЗаполненииСписковСОграничениемДоступа(Списки) Экспорт
	
	Списки.Вставить(Метаданные.Документы.ВыплатаДепонированнойЗарплаты, Истина);
	Списки.Вставить(Метаданные.Справочники.ВыплатаДепонированнойЗарплатыПрисоединенныеФайлы, Истина);
	
КонецПроцедуры

// См. УправлениеДоступомПереопределяемый.ПриЗаполненииВидовОграниченийПравОбъектовМетаданных.
Процедура ПриЗаполненииВидовОграниченийПравОбъектовМетаданных(Описание) Экспорт

		Описание = Описание + "
		|Документ.ВыплатаДепонированнойЗарплаты.Чтение.ГруппыФизическихЛиц
		|Документ.ВыплатаДепонированнойЗарплаты.Чтение.Организации
		|Документ.ВыплатаДепонированнойЗарплаты.Изменение.ГруппыФизическихЛиц
		|Документ.ВыплатаДепонированнойЗарплаты.Изменение.Организации
		|Справочник.ВыплатаДепонированнойЗарплатыПрисоединенныеФайлы.Чтение.ГруппыФизическихЛиц
		|Справочник.ВыплатаДепонированнойЗарплатыПрисоединенныеФайлы.Чтение.Организации
		|Справочник.ВыплатаДепонированнойЗарплатыПрисоединенныеФайлы.Изменение.ГруппыФизическихЛиц
		|Справочник.ВыплатаДепонированнойЗарплатыПрисоединенныеФайлы.Изменение.Организации";

КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Определяет объекты, в которых есть процедура ДобавитьКомандыПечати().
// Подробнее см. УправлениеПечатьюПереопределяемый.
//
// Параметры:
//  СписокОбъектов - Массив - список менеджеров объектов.
//
Процедура ПриОпределенииОбъектовСКомандамиПечати(СписокОбъектов) Экспорт
	
	СписокОбъектов.Добавить(Документы.ВыплатаДепонированнойЗарплаты);
	
КонецПроцедуры

#КонецОбласти