
#Область СлужебныйПрограммныйИнтерфейс

Процедура УстановитьПодсказкуЭлементуРуководителя(Форма) Экспорт

	Если ЗначениеЗаполнено(Форма.СотрудникРуководитель) Тогда
		ТекстПодсказки = Строка(Форма.СотрудникРуководитель);
	ИначеЕсли ЗначениеЗаполнено(Форма.ПозицияРуководителя) Тогда
		ТекстПодсказки = НСтр("ru = '<позиция вакантна>'");
	Иначе
		ТекстПодсказки = " ";
	КонецЕсли;
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Форма.Элементы,
		"ПозицияРуководителя",
		"Подсказка",
		ТекстПодсказки);
	
КонецПроцедуры

#КонецОбласти 